@load "rwarray"

BEGIN {
# Скрипт чтения словарных баз в массивы
# Последняя версия файла тут: https://github.com/Balamoote/gtts-scripts
    # let @a=1|%s/;DIC\["\zs[0-9]\+\ze"\]/\=''.(@a+setreg('a',@a+1))/g|%s/k<=\zs\d\+\ze;/\=''.(@a-1)/g
    # %s:\[$1\];\zs\ze:DIC["1"]++;:gc
    # %s:DIC\["\d\+"\]++;::gc

 # Проверяем версию gawk, если меньше 5.2.1, то выключаем функции сохранения и восстановления массивов и переменных: базы тогда читаются всегда заново.
    redix=gawk52="42"
    cmd = "awk -Wversion | head -1"
    cmd|getline verheader; close(cmd)
    split(verheader, gnuawk, "[ .,]")
    if (gnuawk[1] == "GNU" && gnuawk[2] == "Awk" && gnuawk[3] >= 5 && gnuawk[4] >= 2 && gnuawk[5] >= 1) { gawk52 = 1 };
 # Если словари и этот скрипт не изменились и gawk>=5.2.1, восстановить состояние, иначе прочитать всё заново.
   if ( gawk52 == 1 ) {
    cmd   = "md5sum -c --status " inax "classes.md5 >/dev/null 2>&1"
    redix = system(cmd); close(cmd);};

   classcache = inax "classes.bin"

   if (redix == 0 && gawk52 == 1) { readall(classcache) } else {

   cmd = "zcat " indb "dic_prq.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($3== "NOP") { continue };

      if($2~ /_ед_жен_/ ){
       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]ю(ся)?$/  ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_тв$/          ){  pq2_ne_vz_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_тв$/          ){  pq2_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_тв$/              ){  pq2_ne_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_тв$/              ){  pq2_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_тв$/              ){  pq2_pe_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_тв$/              ){  pq2_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_тв$/        ){  pq2_pe_sd_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_тв$/        ){  pq2_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_тв$/              ){  pq2_pn_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_тв$/              ){  pq2_pn_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_тв$/         ){  pqn_ne_vz_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_тв$/         ){  pqn_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_тв$/             ){  pqn_ne_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_тв$/             ){  pqn_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_тв$/             ){  pqn_pe_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_тв$/             ){  pqn_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_тв$/       ){  pqn_pe_sd_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_тв$/       ){  pqn_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_тв$/             ){  pqn_pn_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_тв$/             ){  pqn_pn_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_тв$/           ){  pqs_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_тв$/               ){  pqs_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_тв$/               ){  pqs_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_тв$/         ){  pqs_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_тв$/               ){  pqs_pn_pa_ed_ze_tv     [$1]=$3; continue };
       };                                                      
       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]й(ся)?$/  ){          
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_тв$/          ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_тв$/          ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_тв$/              ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_тв$/              ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_тв$/              ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_тв$/              ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_тв$/        ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_тв$/        ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_тв$/              ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_тв$/              ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_тв$/         ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_тв$/         ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_тв$/             ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_тв$/             ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_тв$/             ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_тв$/             ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_тв$/       ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_тв$/       ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_тв$/             ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_тв$/             ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_тв$/           ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_тв$/               ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_тв$/               ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_тв$/         ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_тв$/               ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_дат$/         ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_дат$/         ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_дат$/             ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_дат$/             ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_дат$/             ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_дат$/             ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_дат$/       ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_дат$/       ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_дат$/             ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_дат$/             ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_дат$/        ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_дат$/        ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_дат$/            ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_дат$/            ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_дат$/            ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_дат$/            ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_дат$/      ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_дат$/      ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_дат$/            ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_дат$/            ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_дат$/          ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_дат$/              ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_дат$/              ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_дат$/        ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_дат$/              ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_пр$/          ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_пр$/          ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_пр$/              ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_пр$/              ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_пр$/              ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_пр$/              ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_пр$/        ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_пр$/        ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_пр$/              ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_пр$/              ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_пр$/         ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_пр$/         ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_пр$/             ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_пр$/             ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_пр$/             ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_пр$/             ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_пр$/       ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_пр$/       ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_пр$/             ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_пр$/             ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_пр$/           ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_пр$/               ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_пр$/               ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_пр$/         ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_пр$/               ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_род$/         ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_род$/         ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_род$/             ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_род$/             ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_род$/             ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_род$/             ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_род$/       ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_род$/       ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_род$/             ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_род$/             ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_род$/        ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_род$/        ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_род$/            ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_род$/            ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_род$/            ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_род$/            ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_род$/      ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_род$/      ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_род$/            ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_род$/            ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_род$/          ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_род$/              ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_род$/              ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_род$/        ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_род$/              ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_им$/          ){  pq2_ne_vz_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_им$/          ){  pq2_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_им$/              ){  pq2_ne_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_им$/              ){  pq2_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_им$/              ){  pq2_pe_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_им$/              ){  pq2_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_им$/        ){  pq2_pe_sd_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_им$/        ){  pq2_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_им$/              ){  pq2_pn_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_им$/              ){  pq2_pn_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_им$/         ){  pqn_ne_vz_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_им$/         ){  pqn_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_им$/             ){  pqn_ne_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_им$/             ){  pqn_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_им$/             ){  pqn_pe_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_им$/             ){  pqn_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_им$/       ){  pqn_pe_sd_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_им$/       ){  pqn_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_им$/             ){  pqn_pn_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_им$/             ){  pqn_pn_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_им$/           ){  pqs_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_им$/               ){  pqs_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_им$/               ){  pqs_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_им$/         ){  pqs_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_им$/               ){  pqs_pn_pa_ed_ze_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_вин$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_вин$/         ){  pq2_ne_vz_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_вин$/         ){  pq2_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_вин$/             ){  pq2_ne_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_вин$/             ){  pq2_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_вин$/             ){  pq2_pe_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_вин$/             ){  pq2_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_вин$/       ){  pq2_pe_sd_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_вин$/       ){  pq2_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_вин$/             ){  pq2_pn_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_вин$/             ){  pq2_pn_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_вин$/        ){  pqn_ne_vz_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_вин$/        ){  pqn_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_вин$/            ){  pqn_ne_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_вин$/            ){  pqn_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_вин$/            ){  pqn_pe_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_вин$/            ){  pqn_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_вин$/      ){  pqn_pe_sd_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_вин$/      ){  pqn_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_вин$/            ){  pqn_pn_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_вин$/            ){  pqn_pn_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_вин$/          ){  pqs_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_вин$/              ){  pqs_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_вин$/              ){  pqs_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_вин$/        ){  pqs_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_вин$/              ){  pqs_pn_pa_ed_ze_vi     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]ю(ся)?$/  ){  pq_edze_tv        [$1]=$3; continue };
#       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]й(ся)?$/  ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_дат$/                      ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_пр$/                       ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_род$/                      ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_им$/                       ){  pq_edze_im        [$1]=$3; continue };
#       if ($2~ /_ед_жен_вин$/                      ){  pq_edze_vi        [$1]=$3; continue };
      if($2~ /_ед_муж_/ ){
       if ($2~ /_ед_муж_вин_неод$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_вин_неод$/    ){  pq2_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_вин_неод$/    ){  pq2_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_вин_неод$/        ){  pq2_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_вин_неод$/        ){  pq2_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_вин_неод$/        ){  pq2_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_вин_неод$/        ){  pq2_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_вин_неод$/  ){  pq2_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_вин_неод$/  ){  pq2_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_вин_неод$/        ){  pq2_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_вин_неод$/        ){  pq2_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_вин_неод$/   ){  pqn_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_вин_неод$/   ){  pqn_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_вин_неод$/       ){  pqn_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_вин_неод$/       ){  pqn_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_вин_неод$/       ){  pqn_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_вин_неод$/       ){  pqn_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_вин_неод$/ ){  pqn_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_вин_неод$/ ){  pqn_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_вин_неод$/       ){  pqn_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_вин_неод$/       ){  pqn_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_вин_неод$/     ){  pqs_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_вин_неод$/         ){  pqs_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_вин_неод$/         ){  pqs_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_вин_неод$/   ){  pqs_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_вин_неод$/         ){  pqs_pn_pa_ed_mu_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_вин_одуш$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_вин_одуш$/    ){  pq2_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_вин_одуш$/    ){  pq2_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_вин_одуш$/        ){  pq2_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_вин_одуш$/        ){  pq2_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_вин_одуш$/        ){  pq2_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_вин_одуш$/        ){  pq2_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_вин_одуш$/  ){  pq2_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_вин_одуш$/  ){  pq2_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_вин_одуш$/        ){  pq2_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_вин_одуш$/        ){  pq2_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_вин_одуш$/   ){  pqn_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_вин_одуш$/   ){  pqn_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_вин_одуш$/       ){  pqn_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_вин_одуш$/       ){  pqn_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_вин_одуш$/       ){  pqn_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_вин_одуш$/       ){  pqn_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_вин_одуш$/ ){  pqn_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_вин_одуш$/ ){  pqn_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_вин_одуш$/       ){  pqn_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_вин_одуш$/       ){  pqn_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_вин_одуш$/     ){  pqs_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_вин_одуш$/         ){  pqs_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_вин_одуш$/         ){  pqs_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_вин_одуш$/   ){  pqs_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_вин_одуш$/         ){  pqs_pn_pa_ed_mu_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_дат$/         ){  pq2_ne_vz_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_дат$/         ){  pq2_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_дат$/             ){  pq2_ne_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_дат$/             ){  pq2_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_дат$/             ){  pq2_pe_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_дат$/             ){  pq2_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_дат$/       ){  pq2_pe_sd_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_дат$/       ){  pq2_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_дат$/             ){  pq2_pn_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_дат$/             ){  pq2_pn_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_дат$/        ){  pqn_ne_vz_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_дат$/        ){  pqn_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_дат$/            ){  pqn_ne_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_дат$/            ){  pqn_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_дат$/            ){  pqn_pe_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_дат$/            ){  pqn_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_дат$/      ){  pqn_pe_sd_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_дат$/      ){  pqn_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_дат$/            ){  pqn_pn_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_дат$/            ){  pqn_pn_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_дат$/          ){  pqs_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_дат$/              ){  pqs_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_дат$/              ){  pqs_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_дат$/        ){  pqs_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_дат$/              ){  pqs_pn_pa_ed_mu_da     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_им$/          ){  pq2_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_им$/          ){  pq2_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_им$/              ){  pq2_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_им$/              ){  pq2_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_им$/              ){  pq2_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_им$/              ){  pq2_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_им$/        ){  pq2_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_им$/        ){  pq2_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_им$/              ){  pq2_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_им$/              ){  pq2_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_им$/         ){  pqn_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_им$/         ){  pqn_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_им$/             ){  pqn_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_им$/             ){  pqn_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_им$/             ){  pqn_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_им$/             ){  pqn_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_им$/       ){  pqn_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_им$/       ){  pqn_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_им$/             ){  pqn_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_им$/             ){  pqn_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_им$/           ){  pqs_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_им$/               ){  pqs_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_им$/               ){  pqs_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_им$/         ){  pqs_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_им$/               ){  pqs_pn_pa_ed_mu_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_пр$/          ){  pq2_ne_vz_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_пр$/          ){  pq2_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_пр$/              ){  pq2_ne_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_пр$/              ){  pq2_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_пр$/              ){  pq2_pe_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_пр$/              ){  pq2_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_пр$/        ){  pq2_pe_sd_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_пр$/        ){  pq2_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_пр$/              ){  pq2_pn_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_пр$/              ){  pq2_pn_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_пр$/         ){  pqn_ne_vz_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_пр$/         ){  pqn_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_пр$/             ){  pqn_ne_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_пр$/             ){  pqn_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_пр$/             ){  pqn_pe_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_пр$/             ){  pqn_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_пр$/       ){  pqn_pe_sd_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_пр$/       ){  pqn_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_пр$/             ){  pqn_pn_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_пр$/             ){  pqn_pn_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_пр$/           ){  pqs_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_пр$/               ){  pqs_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_пр$/               ){  pqs_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_пр$/         ){  pqs_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_пр$/               ){  pqs_pn_pa_ed_mu_pr     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_род$/         ){  pq2_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_род$/         ){  pq2_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_род$/             ){  pq2_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_род$/             ){  pq2_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_род$/             ){  pq2_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_род$/             ){  pq2_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_род$/       ){  pq2_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_род$/       ){  pq2_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_род$/             ){  pq2_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_род$/             ){  pq2_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_род$/        ){  pqn_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_род$/        ){  pqn_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_род$/            ){  pqn_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_род$/            ){  pqn_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_род$/            ){  pqn_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_род$/            ){  pqn_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_род$/      ){  pqn_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_род$/      ){  pqn_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_род$/            ){  pqn_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_род$/            ){  pqn_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_род$/          ){  pqs_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_род$/              ){  pqs_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_род$/              ){  pqs_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_род$/        ){  pqs_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_род$/              ){  pqs_pn_pa_ed_mu_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_тв$/          ){  pq2_ne_vz_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_тв$/          ){  pq2_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_тв$/              ){  pq2_ne_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_тв$/              ){  pq2_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_тв$/              ){  pq2_pe_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_тв$/              ){  pq2_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_тв$/        ){  pq2_pe_sd_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_тв$/        ){  pq2_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_тв$/              ){  pq2_pn_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_тв$/              ){  pq2_pn_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_тв$/         ){  pqn_ne_vz_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_тв$/         ){  pqn_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_тв$/             ){  pqn_ne_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_тв$/             ){  pqn_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_тв$/             ){  pqn_pe_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_тв$/             ){  pqn_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_тв$/       ){  pqn_pe_sd_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_тв$/       ){  pqn_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_тв$/             ){  pqn_pn_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_тв$/             ){  pqn_pn_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_тв$/           ){  pqs_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_тв$/               ){  pqs_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_тв$/               ){  pqs_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_тв$/         ){  pqs_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_тв$/               ){  pqs_pn_pa_ed_mu_tv     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_муж_вин_неод$/                 ){  pq_edmu_im        [$1]=$3; continue };
#       if ($2~ /_ед_муж_вин_одуш$/                 ){  pq_edmu_ro        [$1]=$3; continue };
#	if ($2~ /_ед_муж_им$/                       ){  pq_edmu_im        [$1]=$3; continue };
#       if ($2~ /_ед_муж_пр$/                       ){  pq_edmu_pr        [$1]=$3; continue };
#       if ($2~ /_ед_муж_род$/                      ){  pq_edmu_ro        [$1]=$3; continue };
#       if ($2~ /_ед_муж_тв$/                       ){  pq_edmu_tv        [$1]=$3; continue };
#       if ($2~ /_ед_муж_дат$/                      ){  pq_edmu_da        [$1]=$3; continue };
      if($2~ /_ед_ср_/ ){
       if ($2~ /_ед_ср_вин$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_вин$/          ){  pq2_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_вин$/          ){  pq2_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_вин$/              ){  pq2_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_вин$/              ){  pq2_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_вин$/              ){  pq2_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_вин$/              ){  pq2_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_вин$/        ){  pq2_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_вин$/        ){  pq2_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_вин$/              ){  pq2_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_вин$/              ){  pq2_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_вин$/         ){  pqn_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_вин$/         ){  pqn_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_вин$/             ){  pqn_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_вин$/             ){  pqn_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_вин$/             ){  pqn_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_вин$/             ){  pqn_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_вин$/       ){  pqn_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_вин$/       ){  pqn_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_вин$/             ){  pqn_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_вин$/             ){  pqn_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_вин$/           ){  pqs_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_вин$/               ){  pqs_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_вин$/               ){  pqs_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_вин$/         ){  pqs_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_вин$/               ){  pqs_pn_pa_ed_sr_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_дат$/          ){  pq2_ne_vz_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_дат$/          ){  pq2_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_дат$/              ){  pq2_ne_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_дат$/              ){  pq2_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_дат$/              ){  pq2_pe_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_дат$/              ){  pq2_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_дат$/        ){  pq2_pe_sd_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_дат$/        ){  pq2_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_дат$/              ){  pq2_pn_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_дат$/              ){  pq2_pn_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_дат$/         ){  pqn_ne_vz_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_дат$/         ){  pqn_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_дат$/             ){  pqn_ne_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_дат$/             ){  pqn_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_дат$/             ){  pqn_pe_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_дат$/             ){  pqn_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_дат$/       ){  pqn_pe_sd_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_дат$/       ){  pqn_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_дат$/             ){  pqn_pn_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_дат$/             ){  pqn_pn_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_дат$/           ){  pqs_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_дат$/               ){  pqs_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_дат$/               ){  pqs_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_дат$/         ){  pqs_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_дат$/               ){  pqs_pn_pa_ed_sr_da     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_им$/           ){  pq2_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_им$/           ){  pq2_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_им$/               ){  pq2_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_им$/               ){  pq2_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_им$/               ){  pq2_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_им$/               ){  pq2_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_им$/         ){  pq2_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_им$/         ){  pq2_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_им$/               ){  pq2_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_им$/               ){  pq2_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_им$/          ){  pqn_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_им$/          ){  pqn_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_им$/              ){  pqn_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_им$/              ){  pqn_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_им$/              ){  pqn_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_им$/              ){  pqn_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_им$/        ){  pqn_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_им$/        ){  pqn_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_им$/              ){  pqn_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_им$/              ){  pqn_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_им$/            ){  pqs_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_им$/                ){  pqs_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_им$/                ){  pqs_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_им$/          ){  pqs_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_им$/                ){  pqs_pn_pa_ed_sr_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_пр$/           ){  pq2_ne_vz_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_пр$/           ){  pq2_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_пр$/               ){  pq2_ne_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_пр$/               ){  pq2_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_пр$/               ){  pq2_pe_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_пр$/               ){  pq2_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_пр$/         ){  pq2_pe_sd_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_пр$/         ){  pq2_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_пр$/               ){  pq2_pn_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_пр$/               ){  pq2_pn_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_пр$/          ){  pqn_ne_vz_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_пр$/          ){  pqn_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_пр$/              ){  pqn_ne_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_пр$/              ){  pqn_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_пр$/              ){  pqn_pe_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_пр$/              ){  pqn_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_пр$/        ){  pqn_pe_sd_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_пр$/        ){  pqn_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_пр$/              ){  pqn_pn_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_пр$/              ){  pqn_pn_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_пр$/            ){  pqs_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_пр$/                ){  pqs_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_пр$/                ){  pqs_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_пр$/          ){  pqs_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_пр$/                ){  pqs_pn_pa_ed_sr_pr     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_род$/          ){  pq2_ne_vz_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_род$/          ){  pq2_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_род$/              ){  pq2_ne_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_род$/              ){  pq2_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_род$/              ){  pq2_pe_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_род$/              ){  pq2_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_род$/        ){  pq2_pe_sd_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_род$/        ){  pq2_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_род$/              ){  pq2_pn_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_род$/              ){  pq2_pn_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_род$/         ){  pqn_ne_vz_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_род$/         ){  pqn_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_род$/             ){  pqn_ne_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_род$/             ){  pqn_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_род$/             ){  pqn_pe_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_род$/             ){  pqn_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_род$/       ){  pqn_pe_sd_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_род$/       ){  pqn_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_род$/             ){  pqn_pn_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_род$/             ){  pqn_pn_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_род$/           ){  pqs_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_род$/               ){  pqs_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_род$/               ){  pqs_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_род$/         ){  pqs_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_род$/               ){  pqs_pn_pa_ed_sr_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_тв$/           ){  pq2_ne_vz_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_тв$/           ){  pq2_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_тв$/               ){  pq2_ne_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_тв$/               ){  pq2_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_тв$/               ){  pq2_pe_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_тв$/               ){  pq2_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_тв$/         ){  pq2_pe_sd_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_тв$/         ){  pq2_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_тв$/               ){  pq2_pn_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_тв$/               ){  pq2_pn_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_тв$/          ){  pqn_ne_vz_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_тв$/          ){  pqn_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_тв$/              ){  pqn_ne_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_тв$/              ){  pqn_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_тв$/              ){  pqn_pe_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_тв$/              ){  pqn_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_тв$/        ){  pqn_pe_sd_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_тв$/        ){  pqn_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_тв$/              ){  pqn_pn_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_тв$/              ){  pqn_pn_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_тв$/            ){  pqs_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_тв$/                ){  pqs_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_тв$/                ){  pqs_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_тв$/          ){  pqs_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_тв$/                ){  pqs_pn_pa_ed_sr_tv     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_ср_вин$/                       ){  pq_edsr_im        [$1]=$3; continue };
#       if ($2~ /_ед_ср_дат$/                       ){  pq_edsr_da        [$1]=$3; continue };
#       if ($2~ /_ед_ср_им$/                        ){  pq_edsr_im        [$1]=$3; continue };
#       if ($2~ /_ед_ср_пр$/                        ){  pq_edsr_pr        [$1]=$3; continue };
#       if ($2~ /_ед_ср_род$/                       ){  pq_edsr_ro        [$1]=$3; continue };
#       if ($2~ /_ед_ср_тв$/                        ){  pq_edsr_tv        [$1]=$3; continue };
      if($2~ /_мн_/ ){
       if ($2~ /_мн_вин_неод$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_вин_неод$/        ){  pq2_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_вин_неод$/        ){  pq2_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_вин_неод$/            ){  pq2_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_вин_неод$/            ){  pq2_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_вин_неод$/            ){  pq2_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_вин_неод$/            ){  pq2_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_вин_неод$/      ){  pq2_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_вин_неод$/      ){  pq2_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_вин_неод$/            ){  pq2_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_вин_неод$/            ){  pq2_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_вин_неод$/       ){  pqn_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_вин_неод$/       ){  pqn_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_вин_неод$/           ){  pqn_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_вин_неод$/           ){  pqn_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_вин_неод$/           ){  pqn_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_вин_неод$/           ){  pqn_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_вин_неод$/     ){  pqn_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_вин_неод$/     ){  pqn_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_вин_неод$/           ){  pqn_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_вин_неод$/           ){  pqn_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_вин_неод$/         ){  pqs_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_вин_неод$/             ){  pqs_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_вин_неод$/             ){  pqs_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_вин_неод$/       ){  pqs_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_вин_неод$/             ){  pqs_pn_pa_mn_im        [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_мн_вин_одуш$/ ){                                                         
        if ($2~ /^прч_2вид_непер_воз_наст_мн_вин_одуш$/        ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_вин_одуш$/        ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_вин_одуш$/            ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_вин_одуш$/            ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_вин_одуш$/            ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_вин_одуш$/            ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_вин_одуш$/      ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_вин_одуш$/      ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_вин_одуш$/            ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_вин_одуш$/            ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_вин_одуш$/       ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_вин_одуш$/       ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_вин_одуш$/           ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_вин_одуш$/           ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_вин_одуш$/           ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_вин_одуш$/           ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_вин_одуш$/     ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_вин_одуш$/     ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_вин_одуш$/           ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_вин_одуш$/           ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_вин_одуш$/         ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_вин_одуш$/             ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_вин_одуш$/             ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_вин_одуш$/       ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_вин_одуш$/             ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_мн_дат$/ ){                                                              
        if ($2~ /^прч_2вид_непер_воз_наст_мн_дат$/             ){  pq2_ne_vz_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_дат$/             ){  pq2_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_дат$/                 ){  pq2_ne_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_дат$/                 ){  pq2_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_дат$/                 ){  pq2_pe_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_дат$/                 ){  pq2_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_дат$/           ){  pq2_pe_sd_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_дат$/           ){  pq2_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_дат$/                 ){  pq2_pn_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_дат$/                 ){  pq2_pn_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_дат$/            ){  pqn_ne_vz_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_дат$/            ){  pqn_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_дат$/                ){  pqn_ne_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_дат$/                ){  pqn_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_дат$/                ){  pqn_pe_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_дат$/                ){  pqn_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_дат$/          ){  pqn_pe_sd_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_дат$/          ){  pqn_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_дат$/                ){  pqn_pn_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_дат$/                ){  pqn_pn_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_дат$/              ){  pqs_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_дат$/                  ){  pqs_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_дат$/                  ){  pqs_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_дат$/            ){  pqs_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_дат$/                  ){  pqs_pn_pa_mn_da        [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_мн_им$/ ){                                                               
        if ($2~ /^прч_2вид_непер_воз_наст_мн_им$/              ){  pq2_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_им$/              ){  pq2_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_им$/                  ){  pq2_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_им$/                  ){  pq2_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_им$/                  ){  pq2_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_им$/                  ){  pq2_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_им$/            ){  pq2_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_им$/            ){  pq2_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_им$/                  ){  pq2_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_им$/                  ){  pq2_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_им$/             ){  pqn_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_им$/             ){  pqn_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_им$/                 ){  pqn_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_им$/                 ){  pqn_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_им$/                 ){  pqn_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_им$/                 ){  pqn_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_им$/           ){  pqn_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_им$/           ){  pqn_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_им$/                 ){  pqn_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_им$/                 ){  pqn_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_им$/               ){  pqs_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_им$/                   ){  pqs_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_им$/                   ){  pqs_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_им$/             ){  pqs_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_им$/                   ){  pqs_pn_pa_mn_im        [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_мн_пр$/ ){                                                               
        if ($2~ /^прч_2вид_непер_воз_наст_мн_пр$/              ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_пр$/              ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_пр$/                  ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_пр$/                  ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_пр$/                  ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_пр$/                  ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_пр$/            ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_пр$/            ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_пр$/                  ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_пр$/                  ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_пр$/             ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_пр$/             ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_пр$/                 ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_пр$/                 ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_пр$/                 ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_пр$/                 ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_пр$/           ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_пр$/           ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_пр$/                 ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_пр$/                 ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_пр$/               ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_пр$/                   ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_пр$/                   ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_пр$/             ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_пр$/                   ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_мн_род$/ ){                                                              
        if ($2~ /^прч_2вид_непер_воз_наст_мн_род$/             ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_род$/             ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_род$/                 ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_род$/                 ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_род$/                 ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_род$/                 ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_род$/           ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_род$/           ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_род$/                 ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_род$/                 ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_род$/            ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_род$/            ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_род$/                ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_род$/                ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_род$/                ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_род$/                ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_род$/          ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_род$/          ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_род$/                ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_род$/                ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_род$/              ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_род$/                  ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_род$/                  ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_род$/            ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_род$/                  ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_мн_тв$/ ){                                                               
        if ($2~ /^прч_2вид_непер_воз_наст_мн_тв$/              ){  pq2_ne_vz_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_тв$/              ){  pq2_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_тв$/                  ){  pq2_ne_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_тв$/                  ){  pq2_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_тв$/                  ){  pq2_pe_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_тв$/                  ){  pq2_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_тв$/            ){  pq2_pe_sd_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_тв$/            ){  pq2_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_тв$/                  ){  pq2_pn_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_тв$/                  ){  pq2_pn_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_тв$/             ){  pqn_ne_vz_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_тв$/             ){  pqn_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_тв$/                 ){  pqn_ne_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_тв$/                 ){  pqn_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_тв$/                 ){  pqn_pe_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_тв$/                 ){  pqn_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_тв$/           ){  pqn_pe_sd_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_тв$/           ){  pqn_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_тв$/                 ){  pqn_pn_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_тв$/                 ){  pqn_pn_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_тв$/               ){  pqs_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_тв$/                   ){  pqs_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_тв$/                   ){  pqs_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_тв$/             ){  pqs_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_тв$/                   ){  pqs_pn_pa_mn_tv        [$1]=$3; continue };
       };
      };
#       if ($2~ /_мн_вин_неод$/                     ){  pq_mn_im          [$1]=$3; continue };
#       if ($2~ /_мн_вин_одуш$/                     ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_дат$/                          ){  pq_mn_da          [$1]=$3; continue };
#       if ($2~ /_мн_им$/                           ){  pq_mn_im          [$1]=$3; continue };
#       if ($2~ /_мн_пр$/                           ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_род$/                          ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_тв$/                           ){  pq_mn_tv          [$1]=$3; continue };
      if($2~  /^прч_крат_/ ){
       if ($2~ /_ед_жен$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_жен$/      ){  pq2_na_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_жен$/      ){  pq2_pa_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_жен$/     ){  pqn_na_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_жен$/     ){  pqn_pa_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_жен$/       ){  pqs_pa_kred_ze         [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_ед_муж$/ ){                                                              
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_муж$/      ){  pq2_na_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_муж$/      ){  pq2_pa_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_муж$/     ){  pqn_na_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_муж$/     ){  pqn_pa_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_муж$/       ){  pqs_pa_kred_mu         [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_ед_ср$/ ){                                                               
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_ср$/       ){  pq2_na_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_ср$/       ){  pq2_pa_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_ср$/      ){  pqn_na_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_ср$/      ){  pqn_pa_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_ср$/        ){  pqs_pa_kred_sr         [$1]=$3; continue };
       };                                                                                 
       if ($2~ /_мн$/ ){                                                                  
        if ($2~ /^прч_крат_2вид_перех_страд_наст_мн$/          ){  pq2_na_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_мн$/          ){  pq2_pa_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_мн$/         ){  pqn_na_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_мн$/         ){  pqn_pa_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_мн$/           ){  pqs_pa_krmn            [$1]=$3; continue };
       };
      };
     }; # чтение prq-dic
#       if ($2~ /_ед_жен$/                          ){  pq_kred_ze        [$1]=$3; continue };
#       if ($2~ /_ед_муж$/                          ){  pq_kred_mu        [$1]=$3; continue };
#       if ($2~ /_ед_ср$/                           ){  pq_kred_sr        [$1]=$3; continue };
#       if ($2~ /_мн$/                              ){  pq_krmn           [$1]=$3; continue };
   close(cmd);
   cmd = "zcat " indb "dic_prl.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($3== "NOP") { continue };

      if($2~  /^прл_ед_жен_/ ){
        if ($2~ /^прл_ед_жен_тв$/ && $1~ /[ео]ю$/   ){  pl_edze_tv        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_тв$/ && $1~ /[ео]й$/   ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_вин$/                  ){  pl_edze_vi        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_дат$/                  ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_им$/                   ){  pl_edze_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_пр$/                   ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_род$/                  ){  pl_edze_dr        [$1]=$3; continue };
      };
      if($2~  /^прл_ед_муж_/ ){
        if ($2~ /^прл_ед_муж_вин_неод$/             ){  pl_edmu_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_вин_одуш$/             ){  pl_edmu_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_дат$/                  ){  pl_edmu_da        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_им$/                   ){  pl_edmu_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_пр$/                   ){  pl_edmu_pr        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_род$/                  ){  pl_edmu_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_тв$/                   ){  pl_edmu_tv        [$1]=$3; continue };
      };
      if($2~  /^прл_ед_ср_/ ){
        if ($2~ /^прл_ед_ср_вин$/                   ){  pl_edsr_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_дат$/                   ){  pl_edsr_da        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_им$/                    ){  pl_edsr_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_пр$/                    ){  pl_edsr_pr        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_род$/                   ){  pl_edsr_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_тв$/                    ){  pl_edsr_tv        [$1]=$3; continue };
      };
      if($2~  /^прл_мн_/ ){
        if ($2~ /^прл_мн_вин_неод$/                 ){  pl_mn_im          [$1]=$3; continue };
        if ($2~ /^прл_мн_вин_одуш$/                 ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_дат$/                      ){  pl_mn_da          [$1]=$3; continue };
        if ($2~ /^прл_мн_им$/                       ){  pl_mn_im          [$1]=$3; continue };
        if ($2~ /^прл_мн_пр$/                       ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_род$/                      ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_тв$/                       ){  pl_mn_tv          [$1]=$3; continue };
      };
        if ($2~ /^прл_сравн$/                       ){  pl_srv            [$1]=$3; continue };
      if($2~  /^прл_крат_/ ){
        if ($2~ /^прл_крат_ед_муж$/                 ){  pl_kred_mu        [$1]=$3; continue };
        if ($2~ /^прл_крат_ед_жен$/                 ){  pl_kred_ze        [$1]=$3; continue };
        if ($2~ /^прл_крат_ед_ср$/                  ){  pl_kred_sr        [$1]=$3; continue };
        if ($2~ /^прл_крат_мн$/                     ){  pl_krmn           [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_жен_/ ){
        if ($2~ /^прл_прев_ед_жен_тв$/ &&$1~/[ео]ю$/){  pl_pv_edze_tv     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_тв$/ &&$1~/[ео]й$/){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_вин$/             ){  pl_pv_edze_vi     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_дат$/             ){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_им$/              ){  pl_pv_edze_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_пр$/              ){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_род$/             ){  pl_pv_edze_dr     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_муж_/ ){
        if ($2~ /^прл_прев_ед_муж_вин_неод$/        ){  pl_pv_edmu_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_вин_одуш$/        ){  pl_pv_edmu_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_дат$/             ){  pl_pv_edmu_da     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_им$/              ){  pl_pv_edmu_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_пр$/              ){  pl_pv_edmu_pr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_род$/             ){  pl_pv_edmu_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_тв$/              ){  pl_pv_edmu_tv     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_ср_/ ){
        if ($2~ /^прл_прев_ед_ср_вин$/              ){  pl_pv_edsr_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_дат$/              ){  pl_pv_edsr_da     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_им$/               ){  pl_pv_edsr_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_пр$/               ){  pl_pv_edsr_pr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_род$/              ){  pl_pv_edsr_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_тв$/               ){  pl_pv_edsr_tv     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_мн_/ ){
        if ($2~ /^прл_прев_мн_вин_неод$/            ){  pl_pv_mn_im       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_вин_одуш$/            ){  pl_pv_mn_ro       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_дат$/                 ){  pl_pv_mn_da       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_им$/                  ){  pl_pv_mn_im       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_пр$/                  ){  pl_pv_mn_pr       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_род$/                 ){  pl_pv_mn_ro       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_тв$/                  ){  pl_pv_mn_tv       [$1]=$3; continue };
      };
        if ($2~ /^прл_неизм$/                       ){  pl_neiz           [$1]=$3; continue };
    }; # чтение prl-dic
   close(cmd);
   cmd = "zcat " indb "dic_suw.gz " indb "dic_suw_add.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($3== "NOP") { continue };

      if ($2~ /^сущ_неод_/ ) {
       if ($2~ /^сущ_неод_мн_/ ) {
        if ($2~ /^сущ_неод_мн_вин$/                 ){  swn_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_дат$/                 ){  swn_mn_da         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_им$/                  ){  swn_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_пр$/                  ){  swn_mn_pr         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_род$/                 ){  swn_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_тв$/                  ){  swn_mn_tv         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_нескл$/               ){  swn_mn_ne         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_счет$/                ){  swn_mn_sq         [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_жен_/ ) {
        if ($2~ /^сущ_неод_ед_жен_тв$/              ){  swn_edze_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_вин$/             ){  swn_edze_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_дат$/             ){  swn_edze_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_им$/              ){  swn_edze_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_пр$/              ){  swn_edze_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_род$/             ){  swn_edze_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_нескл$/           ){  swn_edze_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_мест$/            ){  swn_edze_me       [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_муж_/ ) {
        if ($2~ /^сущ_неод_ед_муж_вин$/             ){  swn_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_дат$/             ){  swn_edmu_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_им$/              ){  swn_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_пр$/              ){  swn_edmu_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_род$/             ){  swn_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_тв$/              ){  swn_edmu_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_нескл$/           ){  swn_edmu_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_мест$/            ){  swn_edmu_me       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_парт$/            ){  swn_edmu_pt       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_счет$/            ){  swn_edmu_sq       [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_ср_/ ) {
        if ($2~ /^сущ_неод_ед_ср_вин$/              ){  swn_edsr_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_дат$/              ){  swn_edsr_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_им$/               ){  swn_edsr_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_пр$/               ){  swn_edsr_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_род$/              ){  swn_edsr_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_тв$/               ){  swn_edsr_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_нескл$/            ){  swn_edsr_ne       [$1]=$3; continue };
       };
        if ($2~ /^сущ_неод_ед_общ_вин$/             ){  swn_edob_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_дат$/             ){  swn_edob_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_им$/              ){  swn_edob_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_нескл$/           ){  swn_edob_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_пр$/              ){  swn_edob_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_род$/             ){  swn_edob_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_тв$/              ){  swn_edob_tv       [$1]=$3; continue };
      };
      if ($2~ /^сущ_одуш_/ ) {
       if ($2~ /^сущ_одуш_мн_/ ) {
        if ($2~ /^сущ_одуш_мн_вин$/                 ){  swo_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_дат$/                 ){  swo_mn_da         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_им$/                  ){  swo_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_пр$/                  ){  swo_mn_pr         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_род$/                 ){  swo_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_тв$/                  ){  swo_mn_tv         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_нескл$/               ){  swo_mn_ne         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_счет$/                ){  swo_mn_sq         [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_муж_/ ) {
        if ($2~ /^сущ_одуш_ед_муж_вин$/             ){  swo_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_дат$/             ){  swo_edmu_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_им$/              ){  swo_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_пр$/              ){  swo_edmu_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_род$/             ){  swo_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_тв$/              ){  swo_edmu_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_нескл$/           ){  swo_edmu_ne       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_зват$/            ){  swo_edmu_zv       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_жен_/ ) {
        if ($2~ /^сущ_одуш_ед_жен_тв$/              ){  swo_edze_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_вин$/             ){  swo_edze_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_дат$/             ){  swo_edze_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_им$/              ){  swo_edze_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_пр$/              ){  swo_edze_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_род$/             ){  swo_edze_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_нескл$/           ){  swo_edze_ne       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_зват$/            ){  swo_edze_zv       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_общ_/ ) {
        if ($2~ /^сущ_одуш_ед_общ_тв$/              ){  swo_edob_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_вин$/             ){  swo_edob_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_дат$/             ){  swo_edob_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_им$/              ){  swo_edob_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_пр$/              ){  swo_edob_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_род$/             ){  swo_edob_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_нескл$/           ){  swo_edob_ne       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_ср_/ ) {
        if ($2~ /^сущ_одуш_ед_ср_вин$/              ){  swo_edsr_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_дат$/              ){  swo_edsr_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_им$/               ){  swo_edsr_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_пр$/               ){  swo_edsr_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_род$/              ){  swo_edsr_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_тв$/               ){  swo_edsr_tv       [$1]=$3; continue };
       };
      };
      if ($2~ /^сущ_мн_/ ) {
        if ($2~ /^сущ_мн_дат$/                      ){  sw_mn_da          [$1]=$3; continue };
        if ($2~ /^сущ_мн_им$/                       ){  sw_mn_im          [$1]=$3; continue };
        if ($2~ /^сущ_мн_пр$/                       ){  sw_mn_pr          [$1]=$3; continue };
        if ($2~ /^сущ_мн_род$/                      ){  sw_mn_ro          [$1]=$3; continue };
        if ($2~ /^сущ_мн_тв$/                       ){  sw_mn_tv          [$1]=$3; continue };
        if ($2~ /^сущ_мн_вин$/                      ){  sw_mn_vi          [$1]=$3; continue };
        if ($2~ /^сущ_мн_нескл$/                    ){  sw_mn_ne          [$1]=$3; continue };
      };
      if ($2~ /^сущ_ед_жен_/ ) {
        if ($2~ /^сущ_ед_жен_тв$/                   ){  sw_edze_tv        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_вин$/                  ){  sw_edze_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_дат$/                  ){  sw_edze_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_им$/                   ){  sw_edze_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_пр$/                   ){  sw_edze_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_род$/                  ){  sw_edze_ro        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_муж_/ ) {
        if ($2~ /^сущ_ед_муж_дат$/                  ){  sw_edmu_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_им$/                   ){  sw_edmu_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_пр$/                   ){  sw_edmu_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_род$/                  ){  sw_edmu_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_тв$/                   ){  sw_edmu_tv        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_вин$/                  ){  sw_edmu_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_нескл$/                ){  sw_edmu_ne        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_общ_/ ) {
        if ($2~ /^сущ_ед_общ_нескл$/                ){  sw_edob_ne        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_вин$/                  ){  sw_edob_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_дат$/                  ){  sw_edob_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_им$/                   ){  sw_edob_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_пр$/                   ){  sw_edob_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_род$/                  ){  sw_edob_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_тв$/                   ){  sw_edob_tv        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_ср_/ ) {
        if ($2~ /^сущ_ед_ср_вин$/                   ){  sw_edsr_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_дат$/                   ){  sw_edsr_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_им$/                    ){  sw_edsr_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_пр$/                    ){  sw_edsr_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_род$/                   ){  sw_edsr_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_тв$/                    ){  sw_edsr_tv        [$1]=$3; continue };
      };
    }; # чтение suw-dic
   close(cmd);
   cmd = "zcat " indb "dic_gl.gz " indb "dic_gl_add.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($3== "NOP") { continue };

      if($2~  /^гл_несов_непер_/ ){

        if ($2~ /^гл_несов_непер_воз_инф$/          ){  gn_vz_ne_in       [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_воз_наст_/ ) {
        if ($2~ /^гл_несов_непер_воз_наст_ед_1е$/   ){  gn_vz_nena_e1     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_ед_2е$/   ){  gn_vz_nena_e2     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_ед_3е$/   ){  gn_vz_nena_e3     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_1е$/   ){  gn_vz_nena_m1     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_2е$/   ){  gn_vz_nena_m2     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_3е$/   ){  gn_vz_nena_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_воз_пов_ед$/       ){  gn_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_пов_мн$/       ){  gn_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_воз_прош_/ ) {
        if ($2~ /^гл_несов_непер_воз_прош_ед_жен$/  ){  gn_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_ед_муж$/  ){  gn_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_ед_ср$/   ){  gn_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_мн$/      ){  gn_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_инф$/              ){  gn_nein           [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_наст_/ ) {
        if ($2~ /^гл_несов_непер_наст_ед_1е$/       ){  gn_nena_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_ед_2е$/       ){  gn_nena_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_ед_3е$/       ){  gn_nena_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_1е$/       ){  gn_nena_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_2е$/       ){  gn_nena_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_3е$/       ){  gn_nena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_пов_ед$/           ){  gn_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_пов_мн$/           ){  gn_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_прош_/ ) {
        if ($2~ /^гл_несов_непер_прош_ед_жен$/      ){  gn_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_ед_муж$/      ){  gn_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_ед_ср$/       ){  gn_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_мн$/          ){  gn_nepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_инф_безл$/         ){  gn_nein_bz        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_инф_безл$/     ){  gn_vz_nein_bz     [$1]=$3; continue };

      };
      if($2~  /^гл_несов_перех_/ ){

        if ($2~ /^гл_несов_перех_инф$/              ){  gn_pein           [$1]=$3; continue };

       if ($2~ /^гл_несов_перех_наст_/ ) {
        if ($2~ /^гл_несов_перех_наст_ед_1е$/       ){  gn_pena_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_ед_2е$/       ){  gn_pena_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_ед_3е$/       ){  gn_pena_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_1е$/       ){  gn_pena_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_2е$/       ){  gn_pena_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_3е$/       ){  gn_pena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перех_пов_ед$/           ){  gn_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_пов_мн$/           ){  gn_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_перех_прош_/ ) {
        if ($2~ /^гл_несов_перех_прош_ед_жен$/      ){  gn_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_ед_муж$/      ){  gn_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_ед_ср$/       ){  gn_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_мн$/          ){  gn_pepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перех_инф_безл$/         ){  gn_pein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_несов_перне_/ ){

        if ($2~ /^гл_несов_перне_инф$/              ){  gn_pnin           [$1]=$3; continue };

       if ($2~ /^гл_несов_перне_наст_/ ) {
        if ($2~ /^гл_несов_перне_наст_ед_1е$/       ){  gn_pnna_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_ед_2е$/       ){  gn_pnna_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_ед_3е$/       ){  gn_pnna_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_1е$/       ){  gn_pnna_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_2е$/       ){  gn_pnna_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_3е$/       ){  gn_pnna_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перне_пов_ед$/           ){  gn_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_пов_мн$/           ){  gn_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_перне_прош_/ ) {
        if ($2~ /^гл_несов_перне_прош_ед_жен$/      ){  gn_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_ед_муж$/      ){  gn_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_ед_ср$/       ){  gn_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_мн$/          ){  gn_pnpa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_сов_непер_/ ){
       if ($2~ /^гл_сов_непер_буд_/ ) {
        if ($2~ /^гл_сов_непер_буд_ед_1е$/          ){  gs_nebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_ед_2е$/          ){  gs_nebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_ед_3е$/          ){  gs_nebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_1е$/          ){  gs_nebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_2е$/          ){  gs_nebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_3е$/          ){  gs_nebu_m3        [$1]=$3; continue };
       };
       if ($2~ /^гл_сов_непер_воз_буд_/ ) {
        if ($2~ /^гл_сов_непер_воз_буд_ед_1е$/      ){  gs_vz_nebu_e1     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_ед_2е$/      ){  gs_vz_nebu_e2     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_ед_3е$/      ){  gs_vz_nebu_e3     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_1е$/      ){  gs_vz_nebu_m1     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_2е$/      ){  gs_vz_nebu_m2     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_3е$/      ){  gs_vz_nebu_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_воз_инф$/            ){  gs_vz_nein        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_пов_ед$/         ){  gs_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_пов_мн$/         ){  gs_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_сов_непер_воз_прош_/ ) {
        if ($2~ /^гл_сов_непер_воз_прош_ед_жен$/    ){  gs_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_ед_муж$/    ){  gs_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_ед_ср$/     ){  gs_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_мн$/        ){  gs_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_инф$/                ){  gs_nein           [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_пов_ед$/             ){  gs_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_пов_мн$/             ){  gs_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_непер_прош_/ ) {
        if ($2~ /^гл_сов_непер_прош_ед_жен$/        ){  gs_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_ед_муж$/        ){  gs_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_ед_ср$/         ){  gs_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_мн$/            ){  gs_nepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_воз_инф_безл$/       ){  gs_vz_nein_bz     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_инф_безл$/           ){  gs_nein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_сов_перех_/ ){
       if ($2~ /^гл_сов_перех_буд_/ ) {
        if ($2~ /^гл_сов_перех_буд_ед_1е$/          ){  gs_pebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_ед_2е$/          ){  gs_pebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_ед_3е$/          ){  gs_pebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_1е$/          ){  gs_pebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_2е$/          ){  gs_pebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_3е$/          ){  gs_pebu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перех_инф$/                ){  gs_pein           [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_пов_ед$/             ){  gs_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_пов_мн$/             ){  gs_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_перех_прош_/ ) {
        if ($2~ /^гл_сов_перех_прош_ед_жен$/        ){  gs_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_ед_муж$/        ){  gs_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_ед_ср$/         ){  gs_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_мн$/            ){  gs_pepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перех_инф_безл$/           ){  gs_pein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_сов_перне_/ ){
       if ($2~ /^гл_сов_перне_буд_/ ) {
        if ($2~ /^гл_сов_перне_буд_ед_1е$/          ){  gs_pnbu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_ед_2е$/          ){  gs_pnbu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_ед_3е$/          ){  gs_pnbu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_1е$/          ){  gs_pnbu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_2е$/          ){  gs_pnbu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_3е$/          ){  gs_pnbu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перне_инф$/                ){  gs_pnin           [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_пов_ед$/             ){  gs_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_пов_мн$/             ){  gs_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_перне_прош_/ ) {
        if ($2~ /^гл_сов_перне_прош_ед_жен$/        ){  gs_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_ед_муж$/        ){  gs_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_ед_ср$/         ){  gs_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_мн$/            ){  gs_pnpa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_перех_/ ){
       if ($2~ /^гл_2вид_перех_буд_/ ) {
        if ($2~ /^гл_2вид_перех_буд_ед_1е$/         ){  g2_pebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_ед_2е$/         ){  g2_pebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_ед_3е$/         ){  g2_pebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_1е$/         ){  g2_pebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_2е$/         ){  g2_pebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_3е$/         ){  g2_pebu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перех_инф$/               ){  g2_pein           [$1]=$3; continue };

       if ($2~ /^гл_2вид_перех_наст_/ ) {
        if ($2~ /^гл_2вид_перех_наст_ед_1е$/        ){  g2_pena_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_ед_2е$/        ){  g2_pena_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_ед_3е$/        ){  g2_pena_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_1е$/        ){  g2_pena_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_2е$/        ){  g2_pena_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_3е$/        ){  g2_pena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перех_пов_ед$/            ){  g2_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_пов_мн$/            ){  g2_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_перех_прош_/ ) {
        if ($2~ /^гл_2вид_перех_прош_ед_жен$/       ){  g2_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_ед_муж$/       ){  g2_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_ед_ср$/        ){  g2_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_мн$/           ){  g2_pepa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_непер_/ ){
       if ($2~ /^гл_2вид_непер_буд_/ ) {
        if ($2~ /^гл_2вид_непер_буд_ед_1е$/         ){  g2_nebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_ед_2е$/         ){  g2_nebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_ед_3е$/         ){  g2_nebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_1е$/         ){  g2_nebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_2е$/         ){  g2_nebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_3е$/         ){  g2_nebu_m3        [$1]=$3; continue };
       };
       if ($2~ /^гл_2вид_непер_воз_буд_/ ) {
        if ($2~ /^гл_2вид_непер_воз_буд_ед_1е$/     ){  g2_vz_nebu_e1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_ед_2е$/     ){  g2_vz_nebu_e2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_ед_3е$/     ){  g2_vz_nebu_e3     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_1е$/     ){  g2_vz_nebu_m1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_2е$/     ){  g2_vz_nebu_m2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_3е$/     ){  g2_vz_nebu_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_воз_инф$/           ){  g2_vz_nein        [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_воз_наст_/ ) {
        if ($2~ /^гл_2вид_непер_воз_наст_ед_1е$/    ){  g2_vz_nena_e1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_ед_2е$/    ){  g2_vz_nena_e2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_ед_3е$/    ){  g2_vz_nena_e3     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_1е$/    ){  g2_vz_nena_m1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_2е$/    ){  g2_vz_nena_m2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_3е$/    ){  g2_vz_nena_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_воз_пов_ед$/        ){  g2_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_пов_мн$/        ){  g2_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_воз_прош_/ ) {
        if ($2~ /^гл_2вид_непер_воз_прош_ед_жен$/   ){  g2_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_ед_муж$/   ){  g2_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_ед_ср$/    ){  g2_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_мн$/       ){  g2_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_инф$/               ){  g2_nein           [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_наст_/ ) {
        if ($2~ /^гл_2вид_непер_наст_ед_1е$/        ){  g2_nena_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_ед_2е$/        ){  g2_nena_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_ед_3е$/        ){  g2_nena_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_1е$/        ){  g2_nena_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_2е$/        ){  g2_nena_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_3е$/        ){  g2_nena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_пов_ед$/            ){  g2_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_пов_мн$/            ){  g2_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_прош_/ ) {
        if ($2~ /^гл_2вид_непер_прош_ед_жен$/       ){  g2_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_ед_муж$/       ){  g2_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_ед_ср$/        ){  g2_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_мн$/           ){  g2_nepa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_перне_/ ){
       if ($2~ /^гл_2вид_перне_буд_/ ) {
        if ($2~ /^гл_2вид_перне_буд_ед_1е$/         ){  g2_pnbu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_ед_2е$/         ){  g2_pnbu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_ед_3е$/         ){  g2_pnbu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_1е$/         ){  g2_pnbu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_2е$/         ){  g2_pnbu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_3е$/         ){  g2_pnbu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перне_инф$/               ){  g2_pnin           [$1]=$3; continue };

       if ($2~ /^гл_2вид_перне_наст_/ ) {
        if ($2~ /^гл_2вид_перне_наст_ед_1е$/        ){  g2_pnna_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_ед_2е$/        ){  g2_pnna_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_ед_3е$/        ){  g2_pnna_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_1е$/        ){  g2_pnna_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_2е$/        ){  g2_pnna_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_3е$/        ){  g2_pnna_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перне_пов_ед$/            ){  g2_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_пов_мн$/            ){  g2_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_перне_прош_/ ) {
        if ($2~ /^гл_2вид_перне_прош_ед_жен$/       ){  g2_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_ед_муж$/       ){  g2_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_ед_ср$/        ){  g2_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_мн$/           ){  g2_pnpa_mn        [$1]=$3; continue };
       };
      };
       if ($2~  /^дееп_/ ){
        if ($2~ /^дееп_сов_перех_прош$/             ){  dps_pe_pa         [$1]=$3; continue };
        if ($2~ /^дееп_сов_непер_воз_прош$/         ){  dps_vz_ne_pa      [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_воз_наст$/       ){  dpn_vz_ne_na      [$1]=$3; continue };
        if ($2~ /^дееп_несов_перех_наст$/           ){  dpn_pe_na         [$1]=$3; continue };
        if ($2~ /^дееп_сов_непер_прош$/             ){  dps_ne_pa         [$1]=$3; continue };
        if ($2~ /^дееп_сов_перне_прош$/             ){  dps_pn_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_наст$/           ){  dpn_ne_na         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перне_наст$/           ){  dpn_pn_na         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перех_прош$/           ){  dpn_pe_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перне_прош$/           ){  dpn_pn_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_прош$/           ){  dpn_ne_pa         [$1]=$3; continue };
       };
    }; # чтение gl-dic

   close(cmd);
   cmd = "zcat " indb "dic_rest.gz " indb "dic_rest_add.gz";
   while ((cmd|getline) > 0) {

    if ($1~  "-"  ) { dichyph[$1] };
    if ($3== "NOP") { continue };

    if($2~  /^нар/ ){
        if ($2~ /^нар_сравн$/                       ){  nr_srv            [$1]=$3; continue };
        if ($2~ /^нар_опред_кач$/                   ){  nr_opka           [$1]=$3; continue };
        if ($2~ /^нар_опред_спос$/                  ){  nr_opsp           [$1]=$3; continue };
        if ($2~ /^нар_опред_степ$/                  ){  nr_opst           [$1]=$3; continue };
        if ($2~ /^нар_обст_врем$/                   ){  nr_obvr           [$1]=$3; continue };
        if ($2~ /^нар_обст_места$/                  ){  nr_obme           [$1]=$3; continue };
        if ($2~ /^нар_обст_напр$/                   ){  nr_obna           [$1]=$3; continue };
        if ($2~ /^нар_обст_причин$/                 ){  nr_obpr           [$1]=$3; continue };
        if ($2~ /^нар_обст_цель$/                   ){  nr_obce           [$1]=$3; continue };
        if ($2~ /^нар_вопр$/                        ){  nr_vopr           [$1]=$3; continue };
        if ($2~ /^нар_мест$/                        ){  nr_mest           [$1]=$3; continue };
        if ($2~ /^нар_прев$/                        ){  nr_pv             [$1]=$3; continue };
        if ($2~ /^нар$/                             ){  nr_nar            [$1]=$3; continue };
    };

        if ($2~ /^предик$/                          ){  predk             [$1]=$3; continue };
        if ($2~ /^межд$/                            ){  mzd               [$1]=$3; continue };
        if ($2~ /^част$/                            ){  qst               [$1]=$3; continue };
        if ($2~ /^ввод$/                            ){  vvodn             [$1]=$3; continue };
        if ($2~ /^союз$/                            ){  soyz              [$1]=$3; continue };

    if($2~  /^мест_/ ){
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин$/       ){  mst_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин_неод$/  ){  mst_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин_одуш$/  ){  mst_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_дат$/       ){  mst_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_им$/        ){  mst_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_пр$/        ){  mst_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_род$/       ){  mst_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_тв$/        ){  mst_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_вин$/       ){  mst_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_дат$/       ){  mst_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_им$/        ){  mst_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_пр$/        ){  mst_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_род$/       ){  mst_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_тв$/        ){  mst_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_вин$/        ){  mst_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_дат$/        ){  mst_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_им$/         ){  mst_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_пр$/         ){  mst_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_род$/        ){  mst_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_тв$/         ){  mst_ed_sr_tv      [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_мн_вин_неод$/      ){  mst_mn_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_вин_одуш$/      ){  mst_mn_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_вин$/           ){  mst_mn_vi         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_дат$/           ){  mst_mn_da         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_им$/            ){  mst_mn_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_пр$/            ){  mst_mn_pr         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_род$/           ){  mst_mn_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_тв$/            ){  mst_mn_tv         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_ед_вин$/           ){  mst_ed_vi         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_им$/            ){  mst_ed_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_дат$/           ){  mst_ed_da         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_пр$/            ){  mst_ed_pr         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_род$/           ){  mst_ed_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_тв$/            ){  mst_ed_tv         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_ед_муж$/           ){  mst_ed_mu         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен$/           ){  mst_ed_ze         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_им$/               ){  mst_im            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_вин$/              ){  mst_vi            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_дат$/              ){  mst_da            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_пр$/               ){  mst_pr            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_род$/              ){  mst_ro            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_тв$/               ){  mst_tv            [$1]=$3; continue };
        if ($2~ /^мест_прл_мн$/                     ){  mst_mn            [$1]=$3; continue };

        if ($2~ /^мест_сущ$/                        ){  mst_suw           [$1]=$3; continue };
        if ($2~ /^мест_прл_ед_ср$/                  ){  mst_ed_sr         [$1]=$3; continue };
    };
    if($2~  /^предл_/ ){
        if ($2~ /^предл_вин$/                       ){  pred_vi           [$1]=$3; continue };
        if ($2~ /^предл_дат$/                       ){  pred_da           [$1]=$3; continue };
        if ($2~ /^предл_им$/                        ){  pred_im           [$1]=$3; continue };
        if ($2~ /^предл_пр$/                        ){  pred_pr           [$1]=$3; continue };
        if ($2~ /^предл_род$/                       ){  pred_ro           [$1]=$3; continue };
        if ($2~ /^предл_тв$/                        ){  pred_tv           [$1]=$3; continue };
    };
    if ($2~ /^числ_/ ) {                                qall              [$1]=$3;
      if ($2~ /^числ_кол_/ ) {
        if ($2~ /^числ_кол_вин$/                    ){  qko_vi            [$1]=$3; continue };
        if ($2~ /^числ_кол_дат$/                    ){  qko_da            [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_вин$/             ){  qko_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_дат$/             ){  qko_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_им$/              ){  qko_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_пр$/              ){  qko_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_род$/             ){  qko_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_тв$/              ){  qko_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_вин$/             ){  qko_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_дат$/             ){  qko_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_им$/              ){  qko_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_пр$/              ){  qko_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_род$/             ){  qko_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_тв$/              ){  qko_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_вин$/              ){  qko_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_дат$/              ){  qko_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_им$/               ){  qko_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_пр$/               ){  qko_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_род$/              ){  qko_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_тв$/               ){  qko_ed_sr_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_жен_вин$/                ){  qko_ze_vi         [$1]=$3; continue };
        if ($2~ /^числ_кол_жен_им$/                 ){  qko_ze_im         [$1]=$3; continue };
        if ($2~ /^числ_кол_им$/                     ){  qko_im            [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_вин$/                 ){  qko_mn_vi         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_дат$/                 ){  qko_mn_da         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_им$/                  ){  qko_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_пр$/                  ){  qko_mn_pr         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_род$/                 ){  qko_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_тв$/                  ){  qko_mn_tv         [$1]=$3; continue };
        if ($2~ /^числ_кол_пр$/                     ){  qko_pr            [$1]=$3; continue };
        if ($2~ /^числ_кол_род$/                    ){  qko_ro            [$1]=$3; continue };
        if ($2~ /^числ_кол_тв$/                     ){  qko_tv            [$1]=$3; continue };
      };
      if ($2~ /^числ_неопр_/ ) {

        if ($2~ /^числ_неопр_вин$/                  ){  qne_vi            [$1]=$3; continue };
        if ($2~ /^числ_неопр_дат$/                  ){  qne_da            [$1]=$3; continue };
        if ($2~ /^числ_неопр_им$/                   ){  qne_im            [$1]=$3; continue };
        if ($2~ /^числ_неопр_пр$/                   ){  qne_pr            [$1]=$3; continue };
        if ($2~ /^числ_неопр_род$/                  ){  qne_ro            [$1]=$3; continue };
        if ($2~ /^числ_неопр_тв$/                   ){  qne_tv            [$1]=$3; continue };
      };
      if ($2~ /^числ_поряд_/ ) {

        if ($2~ /^числ_поряд_ед_жен_вин$/           ){  qpo_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_дат$/           ){  qpo_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_им$/            ){  qpo_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_пр$/            ){  qpo_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_род$/           ){  qpo_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_тв$/            ){  qpo_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_вин_неод$/      ){  qpo_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_вин_одуш$/      ){  qpo_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_дат$/           ){  qpo_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_им$/            ){  qpo_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_пр$/            ){  qpo_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_род$/           ){  qpo_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_тв$/            ){  qpo_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_вин$/            ){  qpo_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_дат$/            ){  qpo_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_им$/             ){  qpo_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_пр$/             ){  qpo_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_род$/            ){  qpo_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_тв$/             ){  qpo_ed_sr_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_вин_неод$/          ){  qpo_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_вин_одуш$/          ){  qpo_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_дат$/               ){  qpo_mn_da         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_им$/                ){  qpo_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_пр$/                ){  qpo_mn_pr         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_род$/               ){  qpo_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_тв$/                ){  qpo_mn_tv         [$1]=$3; continue };
      };
      if ($2~ /^числ_собир_/ ) {

        if ($2~ /^числ_собир_вин$/                  ){  qso_vi            [$1]=$3; continue };
        if ($2~ /^числ_собир_дат$/                  ){  qso_da            [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_вин$/              ){  qso_ze_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_дат$/              ){  qso_ze_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_им$/               ){  qso_ze_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_пр$/               ){  qso_ze_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_род$/              ){  qso_ze_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_тв$/               ){  qso_ze_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_им$/                   ){  qso_im            [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_вин$/              ){  qso_mu_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_дат$/              ){  qso_mu_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_им$/               ){  qso_mu_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_пр$/               ){  qso_mu_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_род$/              ){  qso_mu_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_тв$/               ){  qso_mu_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_пр$/                   ){  qso_pr            [$1]=$3; continue };
        if ($2~ /^числ_собир_род$/                  ){  qso_ro            [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_вин$/               ){  qso_sr_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_дат$/               ){  qso_sr_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_им$/                ){  qso_sr_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_пр$/                ){  qso_sr_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_род$/               ){  qso_sr_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_тв$/                ){  qso_sr_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_тв$/                   ){  qso_tv            [$1]=$3; continue };
      };
    };
   }; # чтение rest-dic
   close(cmd);
   cmd = "zcat " indb "dic_cust.gz";
   while ((cmd|getline) > 0) {

   if ($1~  "-"  ) { dichyph[$1] };
   if ($3== "NOP") { continue };

#       if ($2~ /^gl_/ && $2~ /_мн/ && $2!~ /_пов/ && $2!~ /_воз/ ){ gc_mn[$1]=$3; continue };
#       if ($2~ /^gl_/ && $2~ /_инф/                              ){ gc_in[$1]=$3; continue };
#       if ($2~ /^gl_/ && $2~ /_пов/                              ){ gc_po[$1]=$3;          };
#       if ($2~ /^gl_/ && $2~ /_ед/                               ){ gc_ed[$1]=$3; continue };

   if ($2~ /^muk_/) {
        if($2~  /_ед_муж_им$/                       ){  muc_edmuim        [$1]=$3; continue };
        if($2~  /_ед_жен_им$/                       ){  muc_edzeim        [$1]=$3; continue };
        if($2~  /_ед_ср_им$/                        ){  muc_edsrim        [$1]=$3; continue };
        if($2~  /_ед_муж_вин/                       ){  muc_edmuvi        [$1]=$3; continue };
        if($2~  /_ед_жен_вин/                       ){  muc_edzevi        [$1]=$3; continue };
        if($2~  /_ед_ср_вин/                        ){  muc_edsrvi        [$1]=$3; continue };
        if($2~  /_ед_муж_дат$/                      ){  muc_edmuda        [$1]=$3; continue };
        if($2~  /_ед_жен_дат$/                      ){  muc_edzeda        [$1]=$3; continue };
        if($2~  /_ед_ср_дат$/                       ){  muc_edsrda        [$1]=$3; continue };
        if($2~  /_ед_муж_род$/                      ){  muc_edmuro        [$1]=$3; continue };
        if($2~  /_ед_жен_род$/                      ){  muc_edzero        [$1]=$3; continue };
        if($2~  /_ед_ср_род$/                       ){  muc_edsrro        [$1]=$3; continue };
        if($2~  /_ед_муж_тв$/                       ){  muc_edmutv        [$1]=$3; continue };
        if($2~  /_ед_жен_тв$/                       ){  muc_edzetv        [$1]=$3; continue };
        if($2~  /_ед_ср_тв$/                        ){  muc_edsrtv        [$1]=$3; continue };
        if($2~  /_ед_муж_пр$/                       ){  muc_edmupr        [$1]=$3; continue };
        if($2~  /_ед_жен_пр$/                       ){  muc_edzepr        [$1]=$3; continue };
        if($2~  /_ед_ср_пр$/                        ){  muc_edsrpr        [$1]=$3; continue };
        if($2~  /_мн_им$/                           ){  muc_mnim          [$1]=$3; continue };
        if($2~  /_мн_вин/                           ){  muc_mnvi          [$1]=$3; continue };
        if($2~  /_мн_дат$/                          ){  muc_mnda          [$1]=$3; continue };
        if($2~  /_мн_род$/                          ){  muc_mnro          [$1]=$3; continue };
        if($2~  /_мн_тв$/                           ){  muc_mntv          [$1]=$3; continue };
        if($2~  /_мн_пр$/                           ){  muc_mnpr          [$1]=$3; continue };
        if($2~  /^muk_прл_им$/                      ){  muc_mnim          [$1]=$3; continue };
        if($2~  /^muk_прл_вин$/                     ){  muc_mnvi          [$1]=$3; continue };
        if($2~  /^muk_прл_дат$/                     ){  muc_mnda          [$1]=$3; continue };
        if($2~  /^muk_прл_род$/                     ){  muc_mnro          [$1]=$3; continue };
        if($2~  /^muk_прл_тв$/                      ){  muc_mntv          [$1]=$3; continue };
        if($2~  /^muk_прл_пр$/                      ){  muc_mnpr          [$1]=$3; continue };
   };
   if ($2~ /^otnmest_/) {
        if($2~  /_ед_муж_им$/                       ){  otm_edmuim        [$1]=$3; continue };
        if($2~  /_ед_жен_им$/                       ){  otm_edzeim        [$1]=$3; continue };
        if($2~  /_ед_ср_им$/                        ){  otm_edsrim        [$1]=$3; continue };
        if($2~  /_ед_муж_вин/                       ){  otm_edmuvi        [$1]=$3; continue };
        if($2~  /_ед_жен_вин/                       ){  otm_edzevi        [$1]=$3; continue };
        if($2~  /_ед_ср_вин/                        ){  otm_edsrvi        [$1]=$3; continue };
        if($2~  /_ед_муж_дат$/                      ){  otm_edmuda        [$1]=$3; continue };
        if($2~  /_ед_жен_дат$/                      ){  otm_edzeda        [$1]=$3; continue };
        if($2~  /_ед_ср_дат$/                       ){  otm_edsrda        [$1]=$3; continue };
        if($2~  /_ед_муж_род$/                      ){  otm_edmuro        [$1]=$3; continue };
        if($2~  /_ед_жен_род$/                      ){  otm_edzero        [$1]=$3; continue };
        if($2~  /_ед_ср_род$/                       ){  otm_edsrro        [$1]=$3; continue };
        if($2~  /_ед_муж_тв$/                       ){  otm_edmutv        [$1]=$3; continue };
        if($2~  /_ед_жен_тв$/                       ){  otm_edzetv        [$1]=$3; continue };
        if($2~  /_ед_ср_тв$/                        ){  otm_edsrtv        [$1]=$3; continue };
        if($2~  /_ед_муж_пр$/                       ){  otm_edmupr        [$1]=$3; continue };
        if($2~  /_ед_жен_пр$/                       ){  otm_edzepr        [$1]=$3; continue };
        if($2~  /_ед_ср_пр$/                        ){  otm_edsrpr        [$1]=$3; continue };
        if($2~  /_мн_им$/                           ){  otm_mnim          [$1]=$3; continue };
        if($2~  /_мн_вин/                           ){  otm_mnvi          [$1]=$3; continue };
        if($2~  /_мн_дат$/                          ){  otm_mnda          [$1]=$3; continue };
        if($2~  /_мн_род$/                          ){  otm_mnro          [$1]=$3; continue };
        if($2~  /_мн_тв$/                           ){  otm_mntv          [$1]=$3; continue };
        if($2~  /_мн_пр$/                           ){  otm_mnpr          [$1]=$3; continue };
    };
#   if($2~  /^nac/ ){
#       if ($2~ /^nar_сравн$/                       ){  nrc_srv           [$1]=$3; continue };
#       if ($2~ /^nar_опред_кач$/                   ){  nrc_opka          [$1]=$3; continue };
        if ($2~ /^nar_опред_спос$/                  ){  nrc_opsp          [$1]=$3; continue };
#       if ($2~ /^nar_опред_степ$/                  ){  nrc_opst          [$1]=$3; continue };
#       if ($2~ /^nar_обст_врем$/                   ){  nrc_obvr          [$1]=$3; continue };
#       if ($2~ /^nar_обст_места$/                  ){  nrc_obme          [$1]=$3; continue };
        if ($2~ /^nar_обст_напр$/                   ){  nrc_obna          [$1]=$3; continue };
#       if ($2~ /^nar_обст_причин$/                 ){  nrc_obpr          [$1]=$3; continue };
#       if ($2~ /^nar_обст_цель$/                   ){  nrc_obce          [$1]=$3; continue };
#       if ($2~ /^nar_вопр$/                        ){  nrc_vopr          [$1]=$3; continue };
#       if ($2~ /^nar_мест$/                        ){  nrc_mest          [$1]=$3; continue };
#       if ($2~ /^nar_прев$/                        ){  nrc_pv            [$1]=$3; continue };
#       if ($2~ /^nar$/                             ){  nrc_nar           [$1]=$3; continue };
#   };

   if ($2~ /^titl_/                                 ){  titl               [$1]=$3; continue };

   if ($2~ /^md/) {
        if($2~  /^mdbz_/                            ){  md_bz             [$1]=$3; continue };
        if($2~  /^mded_/                            ){  md_ed             [$1]=$3; continue };
        if($2~  /^mdmn_/                            ){  md_mn             [$1]=$3; continue };
      };
   if ($2~ /^geo_/) {
        if($2~  /^geo_ед_ср_им$/                    ){  geo_edsrim        [$1]=$3; continue };
        if($2~  /^geo_мн_им$/                       ){  geo_mnim          [$1]=$3; continue };
      };
   } close(cmd);

 # Список классов омографов с описательными тэгами. Неочевидные кодировки в позиции падежа: z=партитив, l=локатив, q=счетная форма
   cmd = "zcat " indb "class.list.gz";
   while ((cmd|getline) > 0) {
	   for (i=2; i<=NF; i++) { xclass[$1][i-1]=$i };
   } close(cmd);

   cmd = "zcat " indb "automo.gz | \
          sed -r 's/([аеёиоуыэюя])\\x27/\\1\\xcc\\x81/g; \
                  s/\\\\xcc\\\\xa0/\\xcc\\xa0/g; \
                  s/\\\\xcc\\\\xa3/\\xcc\\xa3/g; \
                  s/\\\\xcc\\\\xa4/\\xcc\\xa4/g; \
                  s/\\\\xcc\\\\xad/\\xcc\\xad/g; \
                  s/\\\\xcc\\\\xb0/\\xcc\\xb0/g; \
                  s/^(x[0-9]+)\\s([^ ]+)\\s([^ ]+)\\s([^ ]+)(\\s.+)?/\\1 \\3 \\2 \\4 \\u\\2 \\u\\4 \\U\\2\\E \\U\\4\\E \\5/g'";
                                                                    #  1   2   3   4      5      6      7         8      9
   while ((cmd|getline) > 0) {

         if($1== "x1000" ){ almo[$3]=almo[$5]=almo[$7]="x1000"; x1000[$2][$3]=$4; x1000[$2][$5]=$6; x1000[$2][$7]=$8; x1000["info"][$3]=$9; continue };
         if($1== "x1001" ){ almo[$3]=almo[$5]=almo[$7]="x1001"; x1001[$2][$3]=$4; x1001[$2][$5]=$6; x1001[$2][$7]=$8; x1001["info"][$3]=$9; continue };
         if($1== "x1002" ){ almo[$3]=almo[$5]=almo[$7]="x1002"; x1002[$2][$3]=$4; x1002[$2][$5]=$6; x1002[$2][$7]=$8; x1002["info"][$3]=$9; continue };
         if($1== "x1003" ){ almo[$3]=almo[$5]=almo[$7]="x1003"; x1003[$2][$3]=$4; x1003[$2][$5]=$6; x1003[$2][$7]=$8; x1003["info"][$3]=$9; continue };
         if($1== "x1004" ){ almo[$3]=almo[$5]=almo[$7]="x1004"; x1004[$2][$3]=$4; x1004[$2][$5]=$6; x1004[$2][$7]=$8; x1004["info"][$3]=$9; continue };
         if($1== "x1005" ){ almo[$3]=almo[$5]=almo[$7]="x1005"; x1005[$2][$3]=$4; x1005[$2][$5]=$6; x1005[$2][$7]=$8; x1005["info"][$3]=$9; continue };
         if($1== "x1006" ){ almo[$3]=almo[$5]=almo[$7]="x1006"; x1006[$2][$3]=$4; x1006[$2][$5]=$6; x1006[$2][$7]=$8; x1006["info"][$3]=$9; continue };
         if($1== "x1007" ){ almo[$3]=almo[$5]=almo[$7]="x1007"; x1007[$2][$3]=$4; x1007[$2][$5]=$6; x1007[$2][$7]=$8; x1007["info"][$3]=$9; continue };
         if($1== "x1008" ){ almo[$3]=almo[$5]=almo[$7]="x1008"; x1008[$2][$3]=$4; x1008[$2][$5]=$6; x1008[$2][$7]=$8; x1008["info"][$3]=$9; continue };
         if($1== "x1009" ){ almo[$3]=almo[$5]=almo[$7]="x1009"; x1009[$2][$3]=$4; x1009[$2][$5]=$6; x1009[$2][$7]=$8; x1009["info"][$3]=$9; continue };
         if($1== "x1010" ){ almo[$3]=almo[$5]=almo[$7]="x1010"; x1010[$2][$3]=$4; x1010[$2][$5]=$6; x1010[$2][$7]=$8; x1010["info"][$3]=$9; continue };
         if($1== "x1011" ){ almo[$3]=almo[$5]=almo[$7]="x1011"; x1011[$2][$3]=$4; x1011[$2][$5]=$6; x1011[$2][$7]=$8; x1011["info"][$3]=$9; continue };
         if($1== "x1012" ){ almo[$3]=almo[$5]=almo[$7]="x1012"; x1012[$2][$3]=$4; x1012[$2][$5]=$6; x1012[$2][$7]=$8; x1012["info"][$3]=$9; continue };
         if($1== "x1013" ){ almo[$3]=almo[$5]=almo[$7]="x1013"; x1013[$2][$3]=$4; x1013[$2][$5]=$6; x1013[$2][$7]=$8; x1013["info"][$3]=$9; continue };
         if($1== "x1014" ){ almo[$3]=almo[$5]=almo[$7]="x1014"; x1014[$2][$3]=$4; x1014[$2][$5]=$6; x1014[$2][$7]=$8; x1014["info"][$3]=$9; continue };
         if($1== "x1015" ){ almo[$3]=almo[$5]=almo[$7]="x1015"; x1015[$2][$3]=$4; x1015[$2][$5]=$6; x1015[$2][$7]=$8; x1015["info"][$3]=$9; continue };
         if($1== "x1016" ){ almo[$3]=almo[$5]=almo[$7]="x1016"; x1016[$2][$3]=$4; x1016[$2][$5]=$6; x1016[$2][$7]=$8; x1016["info"][$3]=$9; continue };
         if($1== "x1017" ){ almo[$3]=almo[$5]=almo[$7]="x1017"; x1017[$2][$3]=$4; x1017[$2][$5]=$6; x1017[$2][$7]=$8; x1017["info"][$3]=$9; continue };
         if($1== "x1018" ){ almo[$3]=almo[$5]=almo[$7]="x1018"; x1018[$2][$3]=$4; x1018[$2][$5]=$6; x1018[$2][$7]=$8; x1018["info"][$3]=$9; continue };
         if($1== "x1019" ){ almo[$3]=almo[$5]=almo[$7]="x1019"; x1019[$2][$3]=$4; x1019[$2][$5]=$6; x1019[$2][$7]=$8; x1019["info"][$3]=$9; continue };
         if($1== "x1020" ){ almo[$3]=almo[$5]=almo[$7]="x1020"; x1020[$2][$3]=$4; x1020[$2][$5]=$6; x1020[$2][$7]=$8; x1020["info"][$3]=$9; continue };
         if($1== "x1021" ){ almo[$3]=almo[$5]=almo[$7]="x1021"; x1021[$2][$3]=$4; x1021[$2][$5]=$6; x1021[$2][$7]=$8; x1021["info"][$3]=$9; continue };
         if($1== "x1022" ){ almo[$3]=almo[$5]=almo[$7]="x1022"; x1022[$2][$3]=$4; x1022[$2][$5]=$6; x1022[$2][$7]=$8; x1022["info"][$3]=$9; continue };
         if($1== "x1023" ){ almo[$3]=almo[$5]=almo[$7]="x1023"; x1023[$2][$3]=$4; x1023[$2][$5]=$6; x1023[$2][$7]=$8; x1023["info"][$3]=$9; continue };
         if($1== "x1024" ){ almo[$3]=almo[$5]=almo[$7]="x1024"; x1024[$2][$3]=$4; x1024[$2][$5]=$6; x1024[$2][$7]=$8; x1024["info"][$3]=$9; continue };
         if($1== "x1025" ){ almo[$3]=almo[$5]=almo[$7]="x1025"; x1025[$2][$3]=$4; x1025[$2][$5]=$6; x1025[$2][$7]=$8; x1025["info"][$3]=$9; continue };
         if($1== "x1026" ){ almo[$3]=almo[$5]=almo[$7]="x1026"; x1026[$2][$3]=$4; x1026[$2][$5]=$6; x1026[$2][$7]=$8; x1026["info"][$3]=$9; continue };
         if($1== "x1027" ){ almo[$3]=almo[$5]=almo[$7]="x1027"; x1027[$2][$3]=$4; x1027[$2][$5]=$6; x1027[$2][$7]=$8; x1027["info"][$3]=$9; continue };
         if($1== "x1028" ){ almo[$3]=almo[$5]=almo[$7]="x1028"; x1028[$2][$3]=$4; x1028[$2][$5]=$6; x1028[$2][$7]=$8; x1028["info"][$3]=$9; continue };
         if($1== "x1029" ){ almo[$3]=almo[$5]=almo[$7]="x1029"; x1029[$2][$3]=$4; x1029[$2][$5]=$6; x1029[$2][$7]=$8; x1029["info"][$3]=$9; continue };
         if($1== "x1030" ){ almo[$3]=almo[$5]=almo[$7]="x1030"; x1030[$2][$3]=$4; x1030[$2][$5]=$6; x1030[$2][$7]=$8; x1030["info"][$3]=$9; continue };
         if($1== "x1031" ){ almo[$3]=almo[$5]=almo[$7]="x1031"; x1031[$2][$3]=$4; x1031[$2][$5]=$6; x1031[$2][$7]=$8; x1031["info"][$3]=$9; continue };
         if($1== "x1032" ){ almo[$3]=almo[$5]=almo[$7]="x1032"; x1032[$2][$3]=$4; x1032[$2][$5]=$6; x1032[$2][$7]=$8; x1032["info"][$3]=$9; continue };
         if($1== "x1033" ){ almo[$3]=almo[$5]=almo[$7]="x1033"; x1033[$2][$3]=$4; x1033[$2][$5]=$6; x1033[$2][$7]=$8; x1033["info"][$3]=$9; continue };
         if($1== "x1034" ){ almo[$3]=almo[$5]=almo[$7]="x1034"; x1034[$2][$3]=$4; x1034[$2][$5]=$6; x1034[$2][$7]=$8; x1034["info"][$3]=$9; continue };
         if($1== "x1035" ){ almo[$3]=almo[$5]=almo[$7]="x1035"; x1035[$2][$3]=$4; x1035[$2][$5]=$6; x1035[$2][$7]=$8; x1035["info"][$3]=$9; continue };
         if($1== "x1036" ){ almo[$3]=almo[$5]=almo[$7]="x1036"; x1036[$2][$3]=$4; x1036[$2][$5]=$6; x1036[$2][$7]=$8; x1036["info"][$3]=$9; continue };
         if($1== "x1037" ){ almo[$3]=almo[$5]=almo[$7]="x1037"; x1037[$2][$3]=$4; x1037[$2][$5]=$6; x1037[$2][$7]=$8; x1037["info"][$3]=$9; continue };
         if($1== "x1038" ){ almo[$3]=almo[$5]=almo[$7]="x1038"; x1038[$2][$3]=$4; x1038[$2][$5]=$6; x1038[$2][$7]=$8; x1038["info"][$3]=$9; continue };
         if($1== "x1039" ){ almo[$3]=almo[$5]=almo[$7]="x1039"; x1039[$2][$3]=$4; x1039[$2][$5]=$6; x1039[$2][$7]=$8; x1039["info"][$3]=$9; continue };
         if($1== "x1040" ){ almo[$3]=almo[$5]=almo[$7]="x1040"; x1040[$2][$3]=$4; x1040[$2][$5]=$6; x1040[$2][$7]=$8; x1040["info"][$3]=$9; continue };
         if($1== "x1041" ){ almo[$3]=almo[$5]=almo[$7]="x1041"; x1041[$2][$3]=$4; x1041[$2][$5]=$6; x1041[$2][$7]=$8; x1041["info"][$3]=$9; continue };
         if($1== "x1042" ){ almo[$3]=almo[$5]=almo[$7]="x1042"; x1042[$2][$3]=$4; x1042[$2][$5]=$6; x1042[$2][$7]=$8; x1042["info"][$3]=$9; continue };
         if($1== "x1043" ){ almo[$3]=almo[$5]=almo[$7]="x1043"; x1043[$2][$3]=$4; x1043[$2][$5]=$6; x1043[$2][$7]=$8; x1043["info"][$3]=$9; continue };
         if($1== "x1044" ){ almo[$3]=almo[$5]=almo[$7]="x1044"; x1044[$2][$3]=$4; x1044[$2][$5]=$6; x1044[$2][$7]=$8; x1044["info"][$3]=$9; continue };
         if($1== "x1045" ){ almo[$3]=almo[$5]=almo[$7]="x1045"; x1045[$2][$3]=$4; x1045[$2][$5]=$6; x1045[$2][$7]=$8; x1045["info"][$3]=$9; continue };
         if($1== "x1046" ){ almo[$3]=almo[$5]=almo[$7]="x1046"; x1046[$2][$3]=$4; x1046[$2][$5]=$6; x1046[$2][$7]=$8; x1046["info"][$3]=$9; continue };
         if($1== "x1047" ){ almo[$3]=almo[$5]=almo[$7]="x1047"; x1047[$2][$3]=$4; x1047[$2][$5]=$6; x1047[$2][$7]=$8; x1047["info"][$3]=$9; continue };
         if($1== "x1048" ){ almo[$3]=almo[$5]=almo[$7]="x1048"; x1048[$2][$3]=$4; x1048[$2][$5]=$6; x1048[$2][$7]=$8; x1048["info"][$3]=$9; continue };
         if($1== "x1049" ){ almo[$3]=almo[$5]=almo[$7]="x1049"; x1049[$2][$3]=$4; x1049[$2][$5]=$6; x1049[$2][$7]=$8; x1049["info"][$3]=$9; continue };
         if($1== "x1050" ){ almo[$3]=almo[$5]=almo[$7]="x1050"; x1050[$2][$3]=$4; x1050[$2][$5]=$6; x1050[$2][$7]=$8; x1050["info"][$3]=$9; continue };
         if($1== "x1051" ){ almo[$3]=almo[$5]=almo[$7]="x1051"; x1051[$2][$3]=$4; x1051[$2][$5]=$6; x1051[$2][$7]=$8; x1051["info"][$3]=$9; continue };
         if($1== "x1052" ){ almo[$3]=almo[$5]=almo[$7]="x1052"; x1052[$2][$3]=$4; x1052[$2][$5]=$6; x1052[$2][$7]=$8; x1052["info"][$3]=$9; continue };
         if($1== "x1053" ){ almo[$3]=almo[$5]=almo[$7]="x1053"; x1053[$2][$3]=$4; x1053[$2][$5]=$6; x1053[$2][$7]=$8; x1053["info"][$3]=$9; continue };
         if($1== "x1054" ){ almo[$3]=almo[$5]=almo[$7]="x1054"; x1054[$2][$3]=$4; x1054[$2][$5]=$6; x1054[$2][$7]=$8; x1054["info"][$3]=$9; continue };
         if($1== "x1055" ){ almo[$3]=almo[$5]=almo[$7]="x1055"; x1055[$2][$3]=$4; x1055[$2][$5]=$6; x1055[$2][$7]=$8; x1055["info"][$3]=$9; continue };
         if($1== "x1056" ){ almo[$3]=almo[$5]=almo[$7]="x1056"; x1056[$2][$3]=$4; x1056[$2][$5]=$6; x1056[$2][$7]=$8; x1056["info"][$3]=$9; continue };
         if($1== "x1057" ){ almo[$3]=almo[$5]=almo[$7]="x1057"; x1057[$2][$3]=$4; x1057[$2][$5]=$6; x1057[$2][$7]=$8; x1057["info"][$3]=$9; continue };
         if($1== "x1058" ){ almo[$3]=almo[$5]=almo[$7]="x1058"; x1058[$2][$3]=$4; x1058[$2][$5]=$6; x1058[$2][$7]=$8; x1058["info"][$3]=$9; continue };
         if($1== "x1059" ){ almo[$3]=almo[$5]=almo[$7]="x1059"; x1059[$2][$3]=$4; x1059[$2][$5]=$6; x1059[$2][$7]=$8; x1059["info"][$3]=$9; continue };
         if($1== "x1060" ){ almo[$3]=almo[$5]=almo[$7]="x1060"; x1060[$2][$3]=$4; x1060[$2][$5]=$6; x1060[$2][$7]=$8; x1060["info"][$3]=$9; continue };
         if($1== "x1061" ){ almo[$3]=almo[$5]=almo[$7]="x1061"; x1061[$2][$3]=$4; x1061[$2][$5]=$6; x1061[$2][$7]=$8; x1061["info"][$3]=$9; continue };
         if($1== "x1062" ){ almo[$3]=almo[$5]=almo[$7]="x1062"; x1062[$2][$3]=$4; x1062[$2][$5]=$6; x1062[$2][$7]=$8; x1062["info"][$3]=$9; continue };
         if($1== "x1063" ){ almo[$3]=almo[$5]=almo[$7]="x1063"; x1063[$2][$3]=$4; x1063[$2][$5]=$6; x1063[$2][$7]=$8; x1063["info"][$3]=$9; continue };
         if($1== "x1064" ){ almo[$3]=almo[$5]=almo[$7]="x1064"; x1064[$2][$3]=$4; x1064[$2][$5]=$6; x1064[$2][$7]=$8; x1064["info"][$3]=$9; continue };
         if($1== "x1065" ){ almo[$3]=almo[$5]=almo[$7]="x1065"; x1065[$2][$3]=$4; x1065[$2][$5]=$6; x1065[$2][$7]=$8; x1065["info"][$3]=$9; continue };
         if($1== "x1066" ){ almo[$3]=almo[$5]=almo[$7]="x1066"; x1066[$2][$3]=$4; x1066[$2][$5]=$6; x1066[$2][$7]=$8; x1066["info"][$3]=$9; continue };
         if($1== "x1067" ){ almo[$3]=almo[$5]=almo[$7]="x1067"; x1067[$2][$3]=$4; x1067[$2][$5]=$6; x1067[$2][$7]=$8; x1067["info"][$3]=$9; continue };
         if($1== "x1068" ){ almo[$3]=almo[$5]=almo[$7]="x1068"; x1068[$2][$3]=$4; x1068[$2][$5]=$6; x1068[$2][$7]=$8; x1068["info"][$3]=$9; continue };
         if($1== "x1069" ){ almo[$3]=almo[$5]=almo[$7]="x1069"; x1069[$2][$3]=$4; x1069[$2][$5]=$6; x1069[$2][$7]=$8; x1069["info"][$3]=$9; continue };
         if($1== "x1070" ){ almo[$3]=almo[$5]=almo[$7]="x1070"; x1070[$2][$3]=$4; x1070[$2][$5]=$6; x1070[$2][$7]=$8; x1070["info"][$3]=$9; continue };
         if($1== "x1071" ){ almo[$3]=almo[$5]=almo[$7]="x1071"; x1071[$2][$3]=$4; x1071[$2][$5]=$6; x1071[$2][$7]=$8; x1071["info"][$3]=$9; continue };
         if($1== "x1072" ){ almo[$3]=almo[$5]=almo[$7]="x1072"; x1072[$2][$3]=$4; x1072[$2][$5]=$6; x1072[$2][$7]=$8; x1072["info"][$3]=$9; continue };
         if($1== "x2001" ){ almo[$3]=almo[$5]=almo[$7]="x2001"; x2001[$2][$3]=$4; x2001[$2][$5]=$6; x2001[$2][$7]=$8; x2001["info"][$3]=$9; continue };
         if($1== "x2002" ){ almo[$3]=almo[$5]=almo[$7]="x2002"; x2002[$2][$3]=$4; x2002[$2][$5]=$6; x2002[$2][$7]=$8; x2002["info"][$3]=$9; continue };
         if($1== "x2003" ){ almo[$3]=almo[$5]=almo[$7]="x2003"; x2003[$2][$3]=$4; x2003[$2][$5]=$6; x2003[$2][$7]=$8; x2003["info"][$3]=$9; continue };
         if($1== "x2004" ){ almo[$3]=almo[$5]=almo[$7]="x2004"; x2004[$2][$3]=$4; x2004[$2][$5]=$6; x2004[$2][$7]=$8; x2004["info"][$3]=$9; continue };
         if($1== "x2005" ){ almo[$3]=almo[$5]=almo[$7]="x2005"; x2005[$2][$3]=$4; x2005[$2][$5]=$6; x2005[$2][$7]=$8; x2005["info"][$3]=$9; continue };
         if($1== "x2006" ){ almo[$3]=almo[$5]=almo[$7]="x2006"; x2006[$2][$3]=$4; x2006[$2][$5]=$6; x2006[$2][$7]=$8; x2006["info"][$3]=$9; continue };
         if($1== "x2007" ){ almo[$3]=almo[$5]=almo[$7]="x2007"; x2007[$2][$3]=$4; x2007[$2][$5]=$6; x2007[$2][$7]=$8; x2007["info"][$3]=$9; continue };
         if($1== "x2008" ){ almo[$3]=almo[$5]=almo[$7]="x2008"; x2008[$2][$3]=$4; x2008[$2][$5]=$6; x2008[$2][$7]=$8; x2008["info"][$3]=$9; continue };
         if($1== "x2009" ){ almo[$3]=almo[$5]=almo[$7]="x2009"; x2009[$2][$3]=$4; x2009[$2][$5]=$6; x2009[$2][$7]=$8; x2009["info"][$3]=$9; continue };
         if($1== "x2010" ){ almo[$3]=almo[$5]=almo[$7]="x2010"; x2010[$2][$3]=$4; x2010[$2][$5]=$6; x2010[$2][$7]=$8; x2010["info"][$3]=$9; continue };
         if($1== "x2011" ){ almo[$3]=almo[$5]=almo[$7]="x2011"; x2011[$2][$3]=$4; x2011[$2][$5]=$6; x2011[$2][$7]=$8; x2011["info"][$3]=$9; continue };
         if($1== "x2012" ){ almo[$3]=almo[$5]=almo[$7]="x2012"; x2012[$2][$3]=$4; x2012[$2][$5]=$6; x2012[$2][$7]=$8; x2012["info"][$3]=$9; continue };
         if($1== "x2013" ){ almo[$3]=almo[$5]=almo[$7]="x2013"; x2013[$2][$3]=$4; x2013[$2][$5]=$6; x2013[$2][$7]=$8; x2013["info"][$3]=$9; continue };
         if($1== "x2014" ){ almo[$3]=almo[$5]=almo[$7]="x2014"; x2014[$2][$3]=$4; x2014[$2][$5]=$6; x2014[$2][$7]=$8; x2014["info"][$3]=$9; continue };
         if($1== "x2015" ){ almo[$3]=almo[$5]=almo[$7]="x2015"; x2015[$2][$3]=$4; x2015[$2][$5]=$6; x2015[$2][$7]=$8; x2015["info"][$3]=$9; continue };
         if($1== "x2016" ){ almo[$3]=almo[$5]=almo[$7]="x2016"; x2016[$2][$3]=$4; x2016[$2][$5]=$6; x2016[$2][$7]=$8; x2016["info"][$3]=$9; continue };
         if($1== "x2017" ){ almo[$3]=almo[$5]=almo[$7]="x2017"; x2017[$2][$3]=$4; x2017[$2][$5]=$6; x2017[$2][$7]=$8; x2017["info"][$3]=$9; continue };
         if($1== "x2018" ){ almo[$3]=almo[$5]=almo[$7]="x2018"; x2018[$2][$3]=$4; x2018[$2][$5]=$6; x2018[$2][$7]=$8; x2018["info"][$3]=$9; continue };
         if($1== "x2019" ){ almo[$3]=almo[$5]=almo[$7]="x2019"; x2019[$2][$3]=$4; x2019[$2][$5]=$6; x2019[$2][$7]=$8; x2019["info"][$3]=$9; continue };
         if($1== "x2020" ){ almo[$3]=almo[$5]=almo[$7]="x2020"; x2020[$2][$3]=$4; x2020[$2][$5]=$6; x2020[$2][$7]=$8; x2020["info"][$3]=$9; continue };
         if($1== "x2021" ){ almo[$3]=almo[$5]=almo[$7]="x2021"; x2021[$2][$3]=$4; x2021[$2][$5]=$6; x2021[$2][$7]=$8; x2021["info"][$3]=$9; continue };
         if($1== "x2022" ){ almo[$3]=almo[$5]=almo[$7]="x2022"; x2022[$2][$3]=$4; x2022[$2][$5]=$6; x2022[$2][$7]=$8; x2022["info"][$3]=$9; continue };
         if($1== "x2023" ){ almo[$3]=almo[$5]=almo[$7]="x2023"; x2023[$2][$3]=$4; x2023[$2][$5]=$6; x2023[$2][$7]=$8; x2023["info"][$3]=$9; continue };
         if($1== "x2024" ){ almo[$3]=almo[$5]=almo[$7]="x2024"; x2024[$2][$3]=$4; x2024[$2][$5]=$6; x2024[$2][$7]=$8; x2024["info"][$3]=$9; continue };
         if($1== "x2025" ){ almo[$3]=almo[$5]=almo[$7]="x2025"; x2025[$2][$3]=$4; x2025[$2][$5]=$6; x2025[$2][$7]=$8; x2025["info"][$3]=$9; continue };
         if($1== "x2026" ){ almo[$3]=almo[$5]=almo[$7]="x2026"; x2026[$2][$3]=$4; x2026[$2][$5]=$6; x2026[$2][$7]=$8; x2026["info"][$3]=$9; continue };
         if($1== "x2027" ){ almo[$3]=almo[$5]=almo[$7]="x2027"; x2027[$2][$3]=$4; x2027[$2][$5]=$6; x2027[$2][$7]=$8; x2027["info"][$3]=$9; continue };
         if($1== "x2028" ){ almo[$3]=almo[$5]=almo[$7]="x2028"; x2028[$2][$3]=$4; x2028[$2][$5]=$6; x2028[$2][$7]=$8; x2028["info"][$3]=$9; continue };
         if($1== "x2029" ){ almo[$3]=almo[$5]=almo[$7]="x2029"; x2029[$2][$3]=$4; x2029[$2][$5]=$6; x2029[$2][$7]=$8; x2029["info"][$3]=$9; continue };
         if($1== "x2030" ){ almo[$3]=almo[$5]=almo[$7]="x2030"; x2030[$2][$3]=$4; x2030[$2][$5]=$6; x2030[$2][$7]=$8; x2030["info"][$3]=$9; continue };
         if($1== "x2031" ){ almo[$3]=almo[$5]=almo[$7]="x2031"; x2031[$2][$3]=$4; x2031[$2][$5]=$6; x2031[$2][$7]=$8; x2031["info"][$3]=$9; continue };
         if($1== "x2032" ){ almo[$3]=almo[$5]=almo[$7]="x2032"; x2032[$2][$3]=$4; x2032[$2][$5]=$6; x2032[$2][$7]=$8; x2032["info"][$3]=$9; continue };
         if($1== "x2033" ){ almo[$3]=almo[$5]=almo[$7]="x2033"; x2033[$2][$3]=$4; x2033[$2][$5]=$6; x2033[$2][$7]=$8; x2033["info"][$3]=$9; continue };
         if($1== "x2034" ){ almo[$3]=almo[$5]=almo[$7]="x2034"; x2034[$2][$3]=$4; x2034[$2][$5]=$6; x2034[$2][$7]=$8; x2034["info"][$3]=$9; continue };
         if($1== "x2035" ){ almo[$3]=almo[$5]=almo[$7]="x2035"; x2035[$2][$3]=$4; x2035[$2][$5]=$6; x2035[$2][$7]=$8; x2035["info"][$3]=$9; continue };
         if($1== "x2036" ){ almo[$3]=almo[$5]=almo[$7]="x2036"; x2036[$2][$3]=$4; x2036[$2][$5]=$6; x2036[$2][$7]=$8; x2036["info"][$3]=$9; continue };
         if($1== "x2037" ){ almo[$3]=almo[$5]=almo[$7]="x2037"; x2037[$2][$3]=$4; x2037[$2][$5]=$6; x2037[$2][$7]=$8; x2037["info"][$3]=$9; continue };
         if($1== "x2038" ){ almo[$3]=almo[$5]=almo[$7]="x2038"; x2038[$2][$3]=$4; x2038[$2][$5]=$6; x2038[$2][$7]=$8; x2038["info"][$3]=$9; continue };
         if($1== "x2039" ){ almo[$3]=almo[$5]=almo[$7]="x2039"; x2039[$2][$3]=$4; x2039[$2][$5]=$6; x2039[$2][$7]=$8; x2039["info"][$3]=$9; continue };
         if($1== "x2040" ){ almo[$3]=almo[$5]=almo[$7]="x2040"; x2040[$2][$3]=$4; x2040[$2][$5]=$6; x2040[$2][$7]=$8; x2040["info"][$3]=$9; continue };
         if($1== "x2041" ){ almo[$3]=almo[$5]=almo[$7]="x2041"; x2041[$2][$3]=$4; x2041[$2][$5]=$6; x2041[$2][$7]=$8; x2041["info"][$3]=$9; continue };
         if($1== "x2042" ){ almo[$3]=almo[$5]=almo[$7]="x2042"; x2042[$2][$3]=$4; x2042[$2][$5]=$6; x2042[$2][$7]=$8; x2042["info"][$3]=$9; continue };
         if($1== "x2043" ){ almo[$3]=almo[$5]=almo[$7]="x2043"; x2043[$2][$3]=$4; x2043[$2][$5]=$6; x2043[$2][$7]=$8; x2043["info"][$3]=$9; continue };
         if($1== "x2044" ){ almo[$3]=almo[$5]=almo[$7]="x2044"; x2044[$2][$3]=$4; x2044[$2][$5]=$6; x2044[$2][$7]=$8; x2044["info"][$3]=$9; continue };
         if($1== "x2045" ){ almo[$3]=almo[$5]=almo[$7]="x2045"; x2045[$2][$3]=$4; x2045[$2][$5]=$6; x2045[$2][$7]=$8; x2045["info"][$3]=$9; continue };
         if($1== "x2046" ){ almo[$3]=almo[$5]=almo[$7]="x2046"; x2046[$2][$3]=$4; x2046[$2][$5]=$6; x2046[$2][$7]=$8; x2046["info"][$3]=$9; continue };
         if($1== "x2047" ){ almo[$3]=almo[$5]=almo[$7]="x2047"; x2047[$2][$3]=$4; x2047[$2][$5]=$6; x2047[$2][$7]=$8; x2047["info"][$3]=$9; continue };
         if($1== "x2048" ){ almo[$3]=almo[$5]=almo[$7]="x2048"; x2048[$2][$3]=$4; x2048[$2][$5]=$6; x2048[$2][$7]=$8; x2048["info"][$3]=$9; continue };
         if($1== "x2049" ){ almo[$3]=almo[$5]=almo[$7]="x2049"; x2049[$2][$3]=$4; x2049[$2][$5]=$6; x2049[$2][$7]=$8; x2049["info"][$3]=$9; continue };
         if($1== "x2050" ){ almo[$3]=almo[$5]=almo[$7]="x2050"; x2050[$2][$3]=$4; x2050[$2][$5]=$6; x2050[$2][$7]=$8; x2050["info"][$3]=$9; continue };
         if($1== "x2051" ){ almo[$3]=almo[$5]=almo[$7]="x2051"; x2051[$2][$3]=$4; x2051[$2][$5]=$6; x2051[$2][$7]=$8; x2051["info"][$3]=$9; continue };
         if($1== "x2052" ){ almo[$3]=almo[$5]=almo[$7]="x2052"; x2052[$2][$3]=$4; x2052[$2][$5]=$6; x2052[$2][$7]=$8; x2052["info"][$3]=$9; continue };
         if($1== "x2053" ){ almo[$3]=almo[$5]=almo[$7]="x2053"; x2053[$2][$3]=$4; x2053[$2][$5]=$6; x2053[$2][$7]=$8; x2053["info"][$3]=$9; continue };
         if($1== "x2054" ){ almo[$3]=almo[$5]=almo[$7]="x2054"; x2054[$2][$3]=$4; x2054[$2][$5]=$6; x2054[$2][$7]=$8; x2054["info"][$3]=$9; continue };
         if($1== "x2055" ){ almo[$3]=almo[$5]=almo[$7]="x2055"; x2055[$2][$3]=$4; x2055[$2][$5]=$6; x2055[$2][$7]=$8; x2055["info"][$3]=$9; continue };
         if($1== "x2056" ){ almo[$3]=almo[$5]=almo[$7]="x2056"; x2056[$2][$3]=$4; x2056[$2][$5]=$6; x2056[$2][$7]=$8; x2056["info"][$3]=$9; continue };
         if($1== "x2057" ){ almo[$3]=almo[$5]=almo[$7]="x2057"; x2057[$2][$3]=$4; x2057[$2][$5]=$6; x2057[$2][$7]=$8; x2057["info"][$3]=$9; continue };
         if($1== "x2058" ){ almo[$3]=almo[$5]=almo[$7]="x2058"; x2058[$2][$3]=$4; x2058[$2][$5]=$6; x2058[$2][$7]=$8; x2058["info"][$3]=$9; continue };
         if($1== "x2059" ){ almo[$3]=almo[$5]=almo[$7]="x2059"; x2059[$2][$3]=$4; x2059[$2][$5]=$6; x2059[$2][$7]=$8; x2059["info"][$3]=$9; continue };
         if($1== "x2060" ){ almo[$3]=almo[$5]=almo[$7]="x2060"; x2060[$2][$3]=$4; x2060[$2][$5]=$6; x2060[$2][$7]=$8; x2060["info"][$3]=$9; continue };
         if($1== "x2061" ){ almo[$3]=almo[$5]=almo[$7]="x2061"; x2061[$2][$3]=$4; x2061[$2][$5]=$6; x2061[$2][$7]=$8; x2061["info"][$3]=$9; continue };
         if($1== "x2062" ){ almo[$3]=almo[$5]=almo[$7]="x2062"; x2062[$2][$3]=$4; x2062[$2][$5]=$6; x2062[$2][$7]=$8; x2062["info"][$3]=$9; continue };
         if($1== "x2063" ){ almo[$3]=almo[$5]=almo[$7]="x2063"; x2063[$2][$3]=$4; x2063[$2][$5]=$6; x2063[$2][$7]=$8; x2063["info"][$3]=$9; continue };
         if($1== "x2064" ){ almo[$3]=almo[$5]=almo[$7]="x2064"; x2064[$2][$3]=$4; x2064[$2][$5]=$6; x2064[$2][$7]=$8; x2064["info"][$3]=$9; continue };
         if($1== "x2065" ){ almo[$3]=almo[$5]=almo[$7]="x2065"; x2065[$2][$3]=$4; x2065[$2][$5]=$6; x2065[$2][$7]=$8; x2065["info"][$3]=$9; continue };
         if($1== "x2066" ){ almo[$3]=almo[$5]=almo[$7]="x2066"; x2066[$2][$3]=$4; x2066[$2][$5]=$6; x2066[$2][$7]=$8; x2066["info"][$3]=$9; continue };
         if($1== "x2067" ){ almo[$3]=almo[$5]=almo[$7]="x2067"; x2067[$2][$3]=$4; x2067[$2][$5]=$6; x2067[$2][$7]=$8; x2067["info"][$3]=$9; continue };
         if($1== "x2068" ){ almo[$3]=almo[$5]=almo[$7]="x2068"; x2068[$2][$3]=$4; x2068[$2][$5]=$6; x2068[$2][$7]=$8; x2068["info"][$3]=$9; continue };
         if($1== "x2069" ){ almo[$3]=almo[$5]=almo[$7]="x2069"; x2069[$2][$3]=$4; x2069[$2][$5]=$6; x2069[$2][$7]=$8; x2069["info"][$3]=$9; continue };
         if($1== "x2070" ){ almo[$3]=almo[$5]=almo[$7]="x2070"; x2070[$2][$3]=$4; x2070[$2][$5]=$6; x2070[$2][$7]=$8; x2070["info"][$3]=$9; continue };
         if($1== "x2071" ){ almo[$3]=almo[$5]=almo[$7]="x2071"; x2071[$2][$3]=$4; x2071[$2][$5]=$6; x2071[$2][$7]=$8; x2071["info"][$3]=$9; continue };
         if($1== "x2072" ){ almo[$3]=almo[$5]=almo[$7]="x2072"; x2072[$2][$3]=$4; x2072[$2][$5]=$6; x2072[$2][$7]=$8; x2072["info"][$3]=$9; continue };
         if($1== "x2073" ){ almo[$3]=almo[$5]=almo[$7]="x2073"; x2073[$2][$3]=$4; x2073[$2][$5]=$6; x2073[$2][$7]=$8; x2073["info"][$3]=$9; continue };
         if($1== "x2074" ){ almo[$3]=almo[$5]=almo[$7]="x2074"; x2074[$2][$3]=$4; x2074[$2][$5]=$6; x2074[$2][$7]=$8; x2074["info"][$3]=$9; continue };
         if($1== "x2075" ){ almo[$3]=almo[$5]=almo[$7]="x2075"; x2075[$2][$3]=$4; x2075[$2][$5]=$6; x2075[$2][$7]=$8; x2075["info"][$3]=$9; continue };
         if($1== "x2076" ){ almo[$3]=almo[$5]=almo[$7]="x2076"; x2076[$2][$3]=$4; x2076[$2][$5]=$6; x2076[$2][$7]=$8; x2076["info"][$3]=$9; continue };
         if($1== "x2077" ){ almo[$3]=almo[$5]=almo[$7]="x2077"; x2077[$2][$3]=$4; x2077[$2][$5]=$6; x2077[$2][$7]=$8; x2077["info"][$3]=$9; continue };
         if($1== "x2078" ){ almo[$3]=almo[$5]=almo[$7]="x2078"; x2078[$2][$3]=$4; x2078[$2][$5]=$6; x2078[$2][$7]=$8; x2078["info"][$3]=$9; continue };
         if($1== "x2079" ){ almo[$3]=almo[$5]=almo[$7]="x2079"; x2079[$2][$3]=$4; x2079[$2][$5]=$6; x2079[$2][$7]=$8; x2079["info"][$3]=$9; continue };
         if($1== "x2080" ){ almo[$3]=almo[$5]=almo[$7]="x2080"; x2080[$2][$3]=$4; x2080[$2][$5]=$6; x2080[$2][$7]=$8; x2080["info"][$3]=$9; continue };
         if($1== "x2081" ){ almo[$3]=almo[$5]=almo[$7]="x2081"; x2081[$2][$3]=$4; x2081[$2][$5]=$6; x2081[$2][$7]=$8; x2081["info"][$3]=$9; continue };
         if($1== "x2082" ){ almo[$3]=almo[$5]=almo[$7]="x2082"; x2082[$2][$3]=$4; x2082[$2][$5]=$6; x2082[$2][$7]=$8; x2082["info"][$3]=$9; continue };
         if($1== "x2083" ){ almo[$3]=almo[$5]=almo[$7]="x2083"; x2083[$2][$3]=$4; x2083[$2][$5]=$6; x2083[$2][$7]=$8; x2083["info"][$3]=$9; continue };
         if($1== "x2084" ){ almo[$3]=almo[$5]=almo[$7]="x2084"; x2084[$2][$3]=$4; x2084[$2][$5]=$6; x2084[$2][$7]=$8; x2084["info"][$3]=$9; continue };
         if($1== "x2085" ){ almo[$3]=almo[$5]=almo[$7]="x2085"; x2085[$2][$3]=$4; x2085[$2][$5]=$6; x2085[$2][$7]=$8; x2085["info"][$3]=$9; continue };
         if($1== "x2086" ){ almo[$3]=almo[$5]=almo[$7]="x2086"; x2086[$2][$3]=$4; x2086[$2][$5]=$6; x2086[$2][$7]=$8; x2086["info"][$3]=$9; continue };
         if($1== "x2087" ){ almo[$3]=almo[$5]=almo[$7]="x2087"; x2087[$2][$3]=$4; x2087[$2][$5]=$6; x2087[$2][$7]=$8; x2087["info"][$3]=$9; continue };
         if($1== "x2088" ){ almo[$3]=almo[$5]=almo[$7]="x2088"; x2088[$2][$3]=$4; x2088[$2][$5]=$6; x2088[$2][$7]=$8; x2088["info"][$3]=$9; continue };
         if($1== "x2089" ){ almo[$3]=almo[$5]=almo[$7]="x2089"; x2089[$2][$3]=$4; x2089[$2][$5]=$6; x2089[$2][$7]=$8; x2089["info"][$3]=$9; continue };
         if($1== "x2090" ){ almo[$3]=almo[$5]=almo[$7]="x2090"; x2090[$2][$3]=$4; x2090[$2][$5]=$6; x2090[$2][$7]=$8; x2090["info"][$3]=$9; continue };
         if($1== "x2091" ){ almo[$3]=almo[$5]=almo[$7]="x2091"; x2091[$2][$3]=$4; x2091[$2][$5]=$6; x2091[$2][$7]=$8; x2091["info"][$3]=$9; continue };
         if($1== "x2092" ){ almo[$3]=almo[$5]=almo[$7]="x2092"; x2092[$2][$3]=$4; x2092[$2][$5]=$6; x2092[$2][$7]=$8; x2092["info"][$3]=$9; continue };
         if($1== "x2093" ){ almo[$3]=almo[$5]=almo[$7]="x2093"; x2093[$2][$3]=$4; x2093[$2][$5]=$6; x2093[$2][$7]=$8; x2093["info"][$3]=$9; continue };
         if($1== "x2094" ){ almo[$3]=almo[$5]=almo[$7]="x2094"; x2094[$2][$3]=$4; x2094[$2][$5]=$6; x2094[$2][$7]=$8; x2094["info"][$3]=$9; continue };
         if($1== "x2095" ){ almo[$3]=almo[$5]=almo[$7]="x2095"; x2095[$2][$3]=$4; x2095[$2][$5]=$6; x2095[$2][$7]=$8; x2095["info"][$3]=$9; continue };
         if($1== "x2096" ){ almo[$3]=almo[$5]=almo[$7]="x2096"; x2096[$2][$3]=$4; x2096[$2][$5]=$6; x2096[$2][$7]=$8; x2096["info"][$3]=$9; continue };
         if($1== "x2097" ){ almo[$3]=almo[$5]=almo[$7]="x2097"; x2097[$2][$3]=$4; x2097[$2][$5]=$6; x2097[$2][$7]=$8; x2097["info"][$3]=$9; continue };
         if($1== "x2098" ){ almo[$3]=almo[$5]=almo[$7]="x2098"; x2098[$2][$3]=$4; x2098[$2][$5]=$6; x2098[$2][$7]=$8; x2098["info"][$3]=$9; continue };
         if($1== "x2099" ){ almo[$3]=almo[$5]=almo[$7]="x2099"; x2099[$2][$3]=$4; x2099[$2][$5]=$6; x2099[$2][$7]=$8; x2099["info"][$3]=$9; continue };
         if($1== "x2100" ){ almo[$3]=almo[$5]=almo[$7]="x2100"; x2100[$2][$3]=$4; x2100[$2][$5]=$6; x2100[$2][$7]=$8; x2100["info"][$3]=$9; continue };
         if($1== "x2101" ){ almo[$3]=almo[$5]=almo[$7]="x2101"; x2101[$2][$3]=$4; x2101[$2][$5]=$6; x2101[$2][$7]=$8; x2101["info"][$3]=$9; continue };
         if($1== "x2102" ){ almo[$3]=almo[$5]=almo[$7]="x2102"; x2102[$2][$3]=$4; x2102[$2][$5]=$6; x2102[$2][$7]=$8; x2102["info"][$3]=$9; continue };
         if($1== "x2103" ){ almo[$3]=almo[$5]=almo[$7]="x2103"; x2103[$2][$3]=$4; x2103[$2][$5]=$6; x2103[$2][$7]=$8; x2103["info"][$3]=$9; continue };
         if($1== "x2104" ){ almo[$3]=almo[$5]=almo[$7]="x2104"; x2104[$2][$3]=$4; x2104[$2][$5]=$6; x2104[$2][$7]=$8; x2104["info"][$3]=$9; continue };
         if($1== "x2105" ){ almo[$3]=almo[$5]=almo[$7]="x2105"; x2105[$2][$3]=$4; x2105[$2][$5]=$6; x2105[$2][$7]=$8; x2105["info"][$3]=$9; continue };
         if($1== "x2106" ){ almo[$3]=almo[$5]=almo[$7]="x2106"; x2106[$2][$3]=$4; x2106[$2][$5]=$6; x2106[$2][$7]=$8; x2106["info"][$3]=$9; continue };
         if($1== "x2107" ){ almo[$3]=almo[$5]=almo[$7]="x2107"; x2107[$2][$3]=$4; x2107[$2][$5]=$6; x2107[$2][$7]=$8; x2107["info"][$3]=$9; continue };
         if($1== "x2108" ){ almo[$3]=almo[$5]=almo[$7]="x2108"; x2108[$2][$3]=$4; x2108[$2][$5]=$6; x2108[$2][$7]=$8; x2108["info"][$3]=$9; continue };
         if($1== "x2109" ){ almo[$3]=almo[$5]=almo[$7]="x2109"; x2109[$2][$3]=$4; x2109[$2][$5]=$6; x2109[$2][$7]=$8; x2109["info"][$3]=$9; continue };
         if($1== "x2110" ){ almo[$3]=almo[$5]=almo[$7]="x2110"; x2110[$2][$3]=$4; x2110[$2][$5]=$6; x2110[$2][$7]=$8; x2110["info"][$3]=$9; continue };
         if($1== "x2111" ){ almo[$3]=almo[$5]=almo[$7]="x2111"; x2111[$2][$3]=$4; x2111[$2][$5]=$6; x2111[$2][$7]=$8; x2111["info"][$3]=$9; continue };
         if($1== "x2112" ){ almo[$3]=almo[$5]=almo[$7]="x2112"; x2112[$2][$3]=$4; x2112[$2][$5]=$6; x2112[$2][$7]=$8; x2112["info"][$3]=$9; continue };
         if($1== "x2113" ){ almo[$3]=almo[$5]=almo[$7]="x2113"; x2113[$2][$3]=$4; x2113[$2][$5]=$6; x2113[$2][$7]=$8; x2113["info"][$3]=$9; continue };
         if($1== "x2114" ){ almo[$3]=almo[$5]=almo[$7]="x2114"; x2114[$2][$3]=$4; x2114[$2][$5]=$6; x2114[$2][$7]=$8; x2114["info"][$3]=$9; continue };
         if($1== "x2115" ){ almo[$3]=almo[$5]=almo[$7]="x2115"; x2115[$2][$3]=$4; x2115[$2][$5]=$6; x2115[$2][$7]=$8; x2115["info"][$3]=$9; continue };
         if($1== "x2116" ){ almo[$3]=almo[$5]=almo[$7]="x2116"; x2116[$2][$3]=$4; x2116[$2][$5]=$6; x2116[$2][$7]=$8; x2116["info"][$3]=$9; continue };
         if($1== "x2117" ){ almo[$3]=almo[$5]=almo[$7]="x2117"; x2117[$2][$3]=$4; x2117[$2][$5]=$6; x2117[$2][$7]=$8; x2117["info"][$3]=$9; continue };
         if($1== "x2118" ){ almo[$3]=almo[$5]=almo[$7]="x2118"; x2118[$2][$3]=$4; x2118[$2][$5]=$6; x2118[$2][$7]=$8; x2118["info"][$3]=$9; continue };
         if($1== "x2119" ){ almo[$3]=almo[$5]=almo[$7]="x2119"; x2119[$2][$3]=$4; x2119[$2][$5]=$6; x2119[$2][$7]=$8; x2119["info"][$3]=$9; continue };
         if($1== "x2120" ){ almo[$3]=almo[$5]=almo[$7]="x2120"; x2120[$2][$3]=$4; x2120[$2][$5]=$6; x2120[$2][$7]=$8; x2120["info"][$3]=$9; continue };
         if($1== "x2121" ){ almo[$3]=almo[$5]=almo[$7]="x2121"; x2121[$2][$3]=$4; x2121[$2][$5]=$6; x2121[$2][$7]=$8; x2121["info"][$3]=$9; continue };
         if($1== "x2122" ){ almo[$3]=almo[$5]=almo[$7]="x2122"; x2122[$2][$3]=$4; x2122[$2][$5]=$6; x2122[$2][$7]=$8; x2122["info"][$3]=$9; continue };
         if($1== "x2123" ){ almo[$3]=almo[$5]=almo[$7]="x2123"; x2123[$2][$3]=$4; x2123[$2][$5]=$6; x2123[$2][$7]=$8; x2123["info"][$3]=$9; continue };
         if($1== "x2124" ){ almo[$3]=almo[$5]=almo[$7]="x2124"; x2124[$2][$3]=$4; x2124[$2][$5]=$6; x2124[$2][$7]=$8; x2124["info"][$3]=$9; continue };
         if($1== "x2125" ){ almo[$3]=almo[$5]=almo[$7]="x2125"; x2125[$2][$3]=$4; x2125[$2][$5]=$6; x2125[$2][$7]=$8; x2125["info"][$3]=$9; continue };
         if($1== "x2126" ){ almo[$3]=almo[$5]=almo[$7]="x2126"; x2126[$2][$3]=$4; x2126[$2][$5]=$6; x2126[$2][$7]=$8; x2126["info"][$3]=$9; continue };
         if($1== "x2127" ){ almo[$3]=almo[$5]=almo[$7]="x2127"; x2127[$2][$3]=$4; x2127[$2][$5]=$6; x2127[$2][$7]=$8; x2127["info"][$3]=$9; continue };
         if($1== "x2128" ){ almo[$3]=almo[$5]=almo[$7]="x2128"; x2128[$2][$3]=$4; x2128[$2][$5]=$6; x2128[$2][$7]=$8; x2128["info"][$3]=$9; continue };
         if($1== "x2129" ){ almo[$3]=almo[$5]=almo[$7]="x2129"; x2129[$2][$3]=$4; x2129[$2][$5]=$6; x2129[$2][$7]=$8; x2129["info"][$3]=$9; continue };
         if($1== "x2130" ){ almo[$3]=almo[$5]=almo[$7]="x2130"; x2130[$2][$3]=$4; x2130[$2][$5]=$6; x2130[$2][$7]=$8; x2130["info"][$3]=$9; continue };
         if($1== "x2131" ){ almo[$3]=almo[$5]=almo[$7]="x2131"; x2131[$2][$3]=$4; x2131[$2][$5]=$6; x2131[$2][$7]=$8; x2131["info"][$3]=$9; continue };
         if($1== "x2132" ){ almo[$3]=almo[$5]=almo[$7]="x2132"; x2132[$2][$3]=$4; x2132[$2][$5]=$6; x2132[$2][$7]=$8; x2132["info"][$3]=$9; continue };
         if($1== "x2133" ){ almo[$3]=almo[$5]=almo[$7]="x2133"; x2133[$2][$3]=$4; x2133[$2][$5]=$6; x2133[$2][$7]=$8; x2133["info"][$3]=$9; continue };
         if($1== "x2134" ){ almo[$3]=almo[$5]=almo[$7]="x2134"; x2134[$2][$3]=$4; x2134[$2][$5]=$6; x2134[$2][$7]=$8; x2134["info"][$3]=$9; continue };
         if($1== "x2135" ){ almo[$3]=almo[$5]=almo[$7]="x2135"; x2135[$2][$3]=$4; x2135[$2][$5]=$6; x2135[$2][$7]=$8; x2135["info"][$3]=$9; continue };
         if($1== "x2136" ){ almo[$3]=almo[$5]=almo[$7]="x2136"; x2136[$2][$3]=$4; x2136[$2][$5]=$6; x2136[$2][$7]=$8; x2136["info"][$3]=$9; continue };
         if($1== "x2137" ){ almo[$3]=almo[$5]=almo[$7]="x2137"; x2137[$2][$3]=$4; x2137[$2][$5]=$6; x2137[$2][$7]=$8; x2137["info"][$3]=$9; continue };
         if($1== "x2138" ){ almo[$3]=almo[$5]=almo[$7]="x2138"; x2138[$2][$3]=$4; x2138[$2][$5]=$6; x2138[$2][$7]=$8; x2138["info"][$3]=$9; continue };
         if($1== "x2139" ){ almo[$3]=almo[$5]=almo[$7]="x2139"; x2139[$2][$3]=$4; x2139[$2][$5]=$6; x2139[$2][$7]=$8; x2139["info"][$3]=$9; continue };
         if($1== "x2140" ){ almo[$3]=almo[$5]=almo[$7]="x2140"; x2140[$2][$3]=$4; x2140[$2][$5]=$6; x2140[$2][$7]=$8; x2140["info"][$3]=$9; continue };
         if($1== "x2141" ){ almo[$3]=almo[$5]=almo[$7]="x2141"; x2141[$2][$3]=$4; x2141[$2][$5]=$6; x2141[$2][$7]=$8; x2141["info"][$3]=$9; continue };
         if($1== "x2142" ){ almo[$3]=almo[$5]=almo[$7]="x2142"; x2142[$2][$3]=$4; x2142[$2][$5]=$6; x2142[$2][$7]=$8; x2142["info"][$3]=$9; continue };
         if($1== "x2143" ){ almo[$3]=almo[$5]=almo[$7]="x2143"; x2143[$2][$3]=$4; x2143[$2][$5]=$6; x2143[$2][$7]=$8; x2143["info"][$3]=$9; continue };
         if($1== "x2144" ){ almo[$3]=almo[$5]=almo[$7]="x2144"; x2144[$2][$3]=$4; x2144[$2][$5]=$6; x2144[$2][$7]=$8; x2144["info"][$3]=$9; continue };
         if($1== "x2145" ){ almo[$3]=almo[$5]=almo[$7]="x2145"; x2145[$2][$3]=$4; x2145[$2][$5]=$6; x2145[$2][$7]=$8; x2145["info"][$3]=$9; continue };
         if($1== "x2146" ){ almo[$3]=almo[$5]=almo[$7]="x2146"; x2146[$2][$3]=$4; x2146[$2][$5]=$6; x2146[$2][$7]=$8; x2146["info"][$3]=$9; continue };
         if($1== "x2147" ){ almo[$3]=almo[$5]=almo[$7]="x2147"; x2147[$2][$3]=$4; x2147[$2][$5]=$6; x2147[$2][$7]=$8; x2147["info"][$3]=$9; continue };
         if($1== "x2148" ){ almo[$3]=almo[$5]=almo[$7]="x2148"; x2148[$2][$3]=$4; x2148[$2][$5]=$6; x2148[$2][$7]=$8; x2148["info"][$3]=$9; continue };
         if($1== "x2149" ){ almo[$3]=almo[$5]=almo[$7]="x2149"; x2149[$2][$3]=$4; x2149[$2][$5]=$6; x2149[$2][$7]=$8; x2149["info"][$3]=$9; continue };
         if($1== "x2150" ){ almo[$3]=almo[$5]=almo[$7]="x2150"; x2150[$2][$3]=$4; x2150[$2][$5]=$6; x2150[$2][$7]=$8; x2150["info"][$3]=$9; continue };
         if($1== "x2151" ){ almo[$3]=almo[$5]=almo[$7]="x2151"; x2151[$2][$3]=$4; x2151[$2][$5]=$6; x2151[$2][$7]=$8; x2151["info"][$3]=$9; continue };
         if($1== "x2152" ){ almo[$3]=almo[$5]=almo[$7]="x2152"; x2152[$2][$3]=$4; x2152[$2][$5]=$6; x2152[$2][$7]=$8; x2152["info"][$3]=$9; continue };
         if($1== "x2153" ){ almo[$3]=almo[$5]=almo[$7]="x2153"; x2153[$2][$3]=$4; x2153[$2][$5]=$6; x2153[$2][$7]=$8; x2153["info"][$3]=$9; continue };
         if($1== "x2154" ){ almo[$3]=almo[$5]=almo[$7]="x2154"; x2154[$2][$3]=$4; x2154[$2][$5]=$6; x2154[$2][$7]=$8; x2154["info"][$3]=$9; continue };
         if($1== "x2155" ){ almo[$3]=almo[$5]=almo[$7]="x2155"; x2155[$2][$3]=$4; x2155[$2][$5]=$6; x2155[$2][$7]=$8; x2155["info"][$3]=$9; continue };
         if($1== "x2156" ){ almo[$3]=almo[$5]=almo[$7]="x2156"; x2156[$2][$3]=$4; x2156[$2][$5]=$6; x2156[$2][$7]=$8; x2156["info"][$3]=$9; continue };
         if($1== "x2157" ){ almo[$3]=almo[$5]=almo[$7]="x2157"; x2157[$2][$3]=$4; x2157[$2][$5]=$6; x2157[$2][$7]=$8; x2157["info"][$3]=$9; continue };
         if($1== "x2158" ){ almo[$3]=almo[$5]=almo[$7]="x2158"; x2158[$2][$3]=$4; x2158[$2][$5]=$6; x2158[$2][$7]=$8; x2158["info"][$3]=$9; continue };
         if($1== "x2159" ){ almo[$3]=almo[$5]=almo[$7]="x2159"; x2159[$2][$3]=$4; x2159[$2][$5]=$6; x2159[$2][$7]=$8; x2159["info"][$3]=$9; continue };
         if($1== "x2160" ){ almo[$3]=almo[$5]=almo[$7]="x2160"; x2160[$2][$3]=$4; x2160[$2][$5]=$6; x2160[$2][$7]=$8; x2160["info"][$3]=$9; continue };
         if($1== "x2161" ){ almo[$3]=almo[$5]=almo[$7]="x2161"; x2161[$2][$3]=$4; x2161[$2][$5]=$6; x2161[$2][$7]=$8; x2161["info"][$3]=$9; continue };
         if($1== "x2162" ){ almo[$3]=almo[$5]=almo[$7]="x2162"; x2162[$2][$3]=$4; x2162[$2][$5]=$6; x2162[$2][$7]=$8; x2162["info"][$3]=$9; continue };
         if($1== "x2163" ){ almo[$3]=almo[$5]=almo[$7]="x2163"; x2163[$2][$3]=$4; x2163[$2][$5]=$6; x2163[$2][$7]=$8; x2163["info"][$3]=$9; continue };
         if($1== "x2164" ){ almo[$3]=almo[$5]=almo[$7]="x2164"; x2164[$2][$3]=$4; x2164[$2][$5]=$6; x2164[$2][$7]=$8; x2164["info"][$3]=$9; continue };
         if($1== "x2165" ){ almo[$3]=almo[$5]=almo[$7]="x2165"; x2165[$2][$3]=$4; x2165[$2][$5]=$6; x2165[$2][$7]=$8; x2165["info"][$3]=$9; continue };
         if($1== "x2166" ){ almo[$3]=almo[$5]=almo[$7]="x2166"; x2166[$2][$3]=$4; x2166[$2][$5]=$6; x2166[$2][$7]=$8; x2166["info"][$3]=$9; continue };
         if($1== "x2167" ){ almo[$3]=almo[$5]=almo[$7]="x2167"; x2167[$2][$3]=$4; x2167[$2][$5]=$6; x2167[$2][$7]=$8; x2167["info"][$3]=$9; continue };
         if($1== "x2168" ){ almo[$3]=almo[$5]=almo[$7]="x2168"; x2168[$2][$3]=$4; x2168[$2][$5]=$6; x2168[$2][$7]=$8; x2168["info"][$3]=$9; continue };
         if($1== "x2169" ){ almo[$3]=almo[$5]=almo[$7]="x2169"; x2169[$2][$3]=$4; x2169[$2][$5]=$6; x2169[$2][$7]=$8; x2169["info"][$3]=$9; continue };
         if($1== "x2170" ){ almo[$3]=almo[$5]=almo[$7]="x2170"; x2170[$2][$3]=$4; x2170[$2][$5]=$6; x2170[$2][$7]=$8; x2170["info"][$3]=$9; continue };
         if($1== "x2171" ){ almo[$3]=almo[$5]=almo[$7]="x2171"; x2171[$2][$3]=$4; x2171[$2][$5]=$6; x2171[$2][$7]=$8; x2171["info"][$3]=$9; continue };
         if($1== "x2172" ){ almo[$3]=almo[$5]=almo[$7]="x2172"; x2172[$2][$3]=$4; x2172[$2][$5]=$6; x2172[$2][$7]=$8; x2172["info"][$3]=$9; continue };
         if($1== "x2173" ){ almo[$3]=almo[$5]=almo[$7]="x2173"; x2173[$2][$3]=$4; x2173[$2][$5]=$6; x2173[$2][$7]=$8; x2173["info"][$3]=$9; continue };
         if($1== "x2174" ){ almo[$3]=almo[$5]=almo[$7]="x2174"; x2174[$2][$3]=$4; x2174[$2][$5]=$6; x2174[$2][$7]=$8; x2174["info"][$3]=$9; continue };
         if($1== "x2175" ){ almo[$3]=almo[$5]=almo[$7]="x2175"; x2175[$2][$3]=$4; x2175[$2][$5]=$6; x2175[$2][$7]=$8; x2175["info"][$3]=$9; continue };
         if($1== "x2176" ){ almo[$3]=almo[$5]=almo[$7]="x2176"; x2176[$2][$3]=$4; x2176[$2][$5]=$6; x2176[$2][$7]=$8; x2176["info"][$3]=$9; continue };
         if($1== "x2177" ){ almo[$3]=almo[$5]=almo[$7]="x2177"; x2177[$2][$3]=$4; x2177[$2][$5]=$6; x2177[$2][$7]=$8; x2177["info"][$3]=$9; continue };
         if($1== "x2178" ){ almo[$3]=almo[$5]=almo[$7]="x2178"; x2178[$2][$3]=$4; x2178[$2][$5]=$6; x2178[$2][$7]=$8; x2178["info"][$3]=$9; continue };
         if($1== "x2179" ){ almo[$3]=almo[$5]=almo[$7]="x2179"; x2179[$2][$3]=$4; x2179[$2][$5]=$6; x2179[$2][$7]=$8; x2179["info"][$3]=$9; continue };
         if($1== "x2180" ){ almo[$3]=almo[$5]=almo[$7]="x2180"; x2180[$2][$3]=$4; x2180[$2][$5]=$6; x2180[$2][$7]=$8; x2180["info"][$3]=$9; continue };
         if($1== "x2181" ){ almo[$3]=almo[$5]=almo[$7]="x2181"; x2181[$2][$3]=$4; x2181[$2][$5]=$6; x2181[$2][$7]=$8; x2181["info"][$3]=$9; continue };
         if($1== "x2182" ){ almo[$3]=almo[$5]=almo[$7]="x2182"; x2182[$2][$3]=$4; x2182[$2][$5]=$6; x2182[$2][$7]=$8; x2182["info"][$3]=$9; continue };
         if($1== "x2183" ){ almo[$3]=almo[$5]=almo[$7]="x2183"; x2183[$2][$3]=$4; x2183[$2][$5]=$6; x2183[$2][$7]=$8; x2183["info"][$3]=$9; continue };
         if($1== "x2184" ){ almo[$3]=almo[$5]=almo[$7]="x2184"; x2184[$2][$3]=$4; x2184[$2][$5]=$6; x2184[$2][$7]=$8; x2184["info"][$3]=$9; continue };
         if($1== "x2185" ){ almo[$3]=almo[$5]=almo[$7]="x2185"; x2185[$2][$3]=$4; x2185[$2][$5]=$6; x2185[$2][$7]=$8; x2185["info"][$3]=$9; continue };
         if($1== "x2186" ){ almo[$3]=almo[$5]=almo[$7]="x2186"; x2186[$2][$3]=$4; x2186[$2][$5]=$6; x2186[$2][$7]=$8; x2186["info"][$3]=$9; continue };
         if($1== "x2187" ){ almo[$3]=almo[$5]=almo[$7]="x2187"; x2187[$2][$3]=$4; x2187[$2][$5]=$6; x2187[$2][$7]=$8; x2187["info"][$3]=$9; continue };
         if($1== "x2188" ){ almo[$3]=almo[$5]=almo[$7]="x2188"; x2188[$2][$3]=$4; x2188[$2][$5]=$6; x2188[$2][$7]=$8; x2188["info"][$3]=$9; continue };
         if($1== "x2189" ){ almo[$3]=almo[$5]=almo[$7]="x2189"; x2189[$2][$3]=$4; x2189[$2][$5]=$6; x2189[$2][$7]=$8; x2189["info"][$3]=$9; continue };
         if($1== "x2190" ){ almo[$3]=almo[$5]=almo[$7]="x2190"; x2190[$2][$3]=$4; x2190[$2][$5]=$6; x2190[$2][$7]=$8; x2190["info"][$3]=$9; continue };
         if($1== "x2191" ){ almo[$3]=almo[$5]=almo[$7]="x2191"; x2191[$2][$3]=$4; x2191[$2][$5]=$6; x2191[$2][$7]=$8; x2191["info"][$3]=$9; continue };
         if($1== "x2192" ){ almo[$3]=almo[$5]=almo[$7]="x2192"; x2192[$2][$3]=$4; x2192[$2][$5]=$6; x2192[$2][$7]=$8; x2192["info"][$3]=$9; continue };
         if($1== "x2193" ){ almo[$3]=almo[$5]=almo[$7]="x2193"; x2193[$2][$3]=$4; x2193[$2][$5]=$6; x2193[$2][$7]=$8; x2193["info"][$3]=$9; continue };
         if($1== "x2194" ){ almo[$3]=almo[$5]=almo[$7]="x2194"; x2194[$2][$3]=$4; x2194[$2][$5]=$6; x2194[$2][$7]=$8; x2194["info"][$3]=$9; continue };
         if($1== "x2195" ){ almo[$3]=almo[$5]=almo[$7]="x2195"; x2195[$2][$3]=$4; x2195[$2][$5]=$6; x2195[$2][$7]=$8; x2195["info"][$3]=$9; continue };
         if($1== "x2196" ){ almo[$3]=almo[$5]=almo[$7]="x2196"; x2196[$2][$3]=$4; x2196[$2][$5]=$6; x2196[$2][$7]=$8; x2196["info"][$3]=$9; continue };
         if($1== "x2197" ){ almo[$3]=almo[$5]=almo[$7]="x2197"; x2197[$2][$3]=$4; x2197[$2][$5]=$6; x2197[$2][$7]=$8; x2197["info"][$3]=$9; continue };
         if($1== "x2198" ){ almo[$3]=almo[$5]=almo[$7]="x2198"; x2198[$2][$3]=$4; x2198[$2][$5]=$6; x2198[$2][$7]=$8; x2198["info"][$3]=$9; continue };
         if($1== "x2199" ){ almo[$3]=almo[$5]=almo[$7]="x2199"; x2199[$2][$3]=$4; x2199[$2][$5]=$6; x2199[$2][$7]=$8; x2199["info"][$3]=$9; continue };
         if($1== "x2200" ){ almo[$3]=almo[$5]=almo[$7]="x2200"; x2200[$2][$3]=$4; x2200[$2][$5]=$6; x2200[$2][$7]=$8; x2200["info"][$3]=$9; continue };
         if($1== "x2201" ){ almo[$3]=almo[$5]=almo[$7]="x2201"; x2201[$2][$3]=$4; x2201[$2][$5]=$6; x2201[$2][$7]=$8; x2201["info"][$3]=$9; continue };
         if($1== "x2202" ){ almo[$3]=almo[$5]=almo[$7]="x2202"; x2202[$2][$3]=$4; x2202[$2][$5]=$6; x2202[$2][$7]=$8; x2202["info"][$3]=$9; continue };
         if($1== "x2203" ){ almo[$3]=almo[$5]=almo[$7]="x2203"; x2203[$2][$3]=$4; x2203[$2][$5]=$6; x2203[$2][$7]=$8; x2203["info"][$3]=$9; continue };
         if($1== "x2204" ){ almo[$3]=almo[$5]=almo[$7]="x2204"; x2204[$2][$3]=$4; x2204[$2][$5]=$6; x2204[$2][$7]=$8; x2204["info"][$3]=$9; continue };
         if($1== "x2205" ){ almo[$3]=almo[$5]=almo[$7]="x2205"; x2205[$2][$3]=$4; x2205[$2][$5]=$6; x2205[$2][$7]=$8; x2205["info"][$3]=$9; continue };
         if($1== "x2206" ){ almo[$3]=almo[$5]=almo[$7]="x2206"; x2206[$2][$3]=$4; x2206[$2][$5]=$6; x2206[$2][$7]=$8; x2206["info"][$3]=$9; continue };
         if($1== "x2207" ){ almo[$3]=almo[$5]=almo[$7]="x2207"; x2207[$2][$3]=$4; x2207[$2][$5]=$6; x2207[$2][$7]=$8; x2207["info"][$3]=$9; continue };
         if($1== "x2208" ){ almo[$3]=almo[$5]=almo[$7]="x2208"; x2208[$2][$3]=$4; x2208[$2][$5]=$6; x2208[$2][$7]=$8; x2208["info"][$3]=$9; continue };
         if($1== "x2209" ){ almo[$3]=almo[$5]=almo[$7]="x2209"; x2209[$2][$3]=$4; x2209[$2][$5]=$6; x2209[$2][$7]=$8; x2209["info"][$3]=$9; continue };
         if($1== "x2210" ){ almo[$3]=almo[$5]=almo[$7]="x2210"; x2210[$2][$3]=$4; x2210[$2][$5]=$6; x2210[$2][$7]=$8; x2210["info"][$3]=$9; continue };
         if($1== "x2211" ){ almo[$3]=almo[$5]=almo[$7]="x2211"; x2211[$2][$3]=$4; x2211[$2][$5]=$6; x2211[$2][$7]=$8; x2211["info"][$3]=$9; continue };
         if($1== "x2212" ){ almo[$3]=almo[$5]=almo[$7]="x2212"; x2212[$2][$3]=$4; x2212[$2][$5]=$6; x2212[$2][$7]=$8; x2212["info"][$3]=$9; continue };
         if($1== "x2213" ){ almo[$3]=almo[$5]=almo[$7]="x2213"; x2213[$2][$3]=$4; x2213[$2][$5]=$6; x2213[$2][$7]=$8; x2213["info"][$3]=$9; continue };
         if($1== "x2214" ){ almo[$3]=almo[$5]=almo[$7]="x2214"; x2214[$2][$3]=$4; x2214[$2][$5]=$6; x2214[$2][$7]=$8; x2214["info"][$3]=$9; continue };
         if($1== "x2215" ){ almo[$3]=almo[$5]=almo[$7]="x2215"; x2215[$2][$3]=$4; x2215[$2][$5]=$6; x2215[$2][$7]=$8; x2215["info"][$3]=$9; continue };
         if($1== "x2216" ){ almo[$3]=almo[$5]=almo[$7]="x2216"; x2216[$2][$3]=$4; x2216[$2][$5]=$6; x2216[$2][$7]=$8; x2216["info"][$3]=$9; continue };
         if($1== "x2217" ){ almo[$3]=almo[$5]=almo[$7]="x2217"; x2217[$2][$3]=$4; x2217[$2][$5]=$6; x2217[$2][$7]=$8; x2217["info"][$3]=$9; continue };
         if($1== "x2218" ){ almo[$3]=almo[$5]=almo[$7]="x2218"; x2218[$2][$3]=$4; x2218[$2][$5]=$6; x2218[$2][$7]=$8; x2218["info"][$3]=$9; continue };
         if($1== "x2219" ){ almo[$3]=almo[$5]=almo[$7]="x2219"; x2219[$2][$3]=$4; x2219[$2][$5]=$6; x2219[$2][$7]=$8; x2219["info"][$3]=$9; continue };
         if($1== "x2220" ){ almo[$3]=almo[$5]=almo[$7]="x2220"; x2220[$2][$3]=$4; x2220[$2][$5]=$6; x2220[$2][$7]=$8; x2220["info"][$3]=$9; continue };
         if($1== "x2221" ){ almo[$3]=almo[$5]=almo[$7]="x2221"; x2221[$2][$3]=$4; x2221[$2][$5]=$6; x2221[$2][$7]=$8; x2221["info"][$3]=$9; continue };
         if($1== "x2222" ){ almo[$3]=almo[$5]=almo[$7]="x2222"; x2222[$2][$3]=$4; x2222[$2][$5]=$6; x2222[$2][$7]=$8; x2222["info"][$3]=$9; continue };
         if($1== "x2223" ){ almo[$3]=almo[$5]=almo[$7]="x2223"; x2223[$2][$3]=$4; x2223[$2][$5]=$6; x2223[$2][$7]=$8; x2223["info"][$3]=$9; continue };
         if($1== "x2224" ){ almo[$3]=almo[$5]=almo[$7]="x2224"; x2224[$2][$3]=$4; x2224[$2][$5]=$6; x2224[$2][$7]=$8; x2224["info"][$3]=$9; continue };
         if($1== "x2225" ){ almo[$3]=almo[$5]=almo[$7]="x2225"; x2225[$2][$3]=$4; x2225[$2][$5]=$6; x2225[$2][$7]=$8; x2225["info"][$3]=$9; continue };
         if($1== "x2226" ){ almo[$3]=almo[$5]=almo[$7]="x2226"; x2226[$2][$3]=$4; x2226[$2][$5]=$6; x2226[$2][$7]=$8; x2226["info"][$3]=$9; continue };
         if($1== "x2227" ){ almo[$3]=almo[$5]=almo[$7]="x2227"; x2227[$2][$3]=$4; x2227[$2][$5]=$6; x2227[$2][$7]=$8; x2227["info"][$3]=$9; continue };
         if($1== "x2228" ){ almo[$3]=almo[$5]=almo[$7]="x2228"; x2228[$2][$3]=$4; x2228[$2][$5]=$6; x2228[$2][$7]=$8; x2228["info"][$3]=$9; continue };
         if($1== "x2229" ){ almo[$3]=almo[$5]=almo[$7]="x2229"; x2229[$2][$3]=$4; x2229[$2][$5]=$6; x2229[$2][$7]=$8; x2229["info"][$3]=$9; continue };
         if($1== "x2230" ){ almo[$3]=almo[$5]=almo[$7]="x2230"; x2230[$2][$3]=$4; x2230[$2][$5]=$6; x2230[$2][$7]=$8; x2230["info"][$3]=$9; continue };
         if($1== "x2231" ){ almo[$3]=almo[$5]=almo[$7]="x2231"; x2231[$2][$3]=$4; x2231[$2][$5]=$6; x2231[$2][$7]=$8; x2231["info"][$3]=$9; continue };
         if($1== "x2232" ){ almo[$3]=almo[$5]=almo[$7]="x2232"; x2232[$2][$3]=$4; x2232[$2][$5]=$6; x2232[$2][$7]=$8; x2232["info"][$3]=$9; continue };
         if($1== "x2233" ){ almo[$3]=almo[$5]=almo[$7]="x2233"; x2233[$2][$3]=$4; x2233[$2][$5]=$6; x2233[$2][$7]=$8; x2233["info"][$3]=$9; continue };
         if($1== "x2234" ){ almo[$3]=almo[$5]=almo[$7]="x2234"; x2234[$2][$3]=$4; x2234[$2][$5]=$6; x2234[$2][$7]=$8; x2234["info"][$3]=$9; continue };
         if($1== "x2235" ){ almo[$3]=almo[$5]=almo[$7]="x2235"; x2235[$2][$3]=$4; x2235[$2][$5]=$6; x2235[$2][$7]=$8; x2235["info"][$3]=$9; continue };
         if($1== "x2236" ){ almo[$3]=almo[$5]=almo[$7]="x2236"; x2236[$2][$3]=$4; x2236[$2][$5]=$6; x2236[$2][$7]=$8; x2236["info"][$3]=$9; continue };
         if($1== "x2237" ){ almo[$3]=almo[$5]=almo[$7]="x2237"; x2237[$2][$3]=$4; x2237[$2][$5]=$6; x2237[$2][$7]=$8; x2237["info"][$3]=$9; continue };
         if($1== "x2238" ){ almo[$3]=almo[$5]=almo[$7]="x2238"; x2238[$2][$3]=$4; x2238[$2][$5]=$6; x2238[$2][$7]=$8; x2238["info"][$3]=$9; continue };
         if($1== "x2239" ){ almo[$3]=almo[$5]=almo[$7]="x2239"; x2239[$2][$3]=$4; x2239[$2][$5]=$6; x2239[$2][$7]=$8; x2239["info"][$3]=$9; continue };
         if($1== "x2240" ){ almo[$3]=almo[$5]=almo[$7]="x2240"; x2240[$2][$3]=$4; x2240[$2][$5]=$6; x2240[$2][$7]=$8; x2240["info"][$3]=$9; continue };
         if($1== "x2241" ){ almo[$3]=almo[$5]=almo[$7]="x2241"; x2241[$2][$3]=$4; x2241[$2][$5]=$6; x2241[$2][$7]=$8; x2241["info"][$3]=$9; continue };
         if($1== "x2242" ){ almo[$3]=almo[$5]=almo[$7]="x2242"; x2242[$2][$3]=$4; x2242[$2][$5]=$6; x2242[$2][$7]=$8; x2242["info"][$3]=$9; continue };
         if($1== "x2243" ){ almo[$3]=almo[$5]=almo[$7]="x2243"; x2243[$2][$3]=$4; x2243[$2][$5]=$6; x2243[$2][$7]=$8; x2243["info"][$3]=$9; continue };
         if($1== "x2244" ){ almo[$3]=almo[$5]=almo[$7]="x2244"; x2244[$2][$3]=$4; x2244[$2][$5]=$6; x2244[$2][$7]=$8; x2244["info"][$3]=$9; continue };
         if($1== "x2245" ){ almo[$3]=almo[$5]=almo[$7]="x2245"; x2245[$2][$3]=$4; x2245[$2][$5]=$6; x2245[$2][$7]=$8; x2245["info"][$3]=$9; continue };
         if($1== "x2246" ){ almo[$3]=almo[$5]=almo[$7]="x2246"; x2246[$2][$3]=$4; x2246[$2][$5]=$6; x2246[$2][$7]=$8; x2246["info"][$3]=$9; continue };
         if($1== "x2247" ){ almo[$3]=almo[$5]=almo[$7]="x2247"; x2247[$2][$3]=$4; x2247[$2][$5]=$6; x2247[$2][$7]=$8; x2247["info"][$3]=$9; continue };
         if($1== "x2248" ){ almo[$3]=almo[$5]=almo[$7]="x2248"; x2248[$2][$3]=$4; x2248[$2][$5]=$6; x2248[$2][$7]=$8; x2248["info"][$3]=$9; continue };
         if($1== "x2249" ){ almo[$3]=almo[$5]=almo[$7]="x2249"; x2249[$2][$3]=$4; x2249[$2][$5]=$6; x2249[$2][$7]=$8; x2249["info"][$3]=$9; continue };
         if($1== "x2250" ){ almo[$3]=almo[$5]=almo[$7]="x2250"; x2250[$2][$3]=$4; x2250[$2][$5]=$6; x2250[$2][$7]=$8; x2250["info"][$3]=$9; continue };
         if($1== "x2251" ){ almo[$3]=almo[$5]=almo[$7]="x2251"; x2251[$2][$3]=$4; x2251[$2][$5]=$6; x2251[$2][$7]=$8; x2251["info"][$3]=$9; continue };
         if($1== "x2252" ){ almo[$3]=almo[$5]=almo[$7]="x2252"; x2252[$2][$3]=$4; x2252[$2][$5]=$6; x2252[$2][$7]=$8; x2252["info"][$3]=$9; continue };
         if($1== "x2253" ){ almo[$3]=almo[$5]=almo[$7]="x2253"; x2253[$2][$3]=$4; x2253[$2][$5]=$6; x2253[$2][$7]=$8; x2253["info"][$3]=$9; continue };
         if($1== "x2254" ){ almo[$3]=almo[$5]=almo[$7]="x2254"; x2254[$2][$3]=$4; x2254[$2][$5]=$6; x2254[$2][$7]=$8; x2254["info"][$3]=$9; continue };
         if($1== "x2255" ){ almo[$3]=almo[$5]=almo[$7]="x2255"; x2255[$2][$3]=$4; x2255[$2][$5]=$6; x2255[$2][$7]=$8; x2255["info"][$3]=$9; continue };
         if($1== "x2256" ){ almo[$3]=almo[$5]=almo[$7]="x2256"; x2256[$2][$3]=$4; x2256[$2][$5]=$6; x2256[$2][$7]=$8; x2256["info"][$3]=$9; continue };
         if($1== "x2257" ){ almo[$3]=almo[$5]=almo[$7]="x2257"; x2257[$2][$3]=$4; x2257[$2][$5]=$6; x2257[$2][$7]=$8; x2257["info"][$3]=$9; continue };
         if($1== "x2258" ){ almo[$3]=almo[$5]=almo[$7]="x2258"; x2258[$2][$3]=$4; x2258[$2][$5]=$6; x2258[$2][$7]=$8; x2258["info"][$3]=$9; continue };
         if($1== "x2259" ){ almo[$3]=almo[$5]=almo[$7]="x2259"; x2259[$2][$3]=$4; x2259[$2][$5]=$6; x2259[$2][$7]=$8; x2259["info"][$3]=$9; continue };
         if($1== "x2260" ){ almo[$3]=almo[$5]=almo[$7]="x2260"; x2260[$2][$3]=$4; x2260[$2][$5]=$6; x2260[$2][$7]=$8; x2260["info"][$3]=$9; continue };
         if($1== "x2261" ){ almo[$3]=almo[$5]=almo[$7]="x2261"; x2261[$2][$3]=$4; x2261[$2][$5]=$6; x2261[$2][$7]=$8; x2261["info"][$3]=$9; continue };
         if($1== "x2262" ){ almo[$3]=almo[$5]=almo[$7]="x2262"; x2262[$2][$3]=$4; x2262[$2][$5]=$6; x2262[$2][$7]=$8; x2262["info"][$3]=$9; continue };
         if($1== "x2263" ){ almo[$3]=almo[$5]=almo[$7]="x2263"; x2263[$2][$3]=$4; x2263[$2][$5]=$6; x2263[$2][$7]=$8; x2263["info"][$3]=$9; continue };
         if($1== "x2264" ){ almo[$3]=almo[$5]=almo[$7]="x2264"; x2264[$2][$3]=$4; x2264[$2][$5]=$6; x2264[$2][$7]=$8; x2264["info"][$3]=$9; continue };
         if($1== "x2265" ){ almo[$3]=almo[$5]=almo[$7]="x2265"; x2265[$2][$3]=$4; x2265[$2][$5]=$6; x2265[$2][$7]=$8; x2265["info"][$3]=$9; continue };
         if($1== "x2266" ){ almo[$3]=almo[$5]=almo[$7]="x2266"; x2266[$2][$3]=$4; x2266[$2][$5]=$6; x2266[$2][$7]=$8; x2266["info"][$3]=$9; continue };
         if($1== "x2267" ){ almo[$3]=almo[$5]=almo[$7]="x2267"; x2267[$2][$3]=$4; x2267[$2][$5]=$6; x2267[$2][$7]=$8; x2267["info"][$3]=$9; continue };
         if($1== "x2268" ){ almo[$3]=almo[$5]=almo[$7]="x2268"; x2268[$2][$3]=$4; x2268[$2][$5]=$6; x2268[$2][$7]=$8; x2268["info"][$3]=$9; continue };
         if($1== "x2269" ){ almo[$3]=almo[$5]=almo[$7]="x2269"; x2269[$2][$3]=$4; x2269[$2][$5]=$6; x2269[$2][$7]=$8; x2269["info"][$3]=$9; continue };
         if($1== "x2270" ){ almo[$3]=almo[$5]=almo[$7]="x2270"; x2270[$2][$3]=$4; x2270[$2][$5]=$6; x2270[$2][$7]=$8; x2270["info"][$3]=$9; continue };
         if($1== "x2271" ){ almo[$3]=almo[$5]=almo[$7]="x2271"; x2271[$2][$3]=$4; x2271[$2][$5]=$6; x2271[$2][$7]=$8; x2271["info"][$3]=$9; continue };
         if($1== "x2272" ){ almo[$3]=almo[$5]=almo[$7]="x2272"; x2272[$2][$3]=$4; x2272[$2][$5]=$6; x2272[$2][$7]=$8; x2272["info"][$3]=$9; continue };
         if($1== "x2273" ){ almo[$3]=almo[$5]=almo[$7]="x2273"; x2273[$2][$3]=$4; x2273[$2][$5]=$6; x2273[$2][$7]=$8; x2273["info"][$3]=$9; continue };
         if($1== "x2274" ){ almo[$3]=almo[$5]=almo[$7]="x2274"; x2274[$2][$3]=$4; x2274[$2][$5]=$6; x2274[$2][$7]=$8; x2274["info"][$3]=$9; continue };
         if($1== "x2275" ){ almo[$3]=almo[$5]=almo[$7]="x2275"; x2275[$2][$3]=$4; x2275[$2][$5]=$6; x2275[$2][$7]=$8; x2275["info"][$3]=$9; continue };
         if($1== "x2276" ){ almo[$3]=almo[$5]=almo[$7]="x2276"; x2276[$2][$3]=$4; x2276[$2][$5]=$6; x2276[$2][$7]=$8; x2276["info"][$3]=$9; continue };
         if($1== "x2277" ){ almo[$3]=almo[$5]=almo[$7]="x2277"; x2277[$2][$3]=$4; x2277[$2][$5]=$6; x2277[$2][$7]=$8; x2277["info"][$3]=$9; continue };
         if($1== "x2278" ){ almo[$3]=almo[$5]=almo[$7]="x2278"; x2278[$2][$3]=$4; x2278[$2][$5]=$6; x2278[$2][$7]=$8; x2278["info"][$3]=$9; continue };
         if($1== "x2279" ){ almo[$3]=almo[$5]=almo[$7]="x2279"; x2279[$2][$3]=$4; x2279[$2][$5]=$6; x2279[$2][$7]=$8; x2279["info"][$3]=$9; continue };
         if($1== "x2280" ){ almo[$3]=almo[$5]=almo[$7]="x2280"; x2280[$2][$3]=$4; x2280[$2][$5]=$6; x2280[$2][$7]=$8; x2280["info"][$3]=$9; continue };
         if($1== "x2281" ){ almo[$3]=almo[$5]=almo[$7]="x2281"; x2281[$2][$3]=$4; x2281[$2][$5]=$6; x2281[$2][$7]=$8; x2281["info"][$3]=$9; continue };
         if($1== "x2282" ){ almo[$3]=almo[$5]=almo[$7]="x2282"; x2282[$2][$3]=$4; x2282[$2][$5]=$6; x2282[$2][$7]=$8; x2282["info"][$3]=$9; continue };
         if($1== "x2283" ){ almo[$3]=almo[$5]=almo[$7]="x2283"; x2283[$2][$3]=$4; x2283[$2][$5]=$6; x2283[$2][$7]=$8; x2283["info"][$3]=$9; continue };
         if($1== "x2284" ){ almo[$3]=almo[$5]=almo[$7]="x2284"; x2284[$2][$3]=$4; x2284[$2][$5]=$6; x2284[$2][$7]=$8; x2284["info"][$3]=$9; continue };
         if($1== "x2285" ){ almo[$3]=almo[$5]=almo[$7]="x2285"; x2285[$2][$3]=$4; x2285[$2][$5]=$6; x2285[$2][$7]=$8; x2285["info"][$3]=$9; continue };
         if($1== "x2286" ){ almo[$3]=almo[$5]=almo[$7]="x2286"; x2286[$2][$3]=$4; x2286[$2][$5]=$6; x2286[$2][$7]=$8; x2286["info"][$3]=$9; continue };
         if($1== "x2287" ){ almo[$3]=almo[$5]=almo[$7]="x2287"; x2287[$2][$3]=$4; x2287[$2][$5]=$6; x2287[$2][$7]=$8; x2287["info"][$3]=$9; continue };
         if($1== "x2288" ){ almo[$3]=almo[$5]=almo[$7]="x2288"; x2288[$2][$3]=$4; x2288[$2][$5]=$6; x2288[$2][$7]=$8; x2288["info"][$3]=$9; continue };
         if($1== "x2289" ){ almo[$3]=almo[$5]=almo[$7]="x2289"; x2289[$2][$3]=$4; x2289[$2][$5]=$6; x2289[$2][$7]=$8; x2289["info"][$3]=$9; continue };
         if($1== "x2290" ){ almo[$3]=almo[$5]=almo[$7]="x2290"; x2290[$2][$3]=$4; x2290[$2][$5]=$6; x2290[$2][$7]=$8; x2290["info"][$3]=$9; continue };
         if($1== "x2291" ){ almo[$3]=almo[$5]=almo[$7]="x2291"; x2291[$2][$3]=$4; x2291[$2][$5]=$6; x2291[$2][$7]=$8; x2291["info"][$3]=$9; continue };
         if($1== "x2292" ){ almo[$3]=almo[$5]=almo[$7]="x2292"; x2292[$2][$3]=$4; x2292[$2][$5]=$6; x2292[$2][$7]=$8; x2292["info"][$3]=$9; continue };
         if($1== "x2293" ){ almo[$3]=almo[$5]=almo[$7]="x2293"; x2293[$2][$3]=$4; x2293[$2][$5]=$6; x2293[$2][$7]=$8; x2293["info"][$3]=$9; continue };
         if($1== "x2294" ){ almo[$3]=almo[$5]=almo[$7]="x2294"; x2294[$2][$3]=$4; x2294[$2][$5]=$6; x2294[$2][$7]=$8; x2294["info"][$3]=$9; continue };
         if($1== "x2295" ){ almo[$3]=almo[$5]=almo[$7]="x2295"; x2295[$2][$3]=$4; x2295[$2][$5]=$6; x2295[$2][$7]=$8; x2295["info"][$3]=$9; continue };
         if($1== "x2296" ){ almo[$3]=almo[$5]=almo[$7]="x2296"; x2296[$2][$3]=$4; x2296[$2][$5]=$6; x2296[$2][$7]=$8; x2296["info"][$3]=$9; continue };
         if($1== "x2297" ){ almo[$3]=almo[$5]=almo[$7]="x2297"; x2297[$2][$3]=$4; x2297[$2][$5]=$6; x2297[$2][$7]=$8; x2297["info"][$3]=$9; continue };
         if($1== "x2298" ){ almo[$3]=almo[$5]=almo[$7]="x2298"; x2298[$2][$3]=$4; x2298[$2][$5]=$6; x2298[$2][$7]=$8; x2298["info"][$3]=$9; continue };
         if($1== "x2299" ){ almo[$3]=almo[$5]=almo[$7]="x2299"; x2299[$2][$3]=$4; x2299[$2][$5]=$6; x2299[$2][$7]=$8; x2299["info"][$3]=$9; continue };
         if($1== "x2300" ){ almo[$3]=almo[$5]=almo[$7]="x2300"; x2300[$2][$3]=$4; x2300[$2][$5]=$6; x2300[$2][$7]=$8; x2300["info"][$3]=$9; continue };
         if($1== "x2301" ){ almo[$3]=almo[$5]=almo[$7]="x2301"; x2301[$2][$3]=$4; x2301[$2][$5]=$6; x2301[$2][$7]=$8; x2301["info"][$3]=$9; continue };
         if($1== "x2302" ){ almo[$3]=almo[$5]=almo[$7]="x2302"; x2302[$2][$3]=$4; x2302[$2][$5]=$6; x2302[$2][$7]=$8; x2302["info"][$3]=$9; continue };
         if($1== "x2303" ){ almo[$3]=almo[$5]=almo[$7]="x2303"; x2303[$2][$3]=$4; x2303[$2][$5]=$6; x2303[$2][$7]=$8; x2303["info"][$3]=$9; continue };
         if($1== "x2304" ){ almo[$3]=almo[$5]=almo[$7]="x2304"; x2304[$2][$3]=$4; x2304[$2][$5]=$6; x2304[$2][$7]=$8; x2304["info"][$3]=$9; continue };
         if($1== "x2305" ){ almo[$3]=almo[$5]=almo[$7]="x2305"; x2305[$2][$3]=$4; x2305[$2][$5]=$6; x2305[$2][$7]=$8; x2305["info"][$3]=$9; continue };
         if($1== "x2306" ){ almo[$3]=almo[$5]=almo[$7]="x2306"; x2306[$2][$3]=$4; x2306[$2][$5]=$6; x2306[$2][$7]=$8; x2306["info"][$3]=$9; continue };
         if($1== "x2307" ){ almo[$3]=almo[$5]=almo[$7]="x2307"; x2307[$2][$3]=$4; x2307[$2][$5]=$6; x2307[$2][$7]=$8; x2307["info"][$3]=$9; continue };
         if($1== "x2308" ){ almo[$3]=almo[$5]=almo[$7]="x2308"; x2308[$2][$3]=$4; x2308[$2][$5]=$6; x2308[$2][$7]=$8; x2308["info"][$3]=$9; continue };
         if($1== "x2309" ){ almo[$3]=almo[$5]=almo[$7]="x2309"; x2309[$2][$3]=$4; x2309[$2][$5]=$6; x2309[$2][$7]=$8; x2309["info"][$3]=$9; continue };
         if($1== "x2310" ){ almo[$3]=almo[$5]=almo[$7]="x2310"; x2310[$2][$3]=$4; x2310[$2][$5]=$6; x2310[$2][$7]=$8; x2310["info"][$3]=$9; continue };
         if($1== "x2311" ){ almo[$3]=almo[$5]=almo[$7]="x2311"; x2311[$2][$3]=$4; x2311[$2][$5]=$6; x2311[$2][$7]=$8; x2311["info"][$3]=$9; continue };
         if($1== "x2312" ){ almo[$3]=almo[$5]=almo[$7]="x2312"; x2312[$2][$3]=$4; x2312[$2][$5]=$6; x2312[$2][$7]=$8; x2312["info"][$3]=$9; continue };
         if($1== "x3001" ){ almo[$3]=almo[$5]=almo[$7]="x3001"; x3001[$2][$3]=$4; x3001[$2][$5]=$6; x3001[$2][$7]=$8; x3001["info"][$3]=$9; continue };
         if($1== "x3002" ){ almo[$3]=almo[$5]=almo[$7]="x3002"; x3002[$2][$3]=$4; x3002[$2][$5]=$6; x3002[$2][$7]=$8; x3002["info"][$3]=$9; continue };
         if($1== "x3003" ){ almo[$3]=almo[$5]=almo[$7]="x3003"; x3003[$2][$3]=$4; x3003[$2][$5]=$6; x3003[$2][$7]=$8; x3003["info"][$3]=$9; continue };
         if($1== "x3004" ){ almo[$3]=almo[$5]=almo[$7]="x3004"; x3004[$2][$3]=$4; x3004[$2][$5]=$6; x3004[$2][$7]=$8; x3004["info"][$3]=$9; continue };
         if($1== "x3005" ){ almo[$3]=almo[$5]=almo[$7]="x3005"; x3005[$2][$3]=$4; x3005[$2][$5]=$6; x3005[$2][$7]=$8; x3005["info"][$3]=$9; continue };
         if($1== "x3006" ){ almo[$3]=almo[$5]=almo[$7]="x3006"; x3006[$2][$3]=$4; x3006[$2][$5]=$6; x3006[$2][$7]=$8; x3006["info"][$3]=$9; continue };
         if($1== "x3007" ){ almo[$3]=almo[$5]=almo[$7]="x3007"; x3007[$2][$3]=$4; x3007[$2][$5]=$6; x3007[$2][$7]=$8; x3007["info"][$3]=$9; continue };
         if($1== "x3008" ){ almo[$3]=almo[$5]=almo[$7]="x3008"; x3008[$2][$3]=$4; x3008[$2][$5]=$6; x3008[$2][$7]=$8; x3008["info"][$3]=$9; continue };
         if($1== "x3009" ){ almo[$3]=almo[$5]=almo[$7]="x3009"; x3009[$2][$3]=$4; x3009[$2][$5]=$6; x3009[$2][$7]=$8; x3009["info"][$3]=$9; continue };
         if($1== "x3010" ){ almo[$3]=almo[$5]=almo[$7]="x3010"; x3010[$2][$3]=$4; x3010[$2][$5]=$6; x3010[$2][$7]=$8; x3010["info"][$3]=$9; continue };
         if($1== "x3011" ){ almo[$3]=almo[$5]=almo[$7]="x3011"; x3011[$2][$3]=$4; x3011[$2][$5]=$6; x3011[$2][$7]=$8; x3011["info"][$3]=$9; continue };
         if($1== "x3012" ){ almo[$3]=almo[$5]=almo[$7]="x3012"; x3012[$2][$3]=$4; x3012[$2][$5]=$6; x3012[$2][$7]=$8; x3012["info"][$3]=$9; continue };
         if($1== "x3013" ){ almo[$3]=almo[$5]=almo[$7]="x3013"; x3013[$2][$3]=$4; x3013[$2][$5]=$6; x3013[$2][$7]=$8; x3013["info"][$3]=$9; continue };
         if($1== "x3014" ){ almo[$3]=almo[$5]=almo[$7]="x3014"; x3014[$2][$3]=$4; x3014[$2][$5]=$6; x3014[$2][$7]=$8; x3014["info"][$3]=$9; continue };
         if($1== "x3015" ){ almo[$3]=almo[$5]=almo[$7]="x3015"; x3015[$2][$3]=$4; x3015[$2][$5]=$6; x3015[$2][$7]=$8; x3015["info"][$3]=$9; continue };
         if($1== "x3016" ){ almo[$3]=almo[$5]=almo[$7]="x3016"; x3016[$2][$3]=$4; x3016[$2][$5]=$6; x3016[$2][$7]=$8; x3016["info"][$3]=$9; continue };
         if($1== "x3017" ){ almo[$3]=almo[$5]=almo[$7]="x3017"; x3017[$2][$3]=$4; x3017[$2][$5]=$6; x3017[$2][$7]=$8; x3017["info"][$3]=$9; continue };
         if($1== "x4700" ){ almo[$3]=almo[$5]=almo[$7]="x4700"; x4700[$2][$3]=$4; x4700[$2][$5]=$6; x4700[$2][$7]=$8; x4700["info"][$3]=$9; continue };
         if($1== "x4701" ){ almo[$3]=almo[$5]=almo[$7]="x4701"; x4701[$2][$3]=$4; x4701[$2][$5]=$6; x4701[$2][$7]=$8; x4701["info"][$3]=$9; continue };
         if($1== "x4702" ){ almo[$3]=almo[$5]=almo[$7]="x4702"; x4702[$2][$3]=$4; x4702[$2][$5]=$6; x4702[$2][$7]=$8; x4702["info"][$3]=$9; continue };
         if($1== "x4703" ){ almo[$3]=almo[$5]=almo[$7]="x4703"; x4703[$2][$3]=$4; x4703[$2][$5]=$6; x4703[$2][$7]=$8; x4703["info"][$3]=$9; continue };
         if($1== "x4704" ){ almo[$3]=almo[$5]=almo[$7]="x4704"; x4704[$2][$3]=$4; x4704[$2][$5]=$6; x4704[$2][$7]=$8; x4704["info"][$3]=$9; continue };
         if($1== "x4777" ){ almo[$3]=almo[$5]=almo[$7]="x4777"; x4777[$2][$3]=$4; x4777[$2][$5]=$6; x4777[$2][$7]=$8; x4777["info"][$3]=$9; continue };

   }; close(cmd);
   # omoid[омограф][омоид][роль]
   cmd = "zcat " indb "omos_part.gz";
   while ((cmd|getline) > 0) {
         ispa_any[$1]
         if($2== "ispa_abst"  ) { ispa_abst  [$1]; continue };
         if($2== "ispa_gas"   ) { ispa_gas   [$1]; continue };
         if($2== "ispa_food"  ) { ispa_food  [$1]; continue };
         if($2== "ispa_liquid") { ispa_liquid[$1]; continue };
         if($2== "ispa_loose" ) { ispa_loose [$1]; continue };
         if($2== "ispa_solid" ) { ispa_solid [$1]; continue };
   }; close(cmd); # словарик партитивов по классам: any, abst, gas, food, liquid, loose, solid

   cmd = "zcat " indb "omoid_part.gz";
   while ((cmd|getline) > 0) {
       for (i=3; i<=NF; i++) {
           if ($i ~ /^[а-яё]+$/) { omoid[$i][$1][$2]; continue }
           else {
              if ($i== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[j][$1][$2] }; continue };
           }; }
   }; close(cmd); # словарик связаных слов, картитивы представлены только в качестве указания их классов.

   cmd = "zcat " indb "omoid_an.gz";
   while ((cmd|getline) > 0) {
       for (i=3; i<=NF; i++) {
           if ($i ~ /^[а-яё]+$/) { omoid[$i][$1][$2]; continue }
           else {
              if ($i== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[j][$1][$2] }; continue };
           }; }
   }; close(cmd); # словарик связаных слов, омоид в поле 1, омограф(ы) с 3-го поля
   cmd = "zcat " indb "omoid_aus.gz";
   while ((cmd|getline) > 0) {
       for (i=3; i<=NF; i++) {
           if ($i ~ /^[а-яё]+$/) { omoid[$1][$i][$2]; continue }
           else {
              if ($i== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[$1][j][$2] }; continue };
           }; }
   }; close(cmd); # словарик связаных слов, омоид в поле 3+, омограф в 1 поле

   # обработанные слова в их конечной форме
   cmd = "zcat " indb "ist.gz | \
          sed -r 's/([аеёиоуыэюя])\\x27/\\1\\xcc\\x81/g; \
                  s/\\\\xcc\\\\xa0/\\xcc\\xa0/g; \
                  s/\\\\xcc\\\\xa3/\\xcc\\xa3/g; \
                  s/\\\\xcc\\\\xa4/\\xcc\\xa4/g; \
                  s/\\\\xcc\\\\xad/\\xcc\\xad/g; \
                  s/\\\\xcc\\\\xb0/\\xcc\\xb0/g'";
   while ((cmd|getline) > 0) {
         if($2== "is_nar_mest"         ){ is_nar_mest         [$1]; continue };
         if($2== "is_nar_napr"         ){ is_nar_napr         [$1]; continue };
         if($2== "is_nar_spos"         ){ is_nar_spos         [$1]; continue };
         if($2== "is_nar_vrem"         ){ is_nar_vrem         [$1]; continue };
         if($2== "is_prl_edmuim"       ){ is_prl_edmuim       [$1]; continue };
         if($2== "is_prl_edmupr"       ){ is_prl_edmupr       [$1]; continue };
         if($2== "is_prl_edmuvi"       ){ is_prl_edmuvi       [$1]; continue };
         if($2== "is_prl_edsrpr"       ){ is_prl_edsrpr       [$1]; continue };
         if($2== "is_prl_edzeda"       ){ is_prl_edzeda       [$1]; continue };
         if($2== "is_prl_edzeim"       ){ is_prl_edzeim       [$1]; continue };
         if($2== "is_prl_edzepr"       ){ is_prl_edzepr       [$1]; continue };
         if($2== "is_prl_edzero"       ){ is_prl_edzero       [$1]; continue };
         if($2== "is_prl_edzetv"       ){ is_prl_edzetv       [$1]; continue };
         if($2== "is_prl_kred_mu"      ){ is_prl_kred_mu      [$1]; continue };
         if($2== "is_prl_kred_ze"      ){ is_prl_kred_ze      [$1]; continue };
         if($2== "is_prl_krmn"         ){ is_prl_krmn         [$1]; continue };
         if($2== "is_suw_edmuda"       ){ is_suw_edmuda       [$1]; continue };
         if($2== "is_suw_edmuim"       ){ is_suw_edmuim       [$1]; continue };
         if($2== "is_suw_edmulo"       ){ is_suw_edmulo       [$1]; continue };
         if($2== "is_suw_edmune"       ){ is_suw_edmune       [$1]; continue };
         if($2== "is_suw_edmupa"       ){ is_suw_edmupa       [$1]; continue };
         if($2== "is_suw_edmupr"       ){ is_suw_edmupr       [$1]; continue };
         if($2== "is_suw_edmuro"       ){ is_suw_edmuro       [$1]; continue };
         if($2== "is_suw_edmusq"       ){ is_suw_edmusq       [$1]; continue };
         if($2== "is_suw_edmutv"       ){ is_suw_edmutv       [$1]; continue };
         if($2== "is_suw_edmuvi"       ){ is_suw_edmuvi       [$1]; continue };
         if($2== "is_suw_edmuzv"       ){ is_suw_edmuzv       [$1]; continue };
         if($2== "is_suw_edsrda"       ){ is_suw_edsrda       [$1]; continue };
         if($2== "is_suw_edsrim"       ){ is_suw_edsrim       [$1]; continue };
         if($2== "is_suw_edsrne"       ){ is_suw_edsrne       [$1]; continue };
         if($2== "is_suw_edsrpr"       ){ is_suw_edsrpr       [$1]; continue };
         if($2== "is_suw_edsrro"       ){ is_suw_edsrro       [$1]; continue };
         if($2== "is_suw_edsrtv"       ){ is_suw_edsrtv       [$1]; continue };
         if($2== "is_suw_edsrvi"       ){ is_suw_edsrvi       [$1]; continue };
         if($2== "is_suw_edsrzv"       ){ is_suw_edsrzv       [$1]; continue };
         if($2== "is_suw_edzeda"       ){ is_suw_edzeda       [$1]; continue };
         if($2== "is_suw_edzeim"       ){ is_suw_edzeim       [$1]; continue };
         if($2== "is_suw_edzelo"       ){ is_suw_edzelo       [$1]; continue };
         if($2== "is_suw_edzepr"       ){ is_suw_edzepr       [$1]; continue };
         if($2== "is_suw_edzero"       ){ is_suw_edzero       [$1]; continue };
         if($2== "is_suw_edzetv"       ){ is_suw_edzetv       [$1]; continue };
         if($2== "is_suw_edzevi"       ){ is_suw_edzevi       [$1]; continue };
         if($2== "is_suw_mnda"         ){ is_suw_mnda         [$1]; continue };
         if($2== "is_suw_mnim"         ){ is_suw_mnim         [$1]; continue };
         if($2== "is_suw_mnpr"         ){ is_suw_mnpr         [$1]; continue };
         if($2== "is_suw_mnro"         ){ is_suw_mnro         [$1]; continue };
         if($2== "is_suw_mnvi"         ){ is_suw_mnvi         [$1]; continue };
     }; # связаных слов
   close(cmd);

    # массивы для разных целей

    # расширенное "это"
    cst = "это то се сие оно сё";                                                                         stoar(cst,mst_it," ");
    # Предлоги, разделенные по однозначности
    cst = "а-ля";                                                                                         stoar(cst,predc_im," ");
    cst = "включая исключая минуя погодя покеда про сквозь скрозь спустя считая через черезо чрез чрезо"; stoar(cst,predc_vi," ");
    cst = "акромя без безо близ близ вблизи вверху ввиду вглубь вдали вдоль взамен вкось вкруг вместо вне внизу внутри внутрь вовнутрь возле вокруг волею вперед впереди времен времён вроде вследствие встречь выше для до заботами заместо заради из из-за из-под из-подо изнутри изо именем имени касаемо касательно кроме кругом мимо наверху навроде назади накануне наподобие наподобье напротив насупротив насчет насчёт недалеко независимо ниже обок обочь около окрест окроме окромя опосля опричь от относительно ото памяти поблизости повдоль поверх подле позади позадь позднее поздней позже помимо поперед поперек поперёд поперёк порядка посереди посередине посередке посередь посерёдке после посреди посредине посредством превыше прежде против противу путем путём ради раньше сбоку сверх сверху свыше середи середь сзади силами снаружи снизу спереди среди средь супротив типа у ценой ценою";
        stoar(cst,predc_ro," ");
    cst = "благодаря вдогон вдогонку вопреки вослед вразрез вслед к ко навстречу наперекор наперерез наперехват подобно противно согласно сообразно соответственно соразмерно сродни";
        stoar(cst,predc_da," ");
    cst = "кончая над надо начиная по-над по-под";   stoar(cst,predc_tv," ");
    cst = "при";                                     stoar(cst,predc_pr," ");
    cst = "в во";                                    stoar(cst,predc_imvipr," ");
    cst = "на о об обо";                             stoar(cst,predc_vipr," ");
    cst = "за пред предо по-за под подо пред предо"; stoar(cst,predc_vitv," ");
    cst = "меж между промеж промежду";               stoar(cst,predc_rotv," ");
    cst = "с со";                                    stoar(cst,predc_virotv," ");
    cst = "по";                                      stoar(cst,predc_vidapr," ");
    # двойственное число
    cst = "оба полтора два три четыре половина четверть";              stoar(cst,qd_duom," ");
    cst = "обе полторы две три четыре половина четверть";              stoar(cst,qd_duoz," ");
    # местоимения с точки зрения определения рода существительного
    cst = "весь свой мой твой ваш наш этот сей тот такой эдакий";                   stoar(cst,mstc_edmuim," ");
    cst = "всего своего моего твоего вашего нашего этого сего того такого эдакого"; stoar(cst,mstc_edmuro," ");
    cst = "всему своему моему твоему вашему нашему этому сему тому такому эдакому"; stoar(cst,mstc_edmuda," ");
    cst = "всем своим моим твоим вашим нашим этим сим тем таким эдаким";            stoar(cst,mstc_edmutv," ");
    cst = "всём своём моём твоём вашем нашем этом сём том таком эдаком";            stoar(cst,mstc_edmupr," ");

    cst = "всё своё моё твоё ваше наше это сё то такое эдакое";                     stoar(cst,mstc_edsrim," ");
#   cst = "всего своего моего твоего вашего нашего этого сего того такого эдакого"; stoar(cst,mstc_edsrro," ");
#   cst = "всему своему моему твоему вашему нашему этому сему тому такому эдакому"; stoar(cst,mstc_edsrda," ");
#   cst = "всем своим моим твоим вашим нашим этим сим тем таким эдаким";            stoar(cst,mstc_edsrtv," ");
#   cst = "всём своём моём твоём вашем нашем этом сём том таком эдаком";            stoar(cst,mstc_edsrpr," ");

    cst = "вся своя моя твоя ваша наша эта сия та такая эдакая";                    stoar(cst,mstc_edzeim," ");
    cst = "всю свою мою твою вашу нашу эту сию ту такую эдакую";                    stoar(cst,mstc_edzevi," ");
    cst = "всей своей моей твоей вашей нашей этой сей той такой эдакой";            stoar(cst,mstc_edzero," ");
#   cst = "всей своей моей твоей вашей нашей этой сей той такой эдакой";            stoar(cst,mstc_edzeda," ");
#   cst = "всей своей моей твоей вашей нашей этой сей той такой эдакой";            stoar(cst,mstc_edzetv," ");
#   cst = "всей своей моей твоей вашей нашей этой сей той такой эдакой";            stoar(cst,mstc_edzepr," ");

    cst = "все свои мои твои ваши наши эти си те такие эдакие";                     stoar(cst,mstc_mnim," ");
    cst = "всех своих моих твоих ваших наших этих сих тех таких эдаких";            stoar(cst,mstc_mnro," ");
    cst = "всем своим моим твоим вашим нашим этим сим тем таким эдаким";            stoar(cst,mstc_mnda," ");
    cst = "всеми своими моими твоими вашими нашими этими сими теми такими эдакими"; stoar(cst,mstc_mntv," ");
    cst = "всех своих моих твоих ваших наших этих сих тех таких эдаких";            stoar(cst,mstc_mnpr," ");

    cst = "его её их";                                                              stoar(cst,mstc_3e," ");
    cst = "и или да иль";                                                           stoar(cst,soyz_iili," ");

# массив для "все"
    vse["все"];vse["Все"];vse["ВСЕ"];
    vsyo["все"]="всё";vsyo["Все"]="Всё";vsyo["ВСЕ"]="ВСЁ";vsje["все"]="все́";vsje["Все"]="Все́";vsje["ВСЕ"]="ВСЕ́";
    vsyos["всё"];vsyos["Всё"];vsyos["ВСЁ"];vsjes["все́"];vsjes["Все́"];vsjes["ВСЕ́"];

   dbg=dbgstat=""

 # Записать состояние словарных массивов
  if (gawk52 == 1) { writeall(classcache) };
  cmd = "md5sum " indb "classes.awk " inax "classes.bin " indb "dic_cust.gz " indb "dic_gl.gz " indb "dic_gl_add.gz " indb "dic_prl.gz " indb "dic_prq.gz " \
         indb "dic_rest.gz " indb "dic_rest_add.gz " indb "dic_suw.gz " indb "dic_suw_add.gz " indb "automo.gz " indb "class.list.gz " indb "omoid_an.gz " \
         indb "omoid_aus.gz " indb "omoid_part.gz " indb "omos_part.gz " indb "ist.gz " "> " inax "classes.md5"
  system(cmd); close(cmd)
   } #gnuawk

 # Коррекции - удаление омографов из массивов

#delete g2_nena_e1["есть"];delete g2_nena_e2["есть"];delete g2_nena_e3["есть"];delete g2_nena_m1["есть"];delete g2_nena_m2["есть"];delete g2_nena_m3["есть"];delete qst["есть"];
#delete gs_pebu_m3["выглядят"];
#delete gn_nepo_ed["времени"];
#delete gs_pepa_edze["дела"];
#delete gs_pepo_ed["почти"];delete gs_pepo_ed["пришли"];delete gs_pepo_ed["отели"];
#delete gn_pepo_ed["пять"];
#delete gn_nepa_edsr["тускло"];
#delete gs_pepa_edsr["дело"];
#delete soyz["все-таки"]; delete qst["все-таки"];
#delete dpn_pe_na["для"];
#delete dpn_pn_na["хотя"];
#delete gn_pepo_ed["три"];
#delete swn_edsr_ne["надо"];
#delete swn_edze_da["были"];delete swn_edze_pr["были"];delete swn_edze_ro["были"];delete swn_mn_im["были"];
#delete swo_edmu_tv["им"];
#delete swo_edmu_ro["его"];delete swo_edmu_ro["этого"];delete sw_edmu_ro["этого"];
#delete swn_edsr_im["сто"];delete swn_edsr_vi["сто"];
#delete swn_edmu_im["сорок"]
#delete swn_edmu_im["тут"];delete swn_mn_ro["тут"];
#delete swn_mn_im["или"];
#delete swn_edsr_ne["но"]

# for (k=1; k<=664; k++) { printf ("%s%s %s %s\n", "R", k, "=", DIC[k]); sumdic = sumdic + DIC[k] }; print sumdic;

}

