@load "rwarray"

BEGIN {
# Скрипт чтения словарных баз в массивы
# Последняя версия файла тут: https://github.com/Balamoote/gtts-scripts
    # let @a=1|%s/;DIC\["\zs[0-9]\+\ze"\]/\=''.(@a+setreg('a',@a+1))/g|%s/k<=\zs\d\+\ze;/\=''.(@a-1)/g
    # %s:\[$1\];\zs\ze:DIC["1"]++;:gc
    # %s:DIC\["\d\+"\]++;::gc

 # Проверяем версию gawk, если меньше 5.2.1, то выключаем функции сохранения и восстановления массивов и переменных: базы тогда читаются всегда заново.
    redix=gawk52="42"
    cmd = "awk -Wversion | head -1"
    cmd|getline verheader; close(cmd)
    split(verheader, gnuawk, "[ .,]")
    if (gnuawk[1] == "GNU" && gnuawk[2] == "Awk" && gnuawk[3] >= 5 && gnuawk[4] >= 2 && gnuawk[5] >= 1) { gawk52 = 1 };
 # Если словари и этот скрипт не изменились и gawk>=5.2.1, восстановить состояние, иначе прочитать всё заново.
   if ( gawk52 == 1 ) {
    cmd   = "md5sum -c --status " inax "classes.md5 >/dev/null 2>&1"
    redix = system(cmd); close(cmd);};

   classcache = inax "classes.bin"

   if (redix == 0 && gawk52 == 1) { readall(classcache) } else {

   cmd = "zcat " indb "dic_prq.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };

      if($2~ /_ед_жен_/ ){
       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]ю(ся)?$/  ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_тв$/          ){  pq2_ne_vz_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_тв$/          ){  pq2_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_тв$/              ){  pq2_ne_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_тв$/              ){  pq2_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_тв$/              ){  pq2_pe_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_тв$/              ){  pq2_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_тв$/        ){  pq2_pe_sd_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_тв$/        ){  pq2_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_тв$/              ){  pq2_pn_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_тв$/              ){  pq2_pn_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_тв$/         ){  pqn_ne_vz_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_тв$/         ){  pqn_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_тв$/             ){  pqn_ne_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_тв$/             ){  pqn_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_тв$/             ){  pqn_pe_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_тв$/             ){  pqn_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_тв$/       ){  pqn_pe_sd_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_тв$/       ){  pqn_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_тв$/             ){  pqn_pn_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_тв$/             ){  pqn_pn_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_тв$/           ){  pqs_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_тв$/               ){  pqs_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_тв$/               ){  pqs_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_тв$/         ){  pqs_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_тв$/               ){  pqs_pn_pa_ed_ze_tv     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]й(ся)?$/  ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_тв$/          ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_тв$/          ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_тв$/              ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_тв$/              ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_тв$/              ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_тв$/              ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_тв$/        ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_тв$/        ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_тв$/              ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_тв$/              ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_тв$/         ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_тв$/         ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_тв$/             ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_тв$/             ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_тв$/             ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_тв$/             ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_тв$/       ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_тв$/       ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_тв$/             ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_тв$/             ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_тв$/           ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_тв$/               ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_тв$/               ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_тв$/         ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_тв$/               ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_дат$/         ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_дат$/         ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_дат$/             ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_дат$/             ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_дат$/             ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_дат$/             ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_дат$/       ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_дат$/       ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_дат$/             ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_дат$/             ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_дат$/        ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_дат$/        ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_дат$/            ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_дат$/            ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_дат$/            ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_дат$/            ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_дат$/      ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_дат$/      ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_дат$/            ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_дат$/            ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_дат$/          ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_дат$/              ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_дат$/              ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_дат$/        ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_дат$/              ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_пр$/          ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_пр$/          ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_пр$/              ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_пр$/              ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_пр$/              ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_пр$/              ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_пр$/        ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_пр$/        ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_пр$/              ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_пр$/              ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_пр$/         ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_пр$/         ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_пр$/             ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_пр$/             ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_пр$/             ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_пр$/             ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_пр$/       ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_пр$/       ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_пр$/             ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_пр$/             ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_пр$/           ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_пр$/               ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_пр$/               ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_пр$/         ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_пр$/               ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_род$/         ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_род$/         ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_род$/             ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_род$/             ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_род$/             ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_род$/             ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_род$/       ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_род$/       ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_род$/             ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_род$/             ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_род$/        ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_род$/        ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_род$/            ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_род$/            ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_род$/            ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_род$/            ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_род$/      ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_род$/      ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_род$/            ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_род$/            ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_род$/          ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_род$/              ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_род$/              ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_род$/        ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_род$/              ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_им$/          ){  pq2_ne_vz_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_им$/          ){  pq2_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_им$/              ){  pq2_ne_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_им$/              ){  pq2_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_им$/              ){  pq2_pe_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_им$/              ){  pq2_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_им$/        ){  pq2_pe_sd_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_им$/        ){  pq2_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_им$/              ){  pq2_pn_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_им$/              ){  pq2_pn_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_им$/         ){  pqn_ne_vz_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_им$/         ){  pqn_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_им$/             ){  pqn_ne_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_им$/             ){  pqn_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_им$/             ){  pqn_pe_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_им$/             ){  pqn_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_им$/       ){  pqn_pe_sd_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_им$/       ){  pqn_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_им$/             ){  pqn_pn_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_им$/             ){  pqn_pn_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_им$/           ){  pqs_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_им$/               ){  pqs_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_им$/               ){  pqs_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_им$/         ){  pqs_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_им$/               ){  pqs_pn_pa_ed_ze_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_вин$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_вин$/         ){  pq2_ne_vz_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_вин$/         ){  pq2_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_вин$/             ){  pq2_ne_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_вин$/             ){  pq2_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_вин$/             ){  pq2_pe_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_вин$/             ){  pq2_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_вин$/       ){  pq2_pe_sd_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_вин$/       ){  pq2_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_вин$/             ){  pq2_pn_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_вин$/             ){  pq2_pn_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_вин$/        ){  pqn_ne_vz_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_вин$/        ){  pqn_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_вин$/            ){  pqn_ne_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_вин$/            ){  pqn_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_вин$/            ){  pqn_pe_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_вин$/            ){  pqn_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_вин$/      ){  pqn_pe_sd_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_вин$/      ){  pqn_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_вин$/            ){  pqn_pn_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_вин$/            ){  pqn_pn_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_вин$/          ){  pqs_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_вин$/              ){  pqs_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_вин$/              ){  pqs_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_вин$/        ){  pqs_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_вин$/              ){  pqs_pn_pa_ed_ze_vi     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]ю(ся)?$/  ){  pq_edze_tv        [$1]=$3; continue };
#       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]й(ся)?$/  ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_дат$/                      ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_пр$/                       ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_род$/                      ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_им$/                       ){  pq_edze_im        [$1]=$3; continue };
#       if ($2~ /_ед_жен_вин$/                      ){  pq_edze_vi        [$1]=$3; continue };
      if($2~ /_ед_муж_/ ){
       if ($2~ /_ед_муж_вин_неод$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_вин_неод$/    ){  pq2_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_вин_неод$/    ){  pq2_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_вин_неод$/        ){  pq2_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_вин_неод$/        ){  pq2_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_вин_неод$/        ){  pq2_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_вин_неод$/        ){  pq2_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_вин_неод$/  ){  pq2_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_вин_неод$/  ){  pq2_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_вин_неод$/        ){  pq2_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_вин_неод$/        ){  pq2_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_вин_неод$/   ){  pqn_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_вин_неод$/   ){  pqn_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_вин_неод$/       ){  pqn_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_вин_неод$/       ){  pqn_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_вин_неод$/       ){  pqn_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_вин_неод$/       ){  pqn_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_вин_неод$/ ){  pqn_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_вин_неод$/ ){  pqn_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_вин_неод$/       ){  pqn_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_вин_неод$/       ){  pqn_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_вин_неод$/     ){  pqs_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_вин_неод$/         ){  pqs_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_вин_неод$/         ){  pqs_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_вин_неод$/   ){  pqs_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_вин_неод$/         ){  pqs_pn_pa_ed_mu_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_вин_одуш$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_вин_одуш$/    ){  pq2_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_вин_одуш$/    ){  pq2_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_вин_одуш$/        ){  pq2_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_вин_одуш$/        ){  pq2_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_вин_одуш$/        ){  pq2_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_вин_одуш$/        ){  pq2_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_вин_одуш$/  ){  pq2_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_вин_одуш$/  ){  pq2_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_вин_одуш$/        ){  pq2_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_вин_одуш$/        ){  pq2_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_вин_одуш$/   ){  pqn_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_вин_одуш$/   ){  pqn_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_вин_одуш$/       ){  pqn_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_вин_одуш$/       ){  pqn_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_вин_одуш$/       ){  pqn_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_вин_одуш$/       ){  pqn_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_вин_одуш$/ ){  pqn_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_вин_одуш$/ ){  pqn_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_вин_одуш$/       ){  pqn_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_вин_одуш$/       ){  pqn_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_вин_одуш$/     ){  pqs_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_вин_одуш$/         ){  pqs_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_вин_одуш$/         ){  pqs_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_вин_одуш$/   ){  pqs_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_вин_одуш$/         ){  pqs_pn_pa_ed_mu_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_дат$/         ){  pq2_ne_vz_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_дат$/         ){  pq2_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_дат$/             ){  pq2_ne_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_дат$/             ){  pq2_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_дат$/             ){  pq2_pe_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_дат$/             ){  pq2_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_дат$/       ){  pq2_pe_sd_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_дат$/       ){  pq2_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_дат$/             ){  pq2_pn_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_дат$/             ){  pq2_pn_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_дат$/        ){  pqn_ne_vz_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_дат$/        ){  pqn_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_дат$/            ){  pqn_ne_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_дат$/            ){  pqn_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_дат$/            ){  pqn_pe_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_дат$/            ){  pqn_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_дат$/      ){  pqn_pe_sd_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_дат$/      ){  pqn_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_дат$/            ){  pqn_pn_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_дат$/            ){  pqn_pn_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_дат$/          ){  pqs_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_дат$/              ){  pqs_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_дат$/              ){  pqs_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_дат$/        ){  pqs_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_дат$/              ){  pqs_pn_pa_ed_mu_da     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_им$/          ){  pq2_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_им$/          ){  pq2_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_им$/              ){  pq2_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_им$/              ){  pq2_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_им$/              ){  pq2_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_им$/              ){  pq2_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_им$/        ){  pq2_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_им$/        ){  pq2_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_им$/              ){  pq2_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_им$/              ){  pq2_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_им$/         ){  pqn_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_им$/         ){  pqn_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_им$/             ){  pqn_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_им$/             ){  pqn_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_им$/             ){  pqn_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_им$/             ){  pqn_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_им$/       ){  pqn_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_им$/       ){  pqn_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_им$/             ){  pqn_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_им$/             ){  pqn_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_им$/           ){  pqs_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_им$/               ){  pqs_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_им$/               ){  pqs_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_им$/         ){  pqs_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_им$/               ){  pqs_pn_pa_ed_mu_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_пр$/          ){  pq2_ne_vz_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_пр$/          ){  pq2_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_пр$/              ){  pq2_ne_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_пр$/              ){  pq2_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_пр$/              ){  pq2_pe_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_пр$/              ){  pq2_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_пр$/        ){  pq2_pe_sd_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_пр$/        ){  pq2_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_пр$/              ){  pq2_pn_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_пр$/              ){  pq2_pn_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_пр$/         ){  pqn_ne_vz_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_пр$/         ){  pqn_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_пр$/             ){  pqn_ne_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_пр$/             ){  pqn_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_пр$/             ){  pqn_pe_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_пр$/             ){  pqn_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_пр$/       ){  pqn_pe_sd_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_пр$/       ){  pqn_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_пр$/             ){  pqn_pn_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_пр$/             ){  pqn_pn_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_пр$/           ){  pqs_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_пр$/               ){  pqs_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_пр$/               ){  pqs_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_пр$/         ){  pqs_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_пр$/               ){  pqs_pn_pa_ed_mu_pr     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_род$/         ){  pq2_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_род$/         ){  pq2_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_род$/             ){  pq2_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_род$/             ){  pq2_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_род$/             ){  pq2_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_род$/             ){  pq2_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_род$/       ){  pq2_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_род$/       ){  pq2_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_род$/             ){  pq2_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_род$/             ){  pq2_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_род$/        ){  pqn_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_род$/        ){  pqn_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_род$/            ){  pqn_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_род$/            ){  pqn_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_род$/            ){  pqn_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_род$/            ){  pqn_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_род$/      ){  pqn_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_род$/      ){  pqn_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_род$/            ){  pqn_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_род$/            ){  pqn_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_род$/          ){  pqs_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_род$/              ){  pqs_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_род$/              ){  pqs_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_род$/        ){  pqs_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_род$/              ){  pqs_pn_pa_ed_mu_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_тв$/          ){  pq2_ne_vz_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_тв$/          ){  pq2_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_тв$/              ){  pq2_ne_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_тв$/              ){  pq2_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_тв$/              ){  pq2_pe_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_тв$/              ){  pq2_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_тв$/        ){  pq2_pe_sd_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_тв$/        ){  pq2_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_тв$/              ){  pq2_pn_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_тв$/              ){  pq2_pn_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_тв$/         ){  pqn_ne_vz_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_тв$/         ){  pqn_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_тв$/             ){  pqn_ne_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_тв$/             ){  pqn_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_тв$/             ){  pqn_pe_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_тв$/             ){  pqn_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_тв$/       ){  pqn_pe_sd_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_тв$/       ){  pqn_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_тв$/             ){  pqn_pn_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_тв$/             ){  pqn_pn_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_тв$/           ){  pqs_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_тв$/               ){  pqs_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_тв$/               ){  pqs_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_тв$/         ){  pqs_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_тв$/               ){  pqs_pn_pa_ed_mu_tv     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_муж_вин_неод$/                 ){  pq_edmu_im        [$1]=$3; continue };
#       if ($2~ /_ед_муж_вин_одуш$/                 ){  pq_edmu_ro        [$1]=$3; continue };
#	if ($2~ /_ед_муж_им$/                       ){  pq_edmu_im        [$1]=$3; continue };
#       if ($2~ /_ед_муж_пр$/                       ){  pq_edmu_pr        [$1]=$3; continue };
#       if ($2~ /_ед_муж_род$/                      ){  pq_edmu_ro        [$1]=$3; continue };
#       if ($2~ /_ед_муж_тв$/                       ){  pq_edmu_tv        [$1]=$3; continue };
#       if ($2~ /_ед_муж_дат$/                      ){  pq_edmu_da        [$1]=$3; continue };
      if($2~ /_ед_ср_/ ){
       if ($2~ /_ед_ср_вин$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_вин$/          ){  pq2_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_вин$/          ){  pq2_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_вин$/              ){  pq2_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_вин$/              ){  pq2_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_вин$/              ){  pq2_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_вин$/              ){  pq2_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_вин$/        ){  pq2_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_вин$/        ){  pq2_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_вин$/              ){  pq2_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_вин$/              ){  pq2_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_вин$/         ){  pqn_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_вин$/         ){  pqn_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_вин$/             ){  pqn_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_вин$/             ){  pqn_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_вин$/             ){  pqn_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_вин$/             ){  pqn_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_вин$/       ){  pqn_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_вин$/       ){  pqn_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_вин$/             ){  pqn_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_вин$/             ){  pqn_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_вин$/           ){  pqs_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_вин$/               ){  pqs_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_вин$/               ){  pqs_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_вин$/         ){  pqs_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_вин$/               ){  pqs_pn_pa_ed_sr_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_дат$/          ){  pq2_ne_vz_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_дат$/          ){  pq2_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_дат$/              ){  pq2_ne_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_дат$/              ){  pq2_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_дат$/              ){  pq2_pe_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_дат$/              ){  pq2_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_дат$/        ){  pq2_pe_sd_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_дат$/        ){  pq2_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_дат$/              ){  pq2_pn_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_дат$/              ){  pq2_pn_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_дат$/         ){  pqn_ne_vz_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_дат$/         ){  pqn_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_дат$/             ){  pqn_ne_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_дат$/             ){  pqn_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_дат$/             ){  pqn_pe_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_дат$/             ){  pqn_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_дат$/       ){  pqn_pe_sd_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_дат$/       ){  pqn_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_дат$/             ){  pqn_pn_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_дат$/             ){  pqn_pn_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_дат$/           ){  pqs_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_дат$/               ){  pqs_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_дат$/               ){  pqs_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_дат$/         ){  pqs_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_дат$/               ){  pqs_pn_pa_ed_sr_da     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_им$/           ){  pq2_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_им$/           ){  pq2_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_им$/               ){  pq2_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_им$/               ){  pq2_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_им$/               ){  pq2_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_им$/               ){  pq2_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_им$/         ){  pq2_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_им$/         ){  pq2_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_им$/               ){  pq2_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_им$/               ){  pq2_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_им$/          ){  pqn_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_им$/          ){  pqn_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_им$/              ){  pqn_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_им$/              ){  pqn_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_им$/              ){  pqn_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_им$/              ){  pqn_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_им$/        ){  pqn_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_им$/        ){  pqn_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_им$/              ){  pqn_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_им$/              ){  pqn_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_им$/            ){  pqs_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_им$/                ){  pqs_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_им$/                ){  pqs_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_им$/          ){  pqs_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_им$/                ){  pqs_pn_pa_ed_sr_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_пр$/           ){  pq2_ne_vz_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_пр$/           ){  pq2_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_пр$/               ){  pq2_ne_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_пр$/               ){  pq2_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_пр$/               ){  pq2_pe_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_пр$/               ){  pq2_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_пр$/         ){  pq2_pe_sd_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_пр$/         ){  pq2_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_пр$/               ){  pq2_pn_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_пр$/               ){  pq2_pn_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_пр$/          ){  pqn_ne_vz_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_пр$/          ){  pqn_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_пр$/              ){  pqn_ne_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_пр$/              ){  pqn_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_пр$/              ){  pqn_pe_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_пр$/              ){  pqn_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_пр$/        ){  pqn_pe_sd_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_пр$/        ){  pqn_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_пр$/              ){  pqn_pn_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_пр$/              ){  pqn_pn_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_пр$/            ){  pqs_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_пр$/                ){  pqs_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_пр$/                ){  pqs_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_пр$/          ){  pqs_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_пр$/                ){  pqs_pn_pa_ed_sr_pr     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_род$/          ){  pq2_ne_vz_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_род$/          ){  pq2_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_род$/              ){  pq2_ne_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_род$/              ){  pq2_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_род$/              ){  pq2_pe_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_род$/              ){  pq2_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_род$/        ){  pq2_pe_sd_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_род$/        ){  pq2_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_род$/              ){  pq2_pn_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_род$/              ){  pq2_pn_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_род$/         ){  pqn_ne_vz_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_род$/         ){  pqn_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_род$/             ){  pqn_ne_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_род$/             ){  pqn_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_род$/             ){  pqn_pe_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_род$/             ){  pqn_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_род$/       ){  pqn_pe_sd_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_род$/       ){  pqn_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_род$/             ){  pqn_pn_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_род$/             ){  pqn_pn_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_род$/           ){  pqs_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_род$/               ){  pqs_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_род$/               ){  pqs_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_род$/         ){  pqs_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_род$/               ){  pqs_pn_pa_ed_sr_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_тв$/           ){  pq2_ne_vz_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_тв$/           ){  pq2_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_тв$/               ){  pq2_ne_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_тв$/               ){  pq2_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_тв$/               ){  pq2_pe_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_тв$/               ){  pq2_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_тв$/         ){  pq2_pe_sd_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_тв$/         ){  pq2_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_тв$/               ){  pq2_pn_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_тв$/               ){  pq2_pn_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_тв$/          ){  pqn_ne_vz_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_тв$/          ){  pqn_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_тв$/              ){  pqn_ne_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_тв$/              ){  pqn_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_тв$/              ){  pqn_pe_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_тв$/              ){  pqn_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_тв$/        ){  pqn_pe_sd_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_тв$/        ){  pqn_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_тв$/              ){  pqn_pn_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_тв$/              ){  pqn_pn_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_тв$/            ){  pqs_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_тв$/                ){  pqs_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_тв$/                ){  pqs_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_тв$/          ){  pqs_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_тв$/                ){  pqs_pn_pa_ed_sr_tv     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_ср_вин$/                       ){  pq_edsr_im        [$1]=$3; continue };
#       if ($2~ /_ед_ср_дат$/                       ){  pq_edsr_da        [$1]=$3; continue };
#       if ($2~ /_ед_ср_им$/                        ){  pq_edsr_im        [$1]=$3; continue };
#       if ($2~ /_ед_ср_пр$/                        ){  pq_edsr_pr        [$1]=$3; continue };
#       if ($2~ /_ед_ср_род$/                       ){  pq_edsr_ro        [$1]=$3; continue };
#       if ($2~ /_ед_ср_тв$/                        ){  pq_edsr_tv        [$1]=$3; continue };
      if($2~ /_мн_/ ){
       if ($2~ /_мн_вин_неод$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_вин_неод$/        ){  pq2_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_вин_неод$/        ){  pq2_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_вин_неод$/            ){  pq2_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_вин_неод$/            ){  pq2_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_вин_неод$/            ){  pq2_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_вин_неод$/            ){  pq2_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_вин_неод$/      ){  pq2_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_вин_неод$/      ){  pq2_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_вин_неод$/            ){  pq2_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_вин_неод$/            ){  pq2_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_вин_неод$/       ){  pqn_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_вин_неод$/       ){  pqn_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_вин_неод$/           ){  pqn_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_вин_неод$/           ){  pqn_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_вин_неод$/           ){  pqn_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_вин_неод$/           ){  pqn_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_вин_неод$/     ){  pqn_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_вин_неод$/     ){  pqn_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_вин_неод$/           ){  pqn_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_вин_неод$/           ){  pqn_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_вин_неод$/         ){  pqs_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_вин_неод$/             ){  pqs_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_вин_неод$/             ){  pqs_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_вин_неод$/       ){  pqs_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_вин_неод$/             ){  pqs_pn_pa_mn_im        [$1]=$3; continue };
       };
       if ($2~ /_мн_вин_одуш$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_вин_одуш$/        ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_вин_одуш$/        ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_вин_одуш$/            ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_вин_одуш$/            ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_вин_одуш$/            ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_вин_одуш$/            ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_вин_одуш$/      ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_вин_одуш$/      ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_вин_одуш$/            ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_вин_одуш$/            ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_вин_одуш$/       ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_вин_одуш$/       ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_вин_одуш$/           ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_вин_одуш$/           ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_вин_одуш$/           ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_вин_одуш$/           ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_вин_одуш$/     ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_вин_одуш$/     ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_вин_одуш$/           ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_вин_одуш$/           ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_вин_одуш$/         ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_вин_одуш$/             ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_вин_одуш$/             ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_вин_одуш$/       ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_вин_одуш$/             ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };
       if ($2~ /_мн_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_дат$/             ){  pq2_ne_vz_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_дат$/             ){  pq2_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_дат$/                 ){  pq2_ne_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_дат$/                 ){  pq2_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_дат$/                 ){  pq2_pe_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_дат$/                 ){  pq2_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_дат$/           ){  pq2_pe_sd_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_дат$/           ){  pq2_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_дат$/                 ){  pq2_pn_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_дат$/                 ){  pq2_pn_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_дат$/            ){  pqn_ne_vz_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_дат$/            ){  pqn_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_дат$/                ){  pqn_ne_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_дат$/                ){  pqn_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_дат$/                ){  pqn_pe_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_дат$/                ){  pqn_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_дат$/          ){  pqn_pe_sd_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_дат$/          ){  pqn_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_дат$/                ){  pqn_pn_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_дат$/                ){  pqn_pn_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_дат$/              ){  pqs_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_дат$/                  ){  pqs_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_дат$/                  ){  pqs_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_дат$/            ){  pqs_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_дат$/                  ){  pqs_pn_pa_mn_da        [$1]=$3; continue };
       };
       if ($2~ /_мн_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_им$/              ){  pq2_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_им$/              ){  pq2_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_им$/                  ){  pq2_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_им$/                  ){  pq2_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_им$/                  ){  pq2_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_им$/                  ){  pq2_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_им$/            ){  pq2_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_им$/            ){  pq2_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_им$/                  ){  pq2_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_им$/                  ){  pq2_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_им$/             ){  pqn_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_им$/             ){  pqn_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_им$/                 ){  pqn_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_им$/                 ){  pqn_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_им$/                 ){  pqn_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_им$/                 ){  pqn_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_им$/           ){  pqn_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_им$/           ){  pqn_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_им$/                 ){  pqn_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_им$/                 ){  pqn_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_им$/               ){  pqs_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_им$/                   ){  pqs_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_им$/                   ){  pqs_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_им$/             ){  pqs_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_им$/                   ){  pqs_pn_pa_mn_im        [$1]=$3; continue };
       };
       if ($2~ /_мн_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_пр$/              ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_пр$/              ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_пр$/                  ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_пр$/                  ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_пр$/                  ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_пр$/                  ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_пр$/            ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_пр$/            ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_пр$/                  ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_пр$/                  ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_пр$/             ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_пр$/             ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_пр$/                 ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_пр$/                 ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_пр$/                 ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_пр$/                 ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_пр$/           ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_пр$/           ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_пр$/                 ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_пр$/                 ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_пр$/               ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_пр$/                   ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_пр$/                   ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_пр$/             ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_пр$/                   ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };
       if ($2~ /_мн_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_род$/             ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_род$/             ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_род$/                 ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_род$/                 ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_род$/                 ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_род$/                 ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_род$/           ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_род$/           ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_род$/                 ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_род$/                 ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_род$/            ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_род$/            ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_род$/                ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_род$/                ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_род$/                ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_род$/                ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_род$/          ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_род$/          ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_род$/                ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_род$/                ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_род$/              ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_род$/                  ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_род$/                  ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_род$/            ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_род$/                  ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };
       if ($2~ /_мн_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_тв$/              ){  pq2_ne_vz_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_тв$/              ){  pq2_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_тв$/                  ){  pq2_ne_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_тв$/                  ){  pq2_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_тв$/                  ){  pq2_pe_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_тв$/                  ){  pq2_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_тв$/            ){  pq2_pe_sd_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_тв$/            ){  pq2_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_тв$/                  ){  pq2_pn_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_тв$/                  ){  pq2_pn_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_тв$/             ){  pqn_ne_vz_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_тв$/             ){  pqn_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_тв$/                 ){  pqn_ne_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_тв$/                 ){  pqn_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_тв$/                 ){  pqn_pe_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_тв$/                 ){  pqn_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_тв$/           ){  pqn_pe_sd_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_тв$/           ){  pqn_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_тв$/                 ){  pqn_pn_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_тв$/                 ){  pqn_pn_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_тв$/               ){  pqs_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_тв$/                   ){  pqs_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_тв$/                   ){  pqs_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_тв$/             ){  pqs_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_тв$/                   ){  pqs_pn_pa_mn_tv        [$1]=$3; continue };
       };
      };
#       if ($2~ /_мн_вин_неод$/                     ){  pq_mn_im          [$1]=$3; continue };
#       if ($2~ /_мн_вин_одуш$/                     ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_дат$/                          ){  pq_mn_da          [$1]=$3; continue };
#       if ($2~ /_мн_им$/                           ){  pq_mn_im          [$1]=$3; continue };
#       if ($2~ /_мн_пр$/                           ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_род$/                          ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_тв$/                           ){  pq_mn_tv          [$1]=$3; continue };
      if($2~  /^прч_крат_/ ){
       if ($2~ /_ед_жен$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_жен$/      ){  pq2_na_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_жен$/      ){  pq2_pa_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_жен$/     ){  pqn_na_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_жен$/     ){  pqn_pa_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_жен$/       ){  pqs_pa_kred_ze         [$1]=$3; continue };
       };
       if ($2~ /_ед_муж$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_муж$/      ){  pq2_na_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_муж$/      ){  pq2_pa_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_муж$/     ){  pqn_na_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_муж$/     ){  pqn_pa_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_муж$/       ){  pqs_pa_kred_mu         [$1]=$3; continue };
       };
       if ($2~ /_ед_ср$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_ср$/       ){  pq2_na_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_ср$/       ){  pq2_pa_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_ср$/      ){  pqn_na_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_ср$/      ){  pqn_pa_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_ср$/        ){  pqs_pa_kred_sr         [$1]=$3; continue };
       };
       if ($2~ /_мн$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_мн$/          ){  pq2_na_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_мн$/          ){  pq2_pa_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_мн$/         ){  pqn_na_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_мн$/         ){  pqn_pa_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_мн$/           ){  pqs_pa_krmn            [$1]=$3; continue };
       };
      };
     }; # чтение prq-dic
#       if ($2~ /_ед_жен$/                          ){  pq_kred_ze        [$1]=$3; continue };
#       if ($2~ /_ед_муж$/                          ){  pq_kred_mu        [$1]=$3; continue };
#       if ($2~ /_ед_ср$/                           ){  pq_kred_sr        [$1]=$3; continue };
#       if ($2~ /_мн$/                              ){  pq_krmn           [$1]=$3; continue };
   close(cmd);
   cmd = "zcat " indb "dic_prl.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };

      if($2~  /^прл_ед_жен_/ ){
        if ($2~ /^прл_ед_жен_тв$/ && $1~ /[ео]ю$/   ){  pl_edze_tv        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_тв$/ && $1~ /[ео]й$/   ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_вин$/                  ){  pl_edze_vi        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_дат$/                  ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_им$/                   ){  pl_edze_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_пр$/                   ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_род$/                  ){  pl_edze_dr        [$1]=$3; continue };
      };
      if($2~  /^прл_ед_муж_/ ){
        if ($2~ /^прл_ед_муж_вин_неод$/             ){  pl_edmu_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_вин_одуш$/             ){  pl_edmu_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_дат$/                  ){  pl_edmu_da        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_им$/                   ){  pl_edmu_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_пр$/                   ){  pl_edmu_pr        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_род$/                  ){  pl_edmu_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_тв$/                   ){  pl_edmu_tv        [$1]=$3; continue };
      };
      if($2~  /^прл_ед_ср_/ ){
        if ($2~ /^прл_ед_ср_вин$/                   ){  pl_edsr_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_дат$/                   ){  pl_edsr_da        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_им$/                    ){  pl_edsr_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_пр$/                    ){  pl_edsr_pr        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_род$/                   ){  pl_edsr_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_тв$/                    ){  pl_edsr_tv        [$1]=$3; continue };
      };
      if($2~  /^прл_мн_/ ){
        if ($2~ /^прл_мн_вин_неод$/                 ){  pl_mn_im          [$1]=$3; continue };
        if ($2~ /^прл_мн_вин_одуш$/                 ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_дат$/                      ){  pl_mn_da          [$1]=$3; continue };
        if ($2~ /^прл_мн_им$/                       ){  pl_mn_im          [$1]=$3; continue };
        if ($2~ /^прл_мн_пр$/                       ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_род$/                      ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_тв$/                       ){  pl_mn_tv          [$1]=$3; continue };
      };
        if ($2~ /^прл_сравн$/                       ){  pl_srv            [$1]=$3; continue };
      if($2~  /^прл_крат_/ ){
        if ($2~ /^прл_крат_ед_муж$/                 ){  pl_kred_mu        [$1]=$3; continue };
        if ($2~ /^прл_крат_ед_жен$/                 ){  pl_kred_ze        [$1]=$3; continue };
        if ($2~ /^прл_крат_ед_ср$/                  ){  pl_kred_sr        [$1]=$3; continue };
        if ($2~ /^прл_крат_мн$/                     ){  pl_krmn           [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_жен_/ ){
        if ($2~ /^прл_прев_ед_жен_тв$/ &&$1~/[ео]ю$/){  pl_pv_edze_tv     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_тв$/ &&$1~/[ео]й$/){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_вин$/             ){  pl_pv_edze_vi     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_дат$/             ){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_им$/              ){  pl_pv_edze_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_пр$/              ){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_род$/             ){  pl_pv_edze_dr     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_муж_/ ){
        if ($2~ /^прл_прев_ед_муж_вин_неод$/        ){  pl_pv_edmu_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_вин_одуш$/        ){  pl_pv_edmu_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_дат$/             ){  pl_pv_edmu_da     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_им$/              ){  pl_pv_edmu_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_пр$/              ){  pl_pv_edmu_pr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_род$/             ){  pl_pv_edmu_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_тв$/              ){  pl_pv_edmu_tv     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_ср_/ ){
        if ($2~ /^прл_прев_ед_ср_вин$/              ){  pl_pv_edsr_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_дат$/              ){  pl_pv_edsr_da     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_им$/               ){  pl_pv_edsr_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_пр$/               ){  pl_pv_edsr_pr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_род$/              ){  pl_pv_edsr_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_тв$/               ){  pl_pv_edsr_tv     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_мн_/ ){
        if ($2~ /^прл_прев_мн_вин_неод$/            ){  pl_pv_mn_im       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_вин_одуш$/            ){  pl_pv_mn_ro       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_дат$/                 ){  pl_pv_mn_da       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_им$/                  ){  pl_pv_mn_im       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_пр$/                  ){  pl_pv_mn_pr       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_род$/                 ){  pl_pv_mn_ro       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_тв$/                  ){  pl_pv_mn_tv       [$1]=$3; continue };
      };
        if ($2~ /^прл_неизм$/                       ){  pl_neiz           [$1]=$3; continue };
    }; # чтение prl-dic
   close(cmd);
   cmd = "zcat " indb "dic_suw.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };

      if ($2~ /^сущ_неод_/ ) {
       if ($2~ /^сущ_неод_мн_/ ) {
        if ($2~ /^сущ_неод_мн_вин$/                 ){  swn_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_дат$/                 ){  swn_mn_da         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_им$/                  ){  swn_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_пр$/                  ){  swn_mn_pr         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_род$/                 ){  swn_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_тв$/                  ){  swn_mn_tv         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_нескл$/               ){  swn_mn_ne         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_счет$/                ){  swn_mn_sq         [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_жен_/ ) {
        if ($2~ /^сущ_неод_ед_жен_тв$/              ){  swn_edze_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_вин$/             ){  swn_edze_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_дат$/             ){  swn_edze_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_им$/              ){  swn_edze_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_пр$/              ){  swn_edze_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_род$/             ){  swn_edze_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_нескл$/           ){  swn_edze_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_мест$/            ){  swn_edze_me       [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_муж_/ ) {
        if ($2~ /^сущ_неод_ед_муж_вин$/             ){  swn_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_дат$/             ){  swn_edmu_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_им$/              ){  swn_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_пр$/              ){  swn_edmu_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_род$/             ){  swn_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_тв$/              ){  swn_edmu_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_нескл$/           ){  swn_edmu_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_мест$/            ){  swn_edmu_me       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_парт$/            ){  swn_edmu_pt       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_счет$/            ){  swn_edmu_sq       [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_ср_/ ) {
        if ($2~ /^сущ_неод_ед_ср_вин$/              ){  swn_edsr_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_дат$/              ){  swn_edsr_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_им$/               ){  swn_edsr_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_пр$/               ){  swn_edsr_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_род$/              ){  swn_edsr_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_тв$/               ){  swn_edsr_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_нескл$/            ){  swn_edsr_ne       [$1]=$3; continue };
       };
        if ($2~ /^сущ_неод_ед_общ_вин$/             ){  swn_edob_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_дат$/             ){  swn_edob_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_им$/              ){  swn_edob_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_нескл$/           ){  swn_edob_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_пр$/              ){  swn_edob_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_род$/             ){  swn_edob_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_тв$/              ){  swn_edob_tv       [$1]=$3; continue };
      };
      if ($2~ /^сущ_одуш_/ ) {
       if ($2~ /^сущ_одуш_мн_/ ) {
        if ($2~ /^сущ_одуш_мн_вин$/                 ){  swo_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_дат$/                 ){  swo_mn_da         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_им$/                  ){  swo_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_пр$/                  ){  swo_mn_pr         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_род$/                 ){  swo_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_тв$/                  ){  swo_mn_tv         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_нескл$/               ){  swo_mn_ne         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_счет$/                ){  swo_mn_sq         [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_муж_/ ) {
        if ($2~ /^сущ_одуш_ед_муж_вин$/             ){  swo_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_дат$/             ){  swo_edmu_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_им$/              ){  swo_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_пр$/              ){  swo_edmu_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_род$/             ){  swo_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_тв$/              ){  swo_edmu_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_нескл$/           ){  swo_edmu_ne       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_зват$/            ){  swo_edmu_zv       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_жен_/ ) {
        if ($2~ /^сущ_одуш_ед_жен_тв$/              ){  swo_edze_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_вин$/             ){  swo_edze_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_дат$/             ){  swo_edze_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_им$/              ){  swo_edze_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_пр$/              ){  swo_edze_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_род$/             ){  swo_edze_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_нескл$/           ){  swo_edze_ne       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_зват$/            ){  swo_edze_zv       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_общ_/ ) {
        if ($2~ /^сущ_одуш_ед_общ_тв$/              ){  swo_edob_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_вин$/             ){  swo_edob_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_дат$/             ){  swo_edob_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_им$/              ){  swo_edob_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_пр$/              ){  swo_edob_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_род$/             ){  swo_edob_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_нескл$/           ){  swo_edob_ne       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_ср_/ ) {
        if ($2~ /^сущ_одуш_ед_ср_вин$/              ){  swo_edsr_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_дат$/              ){  swo_edsr_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_им$/               ){  swo_edsr_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_пр$/               ){  swo_edsr_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_род$/              ){  swo_edsr_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_тв$/               ){  swo_edsr_tv       [$1]=$3; continue };
       };
      };
      if ($2~ /^сущ_мн_/ ) {
        if ($2~ /^сущ_мн_дат$/                      ){  sw_mn_da          [$1]=$3; continue };
        if ($2~ /^сущ_мн_им$/                       ){  sw_mn_im          [$1]=$3; continue };
        if ($2~ /^сущ_мн_пр$/                       ){  sw_mn_pr          [$1]=$3; continue };
        if ($2~ /^сущ_мн_род$/                      ){  sw_mn_ro          [$1]=$3; continue };
        if ($2~ /^сущ_мн_тв$/                       ){  sw_mn_tv          [$1]=$3; continue };
        if ($2~ /^сущ_мн_вин$/                      ){  sw_mn_vi          [$1]=$3; continue };
        if ($2~ /^сущ_мн_нескл$/                    ){  sw_mn_ne          [$1]=$3; continue };
      };
      if ($2~ /^сущ_ед_жен_/ ) {
        if ($2~ /^сущ_ед_жен_тв$/                   ){  sw_edze_tv        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_вин$/                  ){  sw_edze_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_дат$/                  ){  sw_edze_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_им$/                   ){  sw_edze_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_пр$/                   ){  sw_edze_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_род$/                  ){  sw_edze_ro        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_муж_/ ) {
        if ($2~ /^сущ_ед_муж_дат$/                  ){  sw_edmu_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_им$/                   ){  sw_edmu_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_пр$/                   ){  sw_edmu_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_род$/                  ){  sw_edmu_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_тв$/                   ){  sw_edmu_tv        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_вин$/                  ){  sw_edmu_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_нескл$/                ){  sw_edmu_ne        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_общ_/ ) {
        if ($2~ /^сущ_ед_общ_нескл$/                ){  sw_edob_ne        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_вин$/                  ){  sw_edob_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_дат$/                  ){  sw_edob_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_им$/                   ){  sw_edob_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_пр$/                   ){  sw_edob_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_род$/                  ){  sw_edob_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_тв$/                   ){  sw_edob_tv        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_ср_/ ) {
        if ($2~ /^сущ_ед_ср_вин$/                   ){  sw_edsr_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_дат$/                   ){  sw_edsr_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_им$/                    ){  sw_edsr_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_пр$/                    ){  sw_edsr_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_род$/                   ){  sw_edsr_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_тв$/                    ){  sw_edsr_tv        [$1]=$3; continue };
      };
    }; # чтение suw-dic
   close(cmd);
   cmd = "zcat " indb "dic_gl.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };

         # md_gl для глаголов с признаками модальности
         if ($2 ~ /_прош_ед_ср$/                ) {split($3,itmz,"#"); for (j in itmz) { if (itmz[j] && itmz[j] in md_gl) { md_bz[$1]=$3 };};};
         if ($2 ~ /_ед/ && $2 !~ /_прош_ед_ср$/ ) {split($3,itmz,"#"); for (j in itmz) { if (itmz[j] && itmz[j] in md_gl) { md_ed[$1]=$3 };};};
         if ($2 ~ /_мн/                         ) {split($3,itmz,"#"); for (j in itmz) { if (itmz[j] && itmz[j] in md_gl) { md_mn[$1]=$3 };};}; 

      if($2~  /^гл_несов_непер_/ ){

        if ($2~ /^гл_несов_непер_воз_инф$/          ){  gn_vz_ne_in       [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_воз_наст_/ ) {
        if ($2~ /^гл_несов_непер_воз_наст_ед_1е$/   ){  gn_vz_nena_e1     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_ед_2е$/   ){  gn_vz_nena_e2     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_ед_3е$/   ){  gn_vz_nena_e3     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_1е$/   ){  gn_vz_nena_m1     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_2е$/   ){  gn_vz_nena_m2     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_3е$/   ){  gn_vz_nena_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_воз_пов_ед$/       ){  gn_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_пов_мн$/       ){  gn_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_воз_прош_/ ) {
        if ($2~ /^гл_несов_непер_воз_прош_ед_жен$/  ){  gn_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_ед_муж$/  ){  gn_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_ед_ср$/   ){  gn_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_мн$/      ){  gn_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_инф$/              ){  gn_nein           [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_наст_/ ) {
        if ($2~ /^гл_несов_непер_наст_ед_1е$/       ){  gn_nena_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_ед_2е$/       ){  gn_nena_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_ед_3е$/       ){  gn_nena_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_1е$/       ){  gn_nena_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_2е$/       ){  gn_nena_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_3е$/       ){  gn_nena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_пов_ед$/           ){  gn_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_пов_мн$/           ){  gn_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_прош_/ ) {
        if ($2~ /^гл_несов_непер_прош_ед_жен$/      ){  gn_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_ед_муж$/      ){  gn_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_ед_ср$/       ){  gn_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_мн$/          ){  gn_nepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_инф_безл$/         ){  gn_nein_bz        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_инф_безл$/     ){  gn_vz_nein_bz     [$1]=$3; continue };

      };
      if($2~  /^гл_несов_перех_/ ){

        if ($2~ /^гл_несов_перех_инф$/              ){  gn_pein           [$1]=$3; continue };

       if ($2~ /^гл_несов_перех_наст_/ ) {
        if ($2~ /^гл_несов_перех_наст_ед_1е$/       ){  gn_pena_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_ед_2е$/       ){  gn_pena_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_ед_3е$/       ){  gn_pena_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_1е$/       ){  gn_pena_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_2е$/       ){  gn_pena_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_3е$/       ){  gn_pena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перех_пов_ед$/           ){  gn_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_пов_мн$/           ){  gn_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_перех_прош_/ ) {
        if ($2~ /^гл_несов_перех_прош_ед_жен$/      ){  gn_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_ед_муж$/      ){  gn_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_ед_ср$/       ){  gn_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_мн$/          ){  gn_pepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перех_инф_безл$/         ){  gn_pein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_несов_перне_/ ){

        if ($2~ /^гл_несов_перне_инф$/              ){  gn_pnin           [$1]=$3; continue };

       if ($2~ /^гл_несов_перне_наст_/ ) {
        if ($2~ /^гл_несов_перне_наст_ед_1е$/       ){  gn_pnna_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_ед_2е$/       ){  gn_pnna_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_ед_3е$/       ){  gn_pnna_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_1е$/       ){  gn_pnna_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_2е$/       ){  gn_pnna_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_3е$/       ){  gn_pnna_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перне_пов_ед$/           ){  gn_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_пов_мн$/           ){  gn_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_перне_прош_/ ) {
        if ($2~ /^гл_несов_перне_прош_ед_жен$/      ){  gn_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_ед_муж$/      ){  gn_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_ед_ср$/       ){  gn_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_мн$/          ){  gn_pnpa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_сов_непер_/ ){
       if ($2~ /^гл_сов_непер_буд_/ ) {
        if ($2~ /^гл_сов_непер_буд_ед_1е$/          ){  gs_nebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_ед_2е$/          ){  gs_nebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_ед_3е$/          ){  gs_nebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_1е$/          ){  gs_nebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_2е$/          ){  gs_nebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_3е$/          ){  gs_nebu_m3        [$1]=$3; continue };
       };
       if ($2~ /^гл_сов_непер_воз_буд_/ ) {
        if ($2~ /^гл_сов_непер_воз_буд_ед_1е$/      ){  gs_vz_nebu_e1     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_ед_2е$/      ){  gs_vz_nebu_e2     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_ед_3е$/      ){  gs_vz_nebu_e3     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_1е$/      ){  gs_vz_nebu_m1     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_2е$/      ){  gs_vz_nebu_m2     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_3е$/      ){  gs_vz_nebu_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_воз_инф$/            ){  gs_vz_nein        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_пов_ед$/         ){  gs_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_пов_мн$/         ){  gs_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_сов_непер_воз_прош_/ ) {
        if ($2~ /^гл_сов_непер_воз_прош_ед_жен$/    ){  gs_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_ед_муж$/    ){  gs_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_ед_ср$/     ){  gs_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_мн$/        ){  gs_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_инф$/                ){  gs_nein           [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_пов_ед$/             ){  gs_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_пов_мн$/             ){  gs_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_непер_прош_/ ) {
        if ($2~ /^гл_сов_непер_прош_ед_жен$/        ){  gs_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_ед_муж$/        ){  gs_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_ед_ср$/         ){  gs_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_мн$/            ){  gs_nepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_воз_инф_безл$/       ){  gs_vz_nein_bz     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_инф_безл$/           ){  gs_nein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_сов_перех_/ ){
       if ($2~ /^гл_сов_перех_буд_/ ) {
        if ($2~ /^гл_сов_перех_буд_ед_1е$/          ){  gs_pebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_ед_2е$/          ){  gs_pebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_ед_3е$/          ){  gs_pebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_1е$/          ){  gs_pebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_2е$/          ){  gs_pebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_3е$/          ){  gs_pebu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перех_инф$/                ){  gs_pein           [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_пов_ед$/             ){  gs_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_пов_мн$/             ){  gs_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_перех_прош_/ ) {
        if ($2~ /^гл_сов_перех_прош_ед_жен$/        ){  gs_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_ед_муж$/        ){  gs_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_ед_ср$/         ){  gs_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_мн$/            ){  gs_pepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перех_инф_безл$/           ){  gs_pein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_сов_перне_/ ){
       if ($2~ /^гл_сов_перне_буд_/ ) {
        if ($2~ /^гл_сов_перне_буд_ед_1е$/          ){  gs_pnbu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_ед_2е$/          ){  gs_pnbu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_ед_3е$/          ){  gs_pnbu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_1е$/          ){  gs_pnbu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_2е$/          ){  gs_pnbu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_3е$/          ){  gs_pnbu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перне_инф$/                ){  gs_pnin           [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_пов_ед$/             ){  gs_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_пов_мн$/             ){  gs_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_перне_прош_/ ) {
        if ($2~ /^гл_сов_перне_прош_ед_жен$/        ){  gs_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_ед_муж$/        ){  gs_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_ед_ср$/         ){  gs_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_мн$/            ){  gs_pnpa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_перех_/ ){
       if ($2~ /^гл_2вид_перех_буд_/ ) {
        if ($2~ /^гл_2вид_перех_буд_ед_1е$/         ){  g2_pebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_ед_2е$/         ){  g2_pebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_ед_3е$/         ){  g2_pebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_1е$/         ){  g2_pebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_2е$/         ){  g2_pebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_3е$/         ){  g2_pebu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перех_инф$/               ){  g2_pein           [$1]=$3; continue };

       if ($2~ /^гл_2вид_перех_наст_/ ) {
        if ($2~ /^гл_2вид_перех_наст_ед_1е$/        ){  g2_pena_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_ед_2е$/        ){  g2_pena_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_ед_3е$/        ){  g2_pena_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_1е$/        ){  g2_pena_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_2е$/        ){  g2_pena_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_3е$/        ){  g2_pena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перех_пов_ед$/            ){  g2_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_пов_мн$/            ){  g2_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_перех_прош_/ ) {
        if ($2~ /^гл_2вид_перех_прош_ед_жен$/       ){  g2_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_ед_муж$/       ){  g2_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_ед_ср$/        ){  g2_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_мн$/           ){  g2_pepa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_непер_/ ){
       if ($2~ /^гл_2вид_непер_буд_/ ) {
        if ($2~ /^гл_2вид_непер_буд_ед_1е$/         ){  g2_nebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_ед_2е$/         ){  g2_nebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_ед_3е$/         ){  g2_nebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_1е$/         ){  g2_nebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_2е$/         ){  g2_nebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_3е$/         ){  g2_nebu_m3        [$1]=$3; continue };
       };
       if ($2~ /^гл_2вид_непер_воз_буд_/ ) {
        if ($2~ /^гл_2вид_непер_воз_буд_ед_1е$/     ){  g2_vz_nebu_e1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_ед_2е$/     ){  g2_vz_nebu_e2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_ед_3е$/     ){  g2_vz_nebu_e3     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_1е$/     ){  g2_vz_nebu_m1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_2е$/     ){  g2_vz_nebu_m2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_3е$/     ){  g2_vz_nebu_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_воз_инф$/           ){  g2_vz_nein        [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_воз_наст_/ ) {
        if ($2~ /^гл_2вид_непер_воз_наст_ед_1е$/    ){  g2_vz_nena_e1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_ед_2е$/    ){  g2_vz_nena_e2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_ед_3е$/    ){  g2_vz_nena_e3     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_1е$/    ){  g2_vz_nena_m1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_2е$/    ){  g2_vz_nena_m2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_3е$/    ){  g2_vz_nena_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_воз_пов_ед$/        ){  g2_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_пов_мн$/        ){  g2_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_воз_прош_/ ) {
        if ($2~ /^гл_2вид_непер_воз_прош_ед_жен$/   ){  g2_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_ед_муж$/   ){  g2_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_ед_ср$/    ){  g2_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_мн$/       ){  g2_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_инф$/               ){  g2_nein           [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_наст_/ ) {
        if ($2~ /^гл_2вид_непер_наст_ед_1е$/        ){  g2_nena_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_ед_2е$/        ){  g2_nena_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_ед_3е$/        ){  g2_nena_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_1е$/        ){  g2_nena_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_2е$/        ){  g2_nena_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_3е$/        ){  g2_nena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_пов_ед$/            ){  g2_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_пов_мн$/            ){  g2_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_прош_/ ) {
        if ($2~ /^гл_2вид_непер_прош_ед_жен$/       ){  g2_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_ед_муж$/       ){  g2_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_ед_ср$/        ){  g2_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_мн$/           ){  g2_nepa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_перне_/ ){
       if ($2~ /^гл_2вид_перне_буд_/ ) {
        if ($2~ /^гл_2вид_перне_буд_ед_1е$/         ){  g2_pnbu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_ед_2е$/         ){  g2_pnbu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_ед_3е$/         ){  g2_pnbu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_1е$/         ){  g2_pnbu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_2е$/         ){  g2_pnbu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_3е$/         ){  g2_pnbu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перне_инф$/               ){  g2_pnin           [$1]=$3; continue };

       if ($2~ /^гл_2вид_перне_наст_/ ) {
        if ($2~ /^гл_2вид_перне_наст_ед_1е$/        ){  g2_pnna_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_ед_2е$/        ){  g2_pnna_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_ед_3е$/        ){  g2_pnna_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_1е$/        ){  g2_pnna_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_2е$/        ){  g2_pnna_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_3е$/        ){  g2_pnna_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перне_пов_ед$/            ){  g2_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_пов_мн$/            ){  g2_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_перне_прош_/ ) {
        if ($2~ /^гл_2вид_перне_прош_ед_жен$/       ){  g2_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_ед_муж$/       ){  g2_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_ед_ср$/        ){  g2_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_мн$/           ){  g2_pnpa_mn        [$1]=$3; continue };
       };
      };
       if ($2~  /^дееп_/ ){
        if ($2~ /^дееп_сов_перех_прош$/             ){  dps_pe_pa         [$1]=$3; continue };
        if ($2~ /^дееп_сов_непер_воз_прош$/         ){  dps_vz_ne_pa      [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_воз_наст$/       ){  dpn_vz_ne_na      [$1]=$3; continue };
        if ($2~ /^дееп_несов_перех_наст$/           ){  dpn_pe_na         [$1]=$3; continue };
        if ($2~ /^дееп_сов_непер_прош$/             ){  dps_ne_pa         [$1]=$3; continue };
        if ($2~ /^дееп_сов_перне_прош$/             ){  dps_pn_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_наст$/           ){  dpn_ne_na         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перне_наст$/           ){  dpn_pn_na         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перех_прош$/           ){  dpn_pe_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перне_прош$/           ){  dpn_pn_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_прош$/           ){  dpn_ne_pa         [$1]=$3; continue };
       };
    }; # чтение gl-dic

   close(cmd);
   cmd = "zcat " indb "dic_rest.gz";
   while ((cmd|getline) > 0) {

    if ($1~  "-"  ) { dichyph[$1] };
    if ($4== "NOP") { continue };

    if($2~  /^нар/ ){
        if ($2~ /^нар_сравн$/                       ){  nr_srv            [$1]=$3; continue };
        if ($2~ /^нар_опред_кач$/                   ){  nr_opka           [$1]=$3; continue };
        if ($2~ /^нар_опред_спос$/                  ){  nr_opsp           [$1]=$3; continue };
        if ($2~ /^нар_опред_степ$/                  ){  nr_opst           [$1]=$3; continue };
        if ($2~ /^нар_обст_врем$/                   ){  nr_obvr           [$1]=$3; continue };
        if ($2~ /^нар_обст_места$/                  ){  nr_obme           [$1]=$3; continue };
        if ($2~ /^нар_обст_напр$/                   ){  nr_obna           [$1]=$3; continue };
        if ($2~ /^нар_обст_причин$/                 ){  nr_obpr           [$1]=$3; continue };
        if ($2~ /^нар_обст_цель$/                   ){  nr_obce           [$1]=$3; continue };
        if ($2~ /^нар_вопр$/                        ){  nr_vopr           [$1]=$3; continue };
        if ($2~ /^нар_мест$/                        ){  nr_mest           [$1]=$3; continue };
        if ($2~ /^нар_прев$/                        ){  nr_pv             [$1]=$3; continue };
        if ($2~ /^нар$/                             ){  nr_nar            [$1]=$3; continue };
    };

        if ($2~ /^предик$/                          ){  predk             [$1]=$3; continue };
        if ($2~ /^межд$/                            ){  mzd               [$1]=$3; continue };
        if ($2~ /^част$/                            ){  qst               [$1]=$3; continue };
        if ($2~ /^ввод$/                            ){  vvodn             [$1]=$3; continue };
        if ($2~ /^союз$/                            ){  soyz              [$1]=$3; continue };

    if($2~  /^мест_/ ){
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин$/       ){  mst_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин_неод$/  ){  mst_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин_одуш$/  ){  mst_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_дат$/       ){  mst_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_им$/        ){  mst_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_пр$/        ){  mst_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_род$/       ){  mst_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_тв$/        ){  mst_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_вин$/       ){  mst_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_дат$/       ){  mst_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_им$/        ){  mst_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_пр$/        ){  mst_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_род$/       ){  mst_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_тв$/        ){  mst_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_вин$/        ){  mst_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_дат$/        ){  mst_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_им$/         ){  mst_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_пр$/         ){  mst_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_род$/        ){  mst_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_тв$/         ){  mst_ed_sr_tv      [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_мн_вин_неод$/      ){  mst_mn_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_вин_одуш$/      ){  mst_mn_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_вин$/           ){  mst_mn_vi         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_дат$/           ){  mst_mn_da         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_им$/            ){  mst_mn_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_пр$/            ){  mst_mn_pr         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_род$/           ){  mst_mn_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_тв$/            ){  mst_mn_tv         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_ед_вин$/           ){  mst_ed_vi         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_им$/            ){  mst_ed_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_дат$/           ){  mst_ed_da         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_пр$/            ){  mst_ed_pr         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_род$/           ){  mst_ed_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_тв$/            ){  mst_ed_tv         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_ед_муж$/           ){  mst_ed_mu         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен$/           ){  mst_ed_ze         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_им$/               ){  mst_im            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_вин$/              ){  mst_vi            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_дат$/              ){  mst_da            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_пр$/               ){  mst_pr            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_род$/              ){  mst_ro            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_тв$/               ){  mst_tv            [$1]=$3; continue };
        if ($2~ /^мест_прл_мн$/                     ){  mst_mn            [$1]=$3; continue };

        if ($2~ /^мест_сущ$/                        ){  mst_suw           [$1]=$3; continue };
        if ($2~ /^мест_прл_ед_ср$/                  ){  mst_ed_sr         [$1]=$3; continue };
    };
    if($2~  /^предл_/ ){
        if ($2~ /^предл_вин$/                       ){  pred_vi           [$1]=$3; continue };
        if ($2~ /^предл_дат$/                       ){  pred_da           [$1]=$3; continue };
        if ($2~ /^предл_им$/                        ){  pred_im           [$1]=$3; continue };
        if ($2~ /^предл_пр$/                        ){  pred_pr           [$1]=$3; continue };
        if ($2~ /^предл_род$/                       ){  pred_ro           [$1]=$3; continue };
        if ($2~ /^предл_тв$/                        ){  pred_tv           [$1]=$3; continue };
    };
    if ($2~ /^числ_/ ) {                                qall              [$1]=$3;
      if ($2~ /^числ_кол_/ ) {
        if ($2~ /^числ_кол_вин$/                    ){  qko_vi            [$1]=$3; continue };
        if ($2~ /^числ_кол_дат$/                    ){  qko_da            [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_вин$/             ){  qko_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_дат$/             ){  qko_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_им$/              ){  qko_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_пр$/              ){  qko_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_род$/             ){  qko_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_тв$/              ){  qko_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_вин$/             ){  qko_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_дат$/             ){  qko_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_им$/              ){  qko_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_пр$/              ){  qko_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_род$/             ){  qko_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_тв$/              ){  qko_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_вин$/              ){  qko_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_дат$/              ){  qko_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_им$/               ){  qko_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_пр$/               ){  qko_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_род$/              ){  qko_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_тв$/               ){  qko_ed_sr_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_жен_вин$/                ){  qko_ze_vi         [$1]=$3; continue };
        if ($2~ /^числ_кол_жен_им$/                 ){  qko_ze_im         [$1]=$3; continue };
        if ($2~ /^числ_кол_им$/                     ){  qko_im            [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_вин$/                 ){  qko_mn_vi         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_дат$/                 ){  qko_mn_da         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_им$/                  ){  qko_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_пр$/                  ){  qko_mn_pr         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_род$/                 ){  qko_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_тв$/                  ){  qko_mn_tv         [$1]=$3; continue };
        if ($2~ /^числ_кол_пр$/                     ){  qko_pr            [$1]=$3; continue };
        if ($2~ /^числ_кол_род$/                    ){  qko_ro            [$1]=$3; continue };
        if ($2~ /^числ_кол_тв$/                     ){  qko_tv            [$1]=$3; continue };
      };
      if ($2~ /^числ_неопр_/ ) {

        if ($2~ /^числ_неопр_вин$/                  ){  qne_vi            [$1]=$3; continue };
        if ($2~ /^числ_неопр_дат$/                  ){  qne_da            [$1]=$3; continue };
        if ($2~ /^числ_неопр_им$/                   ){  qne_im            [$1]=$3; continue };
        if ($2~ /^числ_неопр_пр$/                   ){  qne_pr            [$1]=$3; continue };
        if ($2~ /^числ_неопр_род$/                  ){  qne_ro            [$1]=$3; continue };
        if ($2~ /^числ_неопр_тв$/                   ){  qne_tv            [$1]=$3; continue };
      };
      if ($2~ /^числ_поряд_/ ) {

        if ($2~ /^числ_поряд_ед_жен_вин$/           ){  qpo_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_дат$/           ){  qpo_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_им$/            ){  qpo_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_пр$/            ){  qpo_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_род$/           ){  qpo_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_тв$/            ){  qpo_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_вин_неод$/      ){  qpo_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_вин_одуш$/      ){  qpo_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_дат$/           ){  qpo_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_им$/            ){  qpo_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_пр$/            ){  qpo_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_род$/           ){  qpo_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_тв$/            ){  qpo_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_вин$/            ){  qpo_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_дат$/            ){  qpo_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_им$/             ){  qpo_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_пр$/             ){  qpo_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_род$/            ){  qpo_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_тв$/             ){  qpo_ed_sr_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_вин_неод$/          ){  qpo_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_вин_одуш$/          ){  qpo_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_дат$/               ){  qpo_mn_da         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_им$/                ){  qpo_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_пр$/                ){  qpo_mn_pr         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_род$/               ){  qpo_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_тв$/                ){  qpo_mn_tv         [$1]=$3; continue };
      };
      if ($2~ /^числ_собир_/ ) {

        if ($2~ /^числ_собир_вин$/                  ){  qso_vi            [$1]=$3; continue };
        if ($2~ /^числ_собир_дат$/                  ){  qso_da            [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_вин$/              ){  qso_ze_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_дат$/              ){  qso_ze_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_им$/               ){  qso_ze_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_пр$/               ){  qso_ze_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_род$/              ){  qso_ze_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_тв$/               ){  qso_ze_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_им$/                   ){  qso_im            [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_вин$/              ){  qso_mu_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_дат$/              ){  qso_mu_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_им$/               ){  qso_mu_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_пр$/               ){  qso_mu_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_род$/              ){  qso_mu_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_тв$/               ){  qso_mu_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_пр$/                   ){  qso_pr            [$1]=$3; continue };
        if ($2~ /^числ_собир_род$/                  ){  qso_ro            [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_вин$/               ){  qso_sr_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_дат$/               ){  qso_sr_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_им$/                ){  qso_sr_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_пр$/                ){  qso_sr_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_род$/               ){  qso_sr_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_тв$/                ){  qso_sr_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_тв$/                   ){  qso_tv            [$1]=$3; continue };
      };
    };
   }; # чтение rest-dic
   close(cmd);
   cmd = "zcat " indb "dic_cust.gz";
   while ((cmd|getline) > 0) {

   if ($1~  "-"  ) { dichyph[$1] };
   if ($4== "NOP") { continue };

   if ($2~ /^muk_/) {
        if($2~  /_ед_муж_им$/                       ){  muc_edmuim        [$1]=$3; continue };
        if($2~  /_ед_жен_им$/                       ){  muc_edzeim        [$1]=$3; continue };
        if($2~  /_ед_ср_им$/                        ){  muc_edsrim        [$1]=$3; continue };
        if($2~  /_ед_муж_вин/                       ){  muc_edmuvi        [$1]=$3; continue };
        if($2~  /_ед_жен_вин/                       ){  muc_edzevi        [$1]=$3; continue };
        if($2~  /_ед_ср_вин/                        ){  muc_edsrvi        [$1]=$3; continue };
        if($2~  /_ед_муж_дат$/                      ){  muc_edmuda        [$1]=$3; continue };
        if($2~  /_ед_жен_дат$/                      ){  muc_edzeda        [$1]=$3; continue };
        if($2~  /_ед_ср_дат$/                       ){  muc_edsrda        [$1]=$3; continue };
        if($2~  /_ед_муж_род$/                      ){  muc_edmuro        [$1]=$3; continue };
        if($2~  /_ед_жен_род$/                      ){  muc_edzero        [$1]=$3; continue };
        if($2~  /_ед_ср_род$/                       ){  muc_edsrro        [$1]=$3; continue };
        if($2~  /_ед_муж_тв$/                       ){  muc_edmutv        [$1]=$3; continue };
        if($2~  /_ед_жен_тв$/                       ){  muc_edzetv        [$1]=$3; continue };
        if($2~  /_ед_ср_тв$/                        ){  muc_edsrtv        [$1]=$3; continue };
        if($2~  /_ед_муж_пр$/                       ){  muc_edmupr        [$1]=$3; continue };
        if($2~  /_ед_жен_пр$/                       ){  muc_edzepr        [$1]=$3; continue };
        if($2~  /_ед_ср_пр$/                        ){  muc_edsrpr        [$1]=$3; continue };
        if($2~  /_мн_им$/                           ){  muc_mnim          [$1]=$3; continue };
        if($2~  /_мн_вин/                           ){  muc_mnvi          [$1]=$3; continue };
        if($2~  /_мн_дат$/                          ){  muc_mnda          [$1]=$3; continue };
        if($2~  /_мн_род$/                          ){  muc_mnro          [$1]=$3; continue };
        if($2~  /_мн_тв$/                           ){  muc_mntv          [$1]=$3; continue };
        if($2~  /_мн_пр$/                           ){  muc_mnpr          [$1]=$3; continue };
        if($2~  /^muk_прл_им$/                      ){  muc_mnim          [$1]=$3; continue };
        if($2~  /^muk_прл_вин$/                     ){  muc_mnvi          [$1]=$3; continue };
        if($2~  /^muk_прл_дат$/                     ){  muc_mnda          [$1]=$3; continue };
        if($2~  /^muk_прл_род$/                     ){  muc_mnro          [$1]=$3; continue };
        if($2~  /^muk_прл_тв$/                      ){  muc_mntv          [$1]=$3; continue };
        if($2~  /^muk_прл_пр$/                      ){  muc_mnpr          [$1]=$3; continue };
   };
   if ($2~ /^otnmest_/) {
        if($2~  /_ед_муж_им$/                       ){  otm_edmuim        [$1]=$3; continue };
        if($2~  /_ед_жен_им$/                       ){  otm_edzeim        [$1]=$3; continue };
        if($2~  /_ед_ср_им$/                        ){  otm_edsrim        [$1]=$3; continue };
        if($2~  /_ед_муж_вин/                       ){  otm_edmuvi        [$1]=$3; continue };
        if($2~  /_ед_жен_вин/                       ){  otm_edzevi        [$1]=$3; continue };
        if($2~  /_ед_ср_вин/                        ){  otm_edsrvi        [$1]=$3; continue };
        if($2~  /_ед_муж_дат$/                      ){  otm_edmuda        [$1]=$3; continue };
        if($2~  /_ед_жен_дат$/                      ){  otm_edzeda        [$1]=$3; continue };
        if($2~  /_ед_ср_дат$/                       ){  otm_edsrda        [$1]=$3; continue };
        if($2~  /_ед_муж_род$/                      ){  otm_edmuro        [$1]=$3; continue };
        if($2~  /_ед_жен_род$/                      ){  otm_edzero        [$1]=$3; continue };
        if($2~  /_ед_ср_род$/                       ){  otm_edsrro        [$1]=$3; continue };
        if($2~  /_ед_муж_тв$/                       ){  otm_edmutv        [$1]=$3; continue };
        if($2~  /_ед_жен_тв$/                       ){  otm_edzetv        [$1]=$3; continue };
        if($2~  /_ед_ср_тв$/                        ){  otm_edsrtv        [$1]=$3; continue };
        if($2~  /_ед_муж_пр$/                       ){  otm_edmupr        [$1]=$3; continue };
        if($2~  /_ед_жен_пр$/                       ){  otm_edzepr        [$1]=$3; continue };
        if($2~  /_ед_ср_пр$/                        ){  otm_edsrpr        [$1]=$3; continue };
        if($2~  /_мн_им$/                           ){  otm_mnim          [$1]=$3; continue };
        if($2~  /_мн_вин/                           ){  otm_mnvi          [$1]=$3; continue };
        if($2~  /_мн_дат$/                          ){  otm_mnda          [$1]=$3; continue };
        if($2~  /_мн_род$/                          ){  otm_mnro          [$1]=$3; continue };
        if($2~  /_мн_тв$/                           ){  otm_mntv          [$1]=$3; continue };
        if($2~  /_мн_пр$/                           ){  otm_mnpr          [$1]=$3; continue };
    };
   } close(cmd);

 # Список классов омографов с описательными тэгами. Неочевидные кодировки в позиции падежа: z=партитив, l=локатив, q=счетная форма
   cmd = "zcat " indb "class.list.gz";
   while ((cmd|getline) > 0) {
	   for (i=2; i<=NF; i++) { xclass[$1][i-1]=$i };
   } close(cmd);

   cmd = "zcat " indb "automo.gz | \
          sed -r 's/([аеёиоуыэюя])\\x27/\\1\\xcc\\x81/g; \
                  s/\\\\xcc\\\\xa0/\\xcc\\xa0/g; \
                  s/\\\\xcc\\\\xa3/\\xcc\\xa3/g; \
                  s/\\\\xcc\\\\xa4/\\xcc\\xa4/g; \
                  s/\\\\xcc\\\\xad/\\xcc\\xad/g; \
                  s/\\\\xcc\\\\xb0/\\xcc\\xb0/g; \
                  s/^(x[0-9]+)\\s([^ ]+)\\s([^ ]+)\\s([^ ]+)(\\s.+)?/\\1 \\3 \\2 \\4 \\u\\2 \\u\\4 \\U\\2\\E \\U\\4\\E \\5/g'";
                                                                    #  1   2   3   4      5      6      7         8      9
   while ((cmd|getline) > 0) {

         if($1== "x1000" ){ grp="x1000"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1001" ){ grp="x1001"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1002" ){ grp="x1002"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1003" ){ grp="x1003"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1004" ){ grp="x1004"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1005" ){ grp="x1005"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1006" ){ grp="x1006"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1007" ){ grp="x1007"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1008" ){ grp="x1008"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1009" ){ grp="x1009"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1010" ){ grp="x1010"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1011" ){ grp="x1011"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1012" ){ grp="x1012"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1013" ){ grp="x1013"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1014" ){ grp="x1014"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1015" ){ grp="x1015"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1016" ){ grp="x1016"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1017" ){ grp="x1017"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1018" ){ grp="x1018"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1019" ){ grp="x1019"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1020" ){ grp="x1020"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1021" ){ grp="x1021"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1022" ){ grp="x1022"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1023" ){ grp="x1023"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1024" ){ grp="x1024"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1025" ){ grp="x1025"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1026" ){ grp="x1026"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1027" ){ grp="x1027"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1028" ){ grp="x1028"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1029" ){ grp="x1029"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1030" ){ grp="x1030"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1031" ){ grp="x1031"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1032" ){ grp="x1032"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1033" ){ grp="x1033"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1034" ){ grp="x1034"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1035" ){ grp="x1035"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1036" ){ grp="x1036"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1037" ){ grp="x1037"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1038" ){ grp="x1038"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1039" ){ grp="x1039"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1040" ){ grp="x1040"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1041" ){ grp="x1041"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1042" ){ grp="x1042"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1043" ){ grp="x1043"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1044" ){ grp="x1044"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1045" ){ grp="x1045"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1046" ){ grp="x1046"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1047" ){ grp="x1047"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1048" ){ grp="x1048"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1049" ){ grp="x1049"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1050" ){ grp="x1050"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1051" ){ grp="x1051"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1052" ){ grp="x1052"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1053" ){ grp="x1053"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1054" ){ grp="x1054"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1055" ){ grp="x1055"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1056" ){ grp="x1056"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1057" ){ grp="x1057"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1058" ){ grp="x1058"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1059" ){ grp="x1059"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1060" ){ grp="x1060"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1061" ){ grp="x1061"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1062" ){ grp="x1062"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1063" ){ grp="x1063"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1064" ){ grp="x1064"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1065" ){ grp="x1065"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1066" ){ grp="x1066"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1067" ){ grp="x1067"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1068" ){ grp="x1068"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1069" ){ grp="x1069"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1070" ){ grp="x1070"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1071" ){ grp="x1071"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1072" ){ grp="x1072"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1073" ){ grp="x1073"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1074" ){ grp="x1074"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1075" ){ grp="x1075"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1076" ){ grp="x1076"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1077" ){ grp="x1077"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x1078" ){ grp="x1078"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2001" ){ grp="x2001"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2002" ){ grp="x2002"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2003" ){ grp="x2003"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2004" ){ grp="x2004"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2005" ){ grp="x2005"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2006" ){ grp="x2006"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2007" ){ grp="x2007"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2008" ){ grp="x2008"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2009" ){ grp="x2009"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2010" ){ grp="x2010"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2011" ){ grp="x2011"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2012" ){ grp="x2012"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2013" ){ grp="x2013"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2014" ){ grp="x2014"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2015" ){ grp="x2015"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2016" ){ grp="x2016"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2017" ){ grp="x2017"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2018" ){ grp="x2018"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2019" ){ grp="x2019"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2020" ){ grp="x2020"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2021" ){ grp="x2021"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2022" ){ grp="x2022"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2023" ){ grp="x2023"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2024" ){ grp="x2024"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2025" ){ grp="x2025"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2026" ){ grp="x2026"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2027" ){ grp="x2027"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2028" ){ grp="x2028"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2029" ){ grp="x2029"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2030" ){ grp="x2030"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2031" ){ grp="x2031"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2032" ){ grp="x2032"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2033" ){ grp="x2033"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2034" ){ grp="x2034"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2035" ){ grp="x2035"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2036" ){ grp="x2036"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2037" ){ grp="x2037"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2038" ){ grp="x2038"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2039" ){ grp="x2039"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2040" ){ grp="x2040"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2041" ){ grp="x2041"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2042" ){ grp="x2042"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2043" ){ grp="x2043"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2044" ){ grp="x2044"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2045" ){ grp="x2045"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2046" ){ grp="x2046"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2047" ){ grp="x2047"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2048" ){ grp="x2048"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2049" ){ grp="x2049"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2050" ){ grp="x2050"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2051" ){ grp="x2051"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2052" ){ grp="x2052"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2053" ){ grp="x2053"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2054" ){ grp="x2054"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2055" ){ grp="x2055"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2056" ){ grp="x2056"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2057" ){ grp="x2057"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2058" ){ grp="x2058"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2059" ){ grp="x2059"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2060" ){ grp="x2060"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2061" ){ grp="x2061"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2062" ){ grp="x2062"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2063" ){ grp="x2063"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2064" ){ grp="x2064"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2065" ){ grp="x2065"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2066" ){ grp="x2066"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2067" ){ grp="x2067"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2068" ){ grp="x2068"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2069" ){ grp="x2069"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2070" ){ grp="x2070"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2071" ){ grp="x2071"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2072" ){ grp="x2072"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2073" ){ grp="x2073"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2074" ){ grp="x2074"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2075" ){ grp="x2075"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2076" ){ grp="x2076"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2077" ){ grp="x2077"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2078" ){ grp="x2078"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2079" ){ grp="x2079"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2080" ){ grp="x2080"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2081" ){ grp="x2081"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2082" ){ grp="x2082"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2083" ){ grp="x2083"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2084" ){ grp="x2084"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2085" ){ grp="x2085"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2086" ){ grp="x2086"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2087" ){ grp="x2087"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2088" ){ grp="x2088"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2089" ){ grp="x2089"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2090" ){ grp="x2090"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2091" ){ grp="x2091"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2092" ){ grp="x2092"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2093" ){ grp="x2093"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2094" ){ grp="x2094"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2095" ){ grp="x2095"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2096" ){ grp="x2096"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2097" ){ grp="x2097"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2098" ){ grp="x2098"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2099" ){ grp="x2099"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2100" ){ grp="x2100"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2101" ){ grp="x2101"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2102" ){ grp="x2102"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2103" ){ grp="x2103"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2104" ){ grp="x2104"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2105" ){ grp="x2105"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2106" ){ grp="x2106"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2107" ){ grp="x2107"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2108" ){ grp="x2108"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2109" ){ grp="x2109"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2110" ){ grp="x2110"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2111" ){ grp="x2111"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2112" ){ grp="x2112"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2113" ){ grp="x2113"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2114" ){ grp="x2114"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2115" ){ grp="x2115"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2116" ){ grp="x2116"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2117" ){ grp="x2117"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2118" ){ grp="x2118"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2119" ){ grp="x2119"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2120" ){ grp="x2120"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2121" ){ grp="x2121"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2122" ){ grp="x2122"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2123" ){ grp="x2123"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2124" ){ grp="x2124"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2125" ){ grp="x2125"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2126" ){ grp="x2126"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2127" ){ grp="x2127"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2128" ){ grp="x2128"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2129" ){ grp="x2129"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2130" ){ grp="x2130"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2131" ){ grp="x2131"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2132" ){ grp="x2132"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2133" ){ grp="x2133"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2134" ){ grp="x2134"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2135" ){ grp="x2135"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2136" ){ grp="x2136"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2137" ){ grp="x2137"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2138" ){ grp="x2138"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2139" ){ grp="x2139"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2140" ){ grp="x2140"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2141" ){ grp="x2141"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2142" ){ grp="x2142"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2143" ){ grp="x2143"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2144" ){ grp="x2144"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2145" ){ grp="x2145"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2146" ){ grp="x2146"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2147" ){ grp="x2147"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2148" ){ grp="x2148"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2149" ){ grp="x2149"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2150" ){ grp="x2150"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2151" ){ grp="x2151"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2152" ){ grp="x2152"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2153" ){ grp="x2153"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2154" ){ grp="x2154"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2155" ){ grp="x2155"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2156" ){ grp="x2156"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2157" ){ grp="x2157"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2158" ){ grp="x2158"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2159" ){ grp="x2159"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2160" ){ grp="x2160"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2161" ){ grp="x2161"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2162" ){ grp="x2162"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2163" ){ grp="x2163"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2164" ){ grp="x2164"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2165" ){ grp="x2165"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2166" ){ grp="x2166"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2167" ){ grp="x2167"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2168" ){ grp="x2168"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2169" ){ grp="x2169"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2170" ){ grp="x2170"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2171" ){ grp="x2171"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2172" ){ grp="x2172"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2173" ){ grp="x2173"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2174" ){ grp="x2174"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2175" ){ grp="x2175"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2176" ){ grp="x2176"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2177" ){ grp="x2177"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2178" ){ grp="x2178"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2179" ){ grp="x2179"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2180" ){ grp="x2180"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2181" ){ grp="x2181"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2182" ){ grp="x2182"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2183" ){ grp="x2183"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2184" ){ grp="x2184"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2185" ){ grp="x2185"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2186" ){ grp="x2186"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2187" ){ grp="x2187"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2188" ){ grp="x2188"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2189" ){ grp="x2189"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2190" ){ grp="x2190"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2191" ){ grp="x2191"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2192" ){ grp="x2192"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2193" ){ grp="x2193"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2194" ){ grp="x2194"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2195" ){ grp="x2195"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2196" ){ grp="x2196"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2197" ){ grp="x2197"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2198" ){ grp="x2198"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2199" ){ grp="x2199"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2200" ){ grp="x2200"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2201" ){ grp="x2201"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2202" ){ grp="x2202"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2203" ){ grp="x2203"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2204" ){ grp="x2204"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2205" ){ grp="x2205"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2206" ){ grp="x2206"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2207" ){ grp="x2207"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2208" ){ grp="x2208"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2209" ){ grp="x2209"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2210" ){ grp="x2210"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2211" ){ grp="x2211"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2212" ){ grp="x2212"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2213" ){ grp="x2213"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2214" ){ grp="x2214"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2215" ){ grp="x2215"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2216" ){ grp="x2216"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2217" ){ grp="x2217"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2218" ){ grp="x2218"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2219" ){ grp="x2219"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2220" ){ grp="x2220"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2221" ){ grp="x2221"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2222" ){ grp="x2222"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2223" ){ grp="x2223"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2224" ){ grp="x2224"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2225" ){ grp="x2225"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2226" ){ grp="x2226"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2227" ){ grp="x2227"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2228" ){ grp="x2228"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2229" ){ grp="x2229"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2230" ){ grp="x2230"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2231" ){ grp="x2231"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2232" ){ grp="x2232"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2233" ){ grp="x2233"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2234" ){ grp="x2234"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2235" ){ grp="x2235"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2236" ){ grp="x2236"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2237" ){ grp="x2237"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2238" ){ grp="x2238"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2239" ){ grp="x2239"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2240" ){ grp="x2240"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2241" ){ grp="x2241"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2242" ){ grp="x2242"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2243" ){ grp="x2243"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2244" ){ grp="x2244"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2245" ){ grp="x2245"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2246" ){ grp="x2246"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2247" ){ grp="x2247"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2248" ){ grp="x2248"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2249" ){ grp="x2249"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2250" ){ grp="x2250"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2251" ){ grp="x2251"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2252" ){ grp="x2252"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2253" ){ grp="x2253"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2254" ){ grp="x2254"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2255" ){ grp="x2255"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2256" ){ grp="x2256"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2257" ){ grp="x2257"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2258" ){ grp="x2258"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2259" ){ grp="x2259"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2260" ){ grp="x2260"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2261" ){ grp="x2261"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2262" ){ grp="x2262"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2263" ){ grp="x2263"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2264" ){ grp="x2264"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2265" ){ grp="x2265"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2266" ){ grp="x2266"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2267" ){ grp="x2267"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2268" ){ grp="x2268"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2269" ){ grp="x2269"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2270" ){ grp="x2270"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2271" ){ grp="x2271"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2272" ){ grp="x2272"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2273" ){ grp="x2273"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2274" ){ grp="x2274"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2275" ){ grp="x2275"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2276" ){ grp="x2276"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2277" ){ grp="x2277"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2278" ){ grp="x2278"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2279" ){ grp="x2279"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2280" ){ grp="x2280"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2281" ){ grp="x2281"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2282" ){ grp="x2282"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2283" ){ grp="x2283"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2284" ){ grp="x2284"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2285" ){ grp="x2285"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2286" ){ grp="x2286"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2287" ){ grp="x2287"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2288" ){ grp="x2288"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2289" ){ grp="x2289"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2290" ){ grp="x2290"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2291" ){ grp="x2291"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2292" ){ grp="x2292"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2293" ){ grp="x2293"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2294" ){ grp="x2294"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2295" ){ grp="x2295"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2296" ){ grp="x2296"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2297" ){ grp="x2297"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2298" ){ grp="x2298"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2299" ){ grp="x2299"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2300" ){ grp="x2300"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2301" ){ grp="x2301"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2302" ){ grp="x2302"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2303" ){ grp="x2303"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2304" ){ grp="x2304"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2305" ){ grp="x2305"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2306" ){ grp="x2306"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2307" ){ grp="x2307"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2308" ){ grp="x2308"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2309" ){ grp="x2309"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2310" ){ grp="x2310"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2311" ){ grp="x2311"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2312" ){ grp="x2312"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2313" ){ grp="x2313"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2314" ){ grp="x2314"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2315" ){ grp="x2315"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x2316" ){ grp="x2316"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3001" ){ grp="x3001"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3002" ){ grp="x3002"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3003" ){ grp="x3003"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3004" ){ grp="x3004"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3005" ){ grp="x3005"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3006" ){ grp="x3006"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3007" ){ grp="x3007"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3008" ){ grp="x3008"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3009" ){ grp="x3009"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3010" ){ grp="x3010"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3011" ){ grp="x3011"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3012" ){ grp="x3012"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3013" ){ grp="x3013"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3014" ){ grp="x3014"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3015" ){ grp="x3015"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3016" ){ grp="x3016"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x3017" ){ grp="x3017"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4700" ){ grp="x4700"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4701" ){ grp="x4701"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4702" ){ grp="x4702"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4703" ){ grp="x4703"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4704" ){ grp="x4704"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4705" ){ grp="x4705"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4706" ){ grp="x4706"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4707" ){ grp="x4707"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4708" ){ grp="x4708"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };
         if($1== "x4777" ){ grp="x4777"; almo[$3]=almo[$5]=almo[$7]=grp; oms[grp][$2][$3]=$4; oms[grp][$2][$5]=$6; oms[grp][$2][$7]=$8; oms[grp]["info"][$3]=$9; continue };

   }; close(cmd);
   # omoid[омограф][омоид][роль]
   cmd = "zcat " indb "omos_part.gz";
   while ((cmd|getline) > 0) {
         ispa_any[$1]
         if($2== "ispa_abst"  ) { ispa_abst  [$1]; continue };
         if($2== "ispa_gas"   ) { ispa_gas   [$1]; continue };
         if($2== "ispa_food"  ) { ispa_food  [$1]; continue };
         if($2== "ispa_liquid") { ispa_liquid[$1]; continue };
         if($2== "ispa_loose" ) { ispa_loose [$1]; continue };
         if($2== "ispa_solid" ) { ispa_solid [$1]; continue };
   }; close(cmd); # словарик партитивов по классам: any, abst, gas, food, liquid, loose, solid

   cmd = "zcat " indb "omoid_part.gz";
   while ((cmd|getline) > 0) {
       for (i=3; i<=NF; i++) {
           if ($i ~ /^[а-яё]+$/) { omoid[$i][$1][$2]; continue }
           else {
              if ($i== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[j][$1][$2] }; continue };
           }; }
   }; close(cmd); # словарик связаных слов, картитивы представлены только в качестве указания их классов.

   cmd = "zcat " indb "omoid_an.gz";
   while ((cmd|getline) > 0) {
       for (i=3; i<=NF; i++) {
           if ($i ~ /^[а-яё]+$/) { omoid[$i][$1][$2]; continue }
           else {
              if ($i== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[j][$1][$2] }; continue };
              if ($i== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[j][$1][$2] }; continue };
           }; }
   }; close(cmd); # словарик связаных слов, омоид в поле 1, омограф(ы) с 3-го поля
   cmd = "zcat " indb "omoid_aus.gz";
   while ((cmd|getline) > 0) {
       for (i=3; i<=NF; i++) {
           if ($i ~ /^[а-яё]+$/) { omoid[$1][$i][$2]; continue }
           else {
              if ($i== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[$1][j][$2] }; continue };
           }; }
   }; close(cmd); # словарик связаных слов, омоид в поле 3+, омограф в 1 поле

   # обработанные слова в их конечной форме
   cmd = "zcat " indb "ist.gz | \
          sed -r 's/([аеёиоуыэюя])\\x27/\\1\\xcc\\x81/g; \
                  s/\\\\xcc\\\\xa0/\\xcc\\xa0/g; \
                  s/\\\\xcc\\\\xa3/\\xcc\\xa3/g; \
                  s/\\\\xcc\\\\xa4/\\xcc\\xa4/g; \
                  s/\\\\xcc\\\\xad/\\xcc\\xad/g; \
                  s/\\\\xcc\\\\xb0/\\xcc\\xb0/g'";
   while ((cmd|getline) > 0) {
         if($2== "is_nar_mest"         ){ is_nar_mest         [$1]; continue };
         if($2== "is_nar_napr"         ){ is_nar_napr         [$1]; continue };
         if($2== "is_nar_spos"         ){ is_nar_spos         [$1]; continue };
         if($2== "is_nar_vrem"         ){ is_nar_vrem         [$1]; continue };
         if($2== "is_prl_edmuim"       ){ is_prl_edmuim       [$1]; continue };
         if($2== "is_prl_edmupr"       ){ is_prl_edmupr       [$1]; continue };
         if($2== "is_prl_edmuvi"       ){ is_prl_edmuvi       [$1]; continue };
         if($2== "is_prl_edsrpr"       ){ is_prl_edsrpr       [$1]; continue };
         if($2== "is_prl_edzeda"       ){ is_prl_edzeda       [$1]; continue };
         if($2== "is_prl_edzeim"       ){ is_prl_edzeim       [$1]; continue };
         if($2== "is_prl_edzepr"       ){ is_prl_edzepr       [$1]; continue };
         if($2== "is_prl_edzero"       ){ is_prl_edzero       [$1]; continue };
         if($2== "is_prl_edzetv"       ){ is_prl_edzetv       [$1]; continue };
         if($2== "is_prl_kred_mu"      ){ is_prl_kred_mu      [$1]; continue };
         if($2== "is_prl_kred_ze"      ){ is_prl_kred_ze      [$1]; continue };
         if($2== "is_prl_krmn"         ){ is_prl_krmn         [$1]; continue };
         if($2== "is_suw_edmuda"       ){ is_suw_edmuda       [$1]; continue };
         if($2== "is_suw_edmuim"       ){ is_suw_edmuim       [$1]; continue };
         if($2== "is_suw_edmulo"       ){ is_suw_edmulo       [$1]; continue };
         if($2== "is_suw_edmune"       ){ is_suw_edmune       [$1]; continue };
         if($2== "is_suw_edmupa"       ){ is_suw_edmupa       [$1]; continue };
         if($2== "is_suw_edmupr"       ){ is_suw_edmupr       [$1]; continue };
         if($2== "is_suw_edmuro"       ){ is_suw_edmuro       [$1]; continue };
         if($2== "is_suw_edmusq"       ){ is_suw_edmusq       [$1]; continue };
         if($2== "is_suw_edmutv"       ){ is_suw_edmutv       [$1]; continue };
         if($2== "is_suw_edmuvi"       ){ is_suw_edmuvi       [$1]; continue };
         if($2== "is_suw_edmuzv"       ){ is_suw_edmuzv       [$1]; continue };
         if($2== "is_suw_edsrda"       ){ is_suw_edsrda       [$1]; continue };
         if($2== "is_suw_edsrim"       ){ is_suw_edsrim       [$1]; continue };
         if($2== "is_suw_edsrne"       ){ is_suw_edsrne       [$1]; continue };
         if($2== "is_suw_edsrpr"       ){ is_suw_edsrpr       [$1]; continue };
         if($2== "is_suw_edsrro"       ){ is_suw_edsrro       [$1]; continue };
         if($2== "is_suw_edsrtv"       ){ is_suw_edsrtv       [$1]; continue };
         if($2== "is_suw_edsrvi"       ){ is_suw_edsrvi       [$1]; continue };
         if($2== "is_suw_edsrzv"       ){ is_suw_edsrzv       [$1]; continue };
         if($2== "is_suw_edzeda"       ){ is_suw_edzeda       [$1]; continue };
         if($2== "is_suw_edzeim"       ){ is_suw_edzeim       [$1]; continue };
         if($2== "is_suw_edzelo"       ){ is_suw_edzelo       [$1]; continue };
         if($2== "is_suw_edzepr"       ){ is_suw_edzepr       [$1]; continue };
         if($2== "is_suw_edzero"       ){ is_suw_edzero       [$1]; continue };
         if($2== "is_suw_edzetv"       ){ is_suw_edzetv       [$1]; continue };
         if($2== "is_suw_edzevi"       ){ is_suw_edzevi       [$1]; continue };
         if($2== "is_suw_mnda"         ){ is_suw_mnda         [$1]; continue };
         if($2== "is_suw_mnim"         ){ is_suw_mnim         [$1]; continue };
         if($2== "is_suw_mnpr"         ){ is_suw_mnpr         [$1]; continue };
         if($2== "is_suw_mnro"         ){ is_suw_mnro         [$1]; continue };
         if($2== "is_suw_mnvi"         ){ is_suw_mnvi         [$1]; continue };
     }; # связаных слов
   close(cmd);


   dbg=dbgstat=""

 # Записать состояние словарных массивов
  if (gawk52 == 1) { writeall(classcache) };
# cmd = "md5sum " indb "classes.awk " indb "cstring.awk " inax "classes.bin " indb "dic_cust.gz " indb "dic_gl.gz " indb "dic_prl.gz " indb "dic_prq.gz " \
#        indb "dic_rest.gz " indb "dic_suw.gz " indb "automo.gz " indb "class.list.gz " indb "omoid_an.gz " \
#        indb "omoid_aus.gz " indb "omoid_part.gz " indb "omos_part.gz " indb "ist.gz " "> " inax "classes.md5"
  cmd = "md5sum " indb "classes.awk " inax "classes.bin " indb "dic_cust.gz " indb "dic_gl.gz " indb "dic_prl.gz " indb "dic_prq.gz " indb "dic_rest.gz " \
         indb "dic_suw.gz " indb "automo.gz " indb "class.list.gz " indb "omoid_an.gz " indb "omoid_aus.gz " indb "omoid_part.gz " indb "omos_part.gz " indb\
         "ist.gz " indb "cstauto.awk " "> " inax "classes.md5"
  system(cmd); close(cmd)
   } #gnuawk

 # Коррекции - удаление омографов из массивов производятся выставлений 3-го поля в NOP.

# for (k=1; k<=664; k++) { printf ("%s%s %s %s\n", "R", k, "=", DIC[k]); sumdic = sumdic + DIC[k] }; print sumdic;

}

