# Последняя версия файла тут: https://github.com/Balamoote/gtts-dic 
###################################################################==
# Словарь чисел
#22/02/2021
###########################################################################################=
#  Содержание: =
#  Списки =
#  Римские цифры =
#  Шаблоны с римскими числами =
#    Склонение имён с римскими числительными м.р. =
#    Склонение имён с римскими числительными ж.р. =
#  Шаблоны с арабскими числами =
#  Десятичные дроби =
#    Даты =
#    Порядковые числительные =
#    Количественные числительные =
#    Единицы измерения =
#      Время =
#      Скорость =
#      Длина / Площадь / Объём =
#      Масса =
#      Валюта =
#      Температура =
#      Координаты =
#      Биты и байты =
#      Порядки =
#    Прочее =
#  Форматирование замен =
#  Склонение пояснительных слов =
#  Сокращения =
#  Цифровые окончания (начало) =
#    Коррекция степеней =
#  Цифровые окончания (конец) =
####################################/=
#  Списки =
##################################################/=
#  Список мужских имён (правителей). На конце Й/Ь отбрасывается =
s=(Аббас|Август|Акбар|Алексе|Алекси|Александр|Альбрехт|Андраш|Андроник|Арслан|Ахмед|Б[ао]лдуин|Бенедикт|Болеслав|Бонифаци|Борис|Боэмунд|Васили|Вацлав|Вильгельм|Владимир|Владислав|Генрих|Георг|Георги|Григори|Густав|Дари|Дмитри|Иван|Иннокенти|Иоанн|Иоганн|Иосиф|Иракли|Казимир|Каллист|Карл|Карол|Кир|Климент|Константин|Кристиан|Л[еь]в|Левон|Леопольд|Лешек|Людовик|Максимилиан|Матве|Мехмед|Миха|Михаил|Мурад|Наполеон|Никола|Осман|Паве?л|П[её]тр|Раймунд|Рамзес|Роман|Рудольф|Рюрик|Сахиб|Сигизмунд|Сикст|Сильвестр|Стефан|Сулейман|Теймураз|[ТФ]еодор|Том|Ф[её]дор|Фердинанд|Филип|Филипп|Франц|Фредерик|Фридрих|Хуан|Хусейн|Целестин|Чунджон|Шабан|Шаддам|Эдуард|Эммануил|Юстиниан|Юхан|Яков|Ян)([аеийоуьюя]?[м]?)\s([XIVL]+)=\1\2<имяМ>\2 \3=g
s=(Артос)([аеийоуьюя]?[м]?)\s([XIVL]+)=\1\2<имяМ>\2 \3=g
#  Список мужских имён (правителей) с А/Я на конце. Пока - про запас (Газа|Иеремия) =
#  Список мужских имён (правителей) с О на конце. Пока - про запас (Мешко|Ягайло) =
#  Список женских имён. Последняя А/Я отбрасывается =
s=(Анн|Виктори|Екатерин|Елизавет|Изабелла|Иоланд|Маргарит|Мари|Соф[иь])([аеоуыюя]?[йю]?)\s([XIVL]+)=\1\2<имяЖ>\2 \3=g
#-----------------------------------------------------------------------------------------=
s=\b(аж в)\b\s([0-9]+)\sг\.=\1 \2<tc6> годУ=gI
s=\b(в)\b\s([0-9]+)\s-\sгоду=\1 \2<tc6> годУ=gI
s=\b(эС|У)\b\s2=\1 два=g
#
#([0-9]+)\.([0-9]+)\.([0-9]+)г.=\1. \2. \3 г.
s=\b(до|от|с)\b\s([0-9]+)\.(01)\.([0-9]+)\sг\.=\1 \2<tc2> января \4<tc2> гОда=gI
s=([0-9]+)\.(01)\.([0-9]+)г=\1. января \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(02)\.([0-9]+)\sг\.=\1 \2<tc2> февраля \4<tc2> гОда=gI
s=([0-9]+)\.(02)\.([0-9]+)г=\1. февраля \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(03)\.([0-9]+)\sг\.=\1 \2<tc2> марта \4<tc2> гОда=gI
s=([0-9]+)\.(03)\.([0-9]+)г=\1. марта \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(04)\.([0-9]+)\sг\.=\1 \2<tc2> апреля \4<tc2> гОда=gI
s=([0-9]+)\.(04)\.([0-9]+)г=\1. апреля \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(05)\.([0-9]+)\sг\.=\1 \2<tc2> мая \4<tc2> гОда=gI
s=([0-9]+)\.(05)\.([0-9]+)г=\1. майя \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(06)\.([0-9]+)\sг\.=\1 \2<tc2> июня \4<tc2> гОда=gI
s=([0-9]+)\.(06)\.([0-9]+)г=\1. июня \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(07)\.([0-9]+)\sг\.=\1 \2<tc2> июля \4<tc2> гОда=gI
s=([0-9]+)\.(07)\.([0-9]+)г=\1. июля \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(08)\.([0-9]+)\sг\.=\1 \2<td2> августа \3<td2> гОда=gI
s=([0-9]+)\.(08)\.([0-9]+)г=\1. августа \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(09)\.([0-9]+)\sг\.=\1 \2<tc2> сентября \4<tc2> гОда=gI
s=([0-9]+)\.(09)\.([0-9]+)г=\1. сентября \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(10)\.([0-9]+)\sг\.=\1 \2<tc2> октября \4<tc2> гОда=gI
s=([0-9]+)\.(10)\.([0-9]+)г=\1. октября \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(11)\.([0-9]+)\sг\.=\1 \2<tc2> ноября \4<tc2> гОда=gI
s=([0-9]+)\.(11)\.([0-9]+)г=\1. ноября \3г=gI
s=\b(до|от|с)\b\s([0-9]+)\.(12)\.([0-9]+)\sг\.=\1 \2<tc2> декабря \4<tc2> гОда=gI
s=([0-9]+)\.(12)\.([0-9]+)г=\1. декабря \3г=gI
#
#\b(с)\b\s([0-9]{1,2})\s\b(по)\b\s([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1 \2<tc2> \3 \4<tc1> \5
#  с 1991 по 1992 гг =
s=\b(с|со)\b\s([0-9]+)\s\b(по)\b\s([0-9]+)\s(\bгг\.)=\1 \2<td2> \3 \4<td1> годА=gI
s=\b(с)\b\s([0-9]+)\s\b(по)\b\s([0-9]+)-й=\1 \2<tc2> \3 \4<td1>=gI
s=\b(в)\b\s([0-9]+)\s\b(часов)\b=\1 \2<tg4> \3=gI
#  Служебные слова (предлоги и пр.) по падежам: =
#  И.п. =
s=(около|приблизительно|почти|без малого|тебе примерно)\s([0-9]+)=\1 <Ип>\2=gI
#  Р.п. =
s=(\bмассу в|\bоколо\b)\b\s([0-9]+)=\1 <Рпо>\2=gI
s=(\b[ву]\b|\bво\b|\bделах\b|\bдо\b|[лн]ее\b|\bиз\b|\bна расстоянии|\bналичие|\bоколо\b|\bот\b|\bпосле\b|\bс\b|\bвыше\b|\bсо\b|ьше\b|\bпорядка\b)\s?-?\s?([0-9]+)=\1 <Рп>\2=gI
#  Д.п. =
s=(\bк\b|\bко\b|рав[ен][ано] примерно|рав[ен][ано]|равн[аоыя]\S*)\s([0-9]+)=\1 <Дп>\2=gI
#  В.п. =
s=(\bна\b|\bпо\b)\s([0-9]+)=\1 <Вп>\2=gI
#  Т.п. =
#  П.п. =
s=(\bо\b|\bоб\b|\bпри\b)\s([0-9]+)=\1 <Пп>\2=gI
#-----------------------------------------------------------------------------------------=
#########################################/=
#  Коррекция валюты \100 -> 100$ =
s=([$€₴])\s?([0-9,.]*)=\2\1=gI
#s=[—–]=-=gI
s=(\S)\s+=\1 =gI
s=(\&)\s?([IVXMDLC]+)=\2=g
s=([IVXMDLC]+)\s?(\&)=\1=g
s=([A-Z])\.([A-Z])\.?=\1_\2_=g
s=\b([0-9]+)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,4}\.?)\b=\1 \2=gI
s=((\bв\b|\bг\b)\.\s?){2}=\2\2.=g
s=([IVXMDLC]+)\s?((\bв\.){2}|(\bв\\\bв)|(\bв/\bв)|(\bв\.\bв\.))([^.])=\1 вв. \7=g
s=\b([г]{2}|(\bг\.){2}|(\bг\\\bг)|(\bг\/\bг))\b\.=гг.=g
s=([0-9]+)\s?(\bг\b|\bгг\b)\.?=\1 \2.=g
s=([IVXMDLC]+)\s?(\bвв\b)([^.])=\1 \2. \3=g
s=(\bкон\.)\s([IVXMDLC]+)=конец \2=g
s=([0-9]+)\s?(\bX\b)\s?([0-9]+)=\1x\3=g
s=(-)(\bти|\bи)(летней\b)=\1\3=gI
#  коррекция 21.05 -> 21:05 (если нужно) =
s=([0-9]+)\.([0-9]+)\.([0-9]+)\.([0-9]+)=\1, \2, \3, \4,=gI
#s=\b([0-2][0-9])\.([0-5][0-9])\b=\1:\2=gI
#s=\b([0-9])\.([0-5][0-9])\b=0\1:\2=gI
#  коррекция 21.05 -> 21,05 (если нужно) =
s=([0-9]+)\|([0-9]+)\|([0-9]+)=\1.\2.\3=gI
s=\b(счетом)\b\s([0-9]+):([0-9]+)=\1 \2 - \3=gI
s=\b(Масштаб)\b\s([0-9]+):([0-9]+)=\1 \2 к \3<th3>=gI
#  коррекция отделения разрядов в больших числах =
s=([ `'])([0]{3})\b=\2=gI
s=([^:0-9])([0-9]+)([ `'])([0]{3})=\1\2\4=gI
s=([0-9]{1,3})[0]{9}([^0-9])=\1 млрд.\2=gI
s=([0-9]{1,3})[0]{6}([^0-9])=\1 млн.\2=gI
s=([0-9]{2,3})[0]{3}([^0-9])=\1 тыс.\2=gI
s=([0-9]{1,3})[ `']([0-9]{3} тыс\.)=\1 млн.\2=gI
s=(°)([\s]+)?(\bC\b|\bС\b)=\1 цельсия=g
s=(°)([\s]+)?(\bК\b|\bK\b)=\1 кельвина=g
#  Коррекция=
s=\bл/с=лс=gI
s=\bТ/с=телесериал=gI
s=([0-9]+)\s?(-)\s?([0-9]+)=\1 \2 \3=gI
s=(\w+)\s?(-)\s?([0-9]+)=\1 \2 \3=gI
s=([0-9]+)\s?(-)\s?(\w+)=\1 \2 \3=gI
s=\b(было|в|с)\b\s([0-9]+)(\.)([0-9]+)=\1 \2:\4=gI
s=([0-9]+)(\.)([0-9]+)\s\bутра\b=\1:\3 утрА=gI
s=([0-9][0-9][0-9])\s([0-9][0-9][0-9])\s(т\.р\.)=\1 тыс. \2 руб.=gI
s=([0-9]+)\s(т\.р\.)=\1 тыс. рублей=gI
s=([0-9]+)\.([0-9][0-9][0-9])\s\b(кг|руб)([.,])=\1\2 \3=gI
s=([0-9]+)(’’)=\1 секунд=gI
s=([0-9]+)(’)=\1 минут=gI
s=([0-9]+)\s?(x|х)\s?([0-9]+)\s?(x|х)\s?([0-9]+)=\1 на \3 и на \5=gI
s=([0-9]+)\s?(x|х)\s?([0-9]+)=\1 на \3=gI
s=\bД\b\s([0-9]+)=длина \1=g
s=\bх\b\s\bШ\b\s([0-9]+)=на ширину \1=g
s=\bШ\b\s([0-9]+)=ширина \1=g
s=([0-9]+),([0-9]+),([0-9]+),([0-9]+),([0-9]+)=\1, \2, \3, \4, \5=gI
s=([0-9]+),([0-9]+),([0-9]+),([0-9]+)=\1, \2, \3, \4=gI
s=([0-9]+),([0-9]+),([0-9]+)=\1, \2, \3=gI
s=([234]),([5])%=\1,\2 процента=gI
s=([2-9][2-4])(,?)([5])?\s?%=\1\2\3 процента=gI
s=<Рп>([023456789]|[1][0-9]|[2-9][05-9])\s?%=\1<ta6> процентов=gI
s=<Дп>([056789]|1[0-9]|[2-9][05-9])\s?%=\1<ta3> процентам=gI
s=\b(верхним)\b\s([0-9]+)\s?%=\1 \2<ta3> процентам=gI
s=([056789]|1[0-9]|[2-9][05-9])\s?%=\1 процентов=gI
s=([1])\s?%=\1 процент=gI
s=([234])\s?%=\1 процента=gI
s=(сч[её]т)\s([0-9]+)(:)([0-9]+)=\1 \2 \4=gI
s=\b(0)([0-9])(:)([0-9][0-9])\b=\2\3\4=gI
s=([0-9]+)\.([0-9]+)\s?(x|х)\s?([0-9]+)=\1,\2 на \4=gI
s=\b(дивизии)\b\s([0-9]+),([0-9]+)=\1 \2, \3=gI
s=([A-ZАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ]+)-([0-9]+)([ЛМНРС])=\1 \2 э\3=g
s=([A-ZАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ]+)-([0-9]+)([БВГДЖЗПТФЦЧЩ])=\1 \2 \3э=g
s=([A-ZАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ]+)-([0-9]+)([КХШ])=\1 \2 \3а=g
s=([A-Z]+)([0-9]+)(C)\b=\1\2 Цэ=g
s=([A-Z]+)([0-9]+)(L)\b=\1\2 эЛь=g
s=([0-9]+)\s?\b(M)\b=\1 эМ=g
s=(\bL\b)-([0-9]+)=эЛь \2=g
s=(\bV\b)([0-9]+)= Вэ \2=g
s=\b(войсковая часть)\b\s([0-9][0-9])([0-9][0-9][0-9])=\1 -\2-\3=gI
s=<Рп>?([0-9]+)\/([0-9]+)\/([0-9]+)=\1-\2-\3=gI
s=([0-9]+)\s?-\s?([0-9]+)\"=\1 - \2=gI
###########################################################################################=
#  Римские цифры =
###########################################################################################=
#  Исключения =
s=\bCD\b=СиДи́=g
#s=S\.T\.A\.L\.K\.E\.R\.=STALKER=gI
s=(\bV\.\bI\.\bP\.|\bVIP\b)=ВИП=gI
#s=(\bC)V(IX\b)=\1\2=gI
s=((\bг\b|\bгр\b|\bд\b|\bм\b)-([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)|\bдокт\.)\s\b([IVXMDLC]+)\b=\1 _\4=gI
#  =
s=\b([MCLXVI]+)\b=<РимЧ>\1=g
s=(M{0,4})(CM|CD|D?C{0,3})(XC|XL|L?X{0,3})(IX|IV|V?I{0,3})\b=<\1+><+\2+><+\3+><+\4>=g
#s=<_Рим_>==g
#  =
s=<\+?\bMMM\b\+><\+\+>(<\+\b[MVIDCLX]+\+>)=30\1=gI
s=<\+?\bMMM\b\+><\+\+><\+\+>(<\+\b[VICLX]+>)=300\1=gI
s=<\+?\bMMM\b\+>(<\+\b[VICDMLX]+\+>)=3\1=gI
s=<\bMMM\b\+>=3000=gI
s=<\+?\bMM\b\+><\+\+>(<\+\b[MVIDCLX]+\+>)=20\1=gI
s=<\+?\bMM\b\+><\+\+><\+\+>(<\+\b[VICLX]+>)=200\1=gI
s=<\+?\bMM\b\+>(<\+\b[VICDMLX]+\+>)=2\1=gI
s=<\bMM\b\+>=2000=gI
s=<\+?\bM\b\+><\+\+>(<\+\b[MVIDCLX]+\+>)=10\1=gI
s=<\+?\bM\b\+><\+\+><\+\+>(<\+\b[VICLX]+>)=100\1=gI
s=<\+?\bM\b\+>(<\+\b[VICDMLX]+\+>)=1\1=gI
s=<\+?\bM\b\+>=1000=gI
#  =
s=<\+\bDCCC\b\+><\+\+>(<\+\b[VICLX]+>)=80\1=gI
s=<\+\bDCCC\b\+>(<\+\b[VICLX]+\+>)=8\1=gI
s=<\+\bDCCC\b\+>=800=gI
s=<\+\bDCCC\b>=800<РимЧ>=gI
s=<\+\bDCC\b\+><\+\+>(<\+\b[VICLX]+>)=70\1=gI
s=<\+\bDCC\b\+>(<\+\b[VICLX]+\+>)=7\1=gI
s=<\+\bDCC\b\+>=700=gI
s=<\+\bDCC\b>=700<РимЧ>=gI
s=<\+\bCCC\b\+><\+\+>(<\+\b[VICLX]+>)=30\1=gI
s=<\+\bCCC\b\+>(<\+\b[VICLX]+\+>)=3\1=gI
s=<\+\bCCC\b\+>=300=gI
s=<\+\bCCC\b>=300<РимЧ>=gI
s=<\+\bDC\b\+><\+\+>(<\+\b[VICLX]+>)=60\1=gI
s=<\+\bDC\b\+>(<\+\b[VICLX]+\+>)=6\1=gI
s=<\+\bDC\b\+>=600=gI
s=<\+\bDC\b>=600<РимЧ>=gI
s=<\+\bCD\b\+><\+\+>(<\+\b[VICLX]+>)=40\1=gI
s=<\+\bCD\b\+>(<\+\b[VICLX]+\+>)=4\1=gI
s=<\+\bCD\b\+>=400=gI
s=<\+\bCD\b>=400<РимЧ>=gI
s=<\+\bCM\b\+><\+\+>(<\+\b[VICLX]+>)=90\1=gI
s=<\+\bCM\b\+>(<\+\b[VICLX]+\+>)=9\1=gI
s=<\+\bCM\b\+>=900=gI
s=<\+\bCM\b>=900<РимЧ>=gI
s=<\+\bCC\b\+><\+\+>(<\+\b[VICLX]+>)=20\1=gI
s=<\+\bCC\b\+>(<\+\b[VICLX]+\+>)=2\1=gI
s=<\+\bCC\b\+>=200=gI
s=<\+\bCC\b>=200<РимЧ>=gI
s=<\+\bC\b\+><\+\+>(<\+\b[VICLX]+>)=10\1=gI
s=<\+\bC\b\+>(<\+\b[VICLX]+\+>)=1\1=gI
s=<\+\bC\b\+>=100=gI
s=<\+\bC\b>=100<РимЧ>=gI
s=<\+\bD\b\+><\+\+>(<\+\b[VICLX]+>)=50\1=gI
s=<\+\bD\b\+>(<\+\b[VICLX]+\+>)=5\1=gI
s=<\+\bD\b\+>=500=gI
s=<\+\bD\b>=500<РимЧ>=gI
#  десятки составные =
s=<\+\bLXX\b\+><\+\bX\b>=80<РимЧ>=gI
s=<\+\bXX\b\+><\+\bX\b>=30<РимЧ>=gI
s=<\+\bLX\b\+><\+\bX\b>=70<РимЧ>=gI
s=<\+\bX\b\+><\+\bX\b>=20<РимЧ>=gI
s=<\+\bX\b\+><\+\bL\b>=40<РимЧ>=gI
s=<\+\bL\b\+><\+\bX\b>=60<РимЧ>=gI
s=<\+\bX\b\+><\+\bC\b>=90<РимЧ>=gI
#  =
s=<\+\bLXXX\b\+><\+>=80<РимЧ>=gI
s=<\+\bLXX\b\+><\+>=70<РимЧ>=gI
s=<\+\bXXX\b\+><\+>=30<РимЧ>=gI
s=<\+\bXL\b\+><\+>=40<РимЧ>=gI
s=<\+\bXC\b\+><\+>=90<РимЧ>=gI
s=<\+\bXX\b\+><\+>=20<РимЧ>=gI
s=<\+\bLX\b\+><\+>=60<РимЧ>=gI
s=<\+\bL\b\+><\+>=50<РимЧ>=gI
#  =
s=<\+\bLXXX\b\+>=8=gI
s=<\+\bLXX\b\+>=7=gI
s=<\+\bXXX\b\+>=3=gI
s=<\+\bXL\b\+>=4=gI
s=<\+\bXC\b\+>=9=gI
s=<\+\bXX\b\+>=2=gI
s=<\+\bLX\b\+>=6=gI
s=<\+\bL\b\+>=5=gI
#  =
s=<\+\bX\b\+><\+\bVIII\b>=18<РимЧ>=gI
s=<\+\bX\b\+><\+\bIII\b>=13<РимЧ>=gI
s=<\+\bX\b\+><\+\bVII\b>=17<РимЧ>=gI
s=<\+\bX\b\+><\+\bIV\b>=14<РимЧ>=gI
s=<\+\bX\b\+><\+\bVI\b>=16<РимЧ>=gI
s=<\+\bX\b\+><\+\bIX\b>=19<РимЧ>=gI
s=<\+\bX\b\+><\+\bII\b>=12<РимЧ>=gI
s=<\+\bX\b\+><\+\bV\b>=15<РимЧ>=gI
s=<\+\bX\b\+><\+\bI\b>=11<РимЧ>=gI
s=<\+\bX\b\+><\+>=10<РимЧ>=gI
s=<\+\bX\b\+>=1=gI
#  =
s=<\+\bIV\b>=4<РимЧ>=gI
s=<\+\bIX\b>=9<РимЧ>=gI
s=<\+\bIII\b>=3<РимЧ>=gI
s=<\+\bII\b>=2<РимЧ>=gI
s=<\+\bI\b>=1<РимЧ>=gI
s=<\+\bVIII\b>=8<РимЧ>=gI
s=<\+\bVII\b>=7<РимЧ>=gI
s=<\+\bVI\b>=6<РимЧ>=gI
s=<\+\bV\b>=5<РимЧ>=gI
s=<\+\bX\b>=10<РимЧ>=gI
s=<\+\bL\b>=50<РимЧ>=gI
#  =
s=<\+\+>==gI
s=<\+>==gI
#############################################/=
#  Шаблоны с римскими числами =
#  формат правил: арабская цифра + <РимЧ> =
#  напр.: 20<РимЧ> =
#############################################=
s=([0-9]+)<РимЧ>\s(\bго\b)=\1-ого=g
#  в начале XIX-XX вв =
s=(\bв\b)\s((\bначале\b|\bконце\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)([0-9]+)<РимЧ>\s?([, -])\s?((\bначале\b|\bконце\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)?([0-9]+)<РимЧ>\s([в]{1,2}\.|\bвека\b)=\1 \2\5<td2> - \7${10}<td2> вЕка=gI
#  в XIX-XX вв =
s=<Рп>([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>\s(\bвекеb|\bвеках\b)=\1<td6> - \3<td6> \4=gI
s=(\bв\b|\bво\b)\s([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>\s([в]{1,2}\.)=\1 \2<td6> - \4<td6> векАх=gI
#  до начала XIX-XX вв =
s=(\bдо\b|\bс\b)\s((\bначала\b|\bконца\b|\bсередины\b|(\bпервой\b|\bвторой\b)\s\bполовины\b)\s)([0-9]+)<РимЧ>\s?([, -])\s?((\bначала\b|\bконца\b|\bсередины\b|(\bпервой\b|\bвторой\b)\s\bполовины\b)\s)?([0-9]+)<РимЧ>\s([в]{1,2}\.|\bвека\b|\bвеков\b)=\1 \2\5<td2> - \7{10}<td2> века=gI
#  до XIX-XX вв =
s=(\bдо\b|\bс\b)\s([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>\s(\bвека\b|\bвеков\b)=\1 \2<td2> - \4<td2> \5=gI
s=<Рп>([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>\s([в]{1,2}\.)=\1<td2> - \3<td2> веков=gI
#  к началу XIX-XX вв =
s=(\bк\b)\s((\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)([0-9]+)<РимЧ>\s?([, -])\s?((\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)?([0-9]+)<РимЧ>\s([в]{1,2}\.|\bвек(у\b|ам\b))=\1 \2\5<td2> - \7{10}<td2> века=gI
#  конца XIX-начала XX  =
s=(\bначала\b|\bконца\b|\bсередина\b)\s([0-9]+)<РимЧ>\s?([, -])\s?(\bначала\b|\bконца\b|\bсередина\b)\s?([0-9]+)<РимЧ>=\1 \2<tc2> - \4 \5<tc2>=gI
#  к XIX-XX вв =
s=<Дп>([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>\s(\bвеку\b|\bвекам\b)=\1<td3> - \3<td3> \4=gI
s=<Дп>([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>\s([в]{1,2}\.)=\1<td3> - \3<td3> векАм=gI
#  в начале XIX в =
s=(\bв\b)\s((\bначале\b|\bконце\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)([0-9]+)<РимЧ>\s(\bв\.|\bвека\b)=\1 \2\5<td6> века=gI
#  в XIX в =
s=<Рп>([0-9]+)<РимЧ>\s(\bв\.|\bвеке\b)=\1<td6> веке=gI
#  до начала XIX в =
s=(\bдо\b|\bс\b)\s((\bначала\b|\bконца\b|\bсередины\b|(\bпервой\b|\bвторой\b)\s\bполовины\b)\s)([0-9]+)<РимЧ>\s(\bв\.|\bвека\b)=\1 \2\5<td2> века=gI
#  до XIX в =
s=(\bдо\b|\bс\b)\s([0-9]+)<РимЧ>\s(\bв\.|\bвека\b)=\1 \2<td2> века=gI
#  к началу XIX в =
s=(\bк\b)\s((\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s)([0-9]+)<РимЧ>\s(\bв\.|\bвека\b)=\1 \2\5<td3> века=gI
#  к XIX в =
s=<Дп>([0-9]+)<РимЧ>\s(\bв\.|\bвеку\b)=\1<td3> веку=gI
#  к XIX-XX веков =
s=<Дп>([0-9]+)<РимЧ>\s?(\bи\b|[- ,])\s?([0-9]+)<РимЧ>\s(\bвв\.)=\1<td3> \2 \3<td3> векам=gI
s=<Дп>([0-9]+)<РимЧ>\s?(\bи\b|[- ,])\s?([0-9]+)<РимЧ>\s(\bстолетий\b|\bвеков\b|\bтысячелетий\b|\bдесятилетий\b|\bсъездов\b)=\1<td3> \2 \3<td3> \4=gI
#  XIX-XX веков =
s=([0-9]+)<РимЧ>\s?(\bи\b|[- ,])\s?([0-9]+)<РимЧ>\s(\bвв\.)=\1<td2> \2 \3<td2> веков=gI
s=([0-9]+)<РимЧ>\s?(\bи\b|[- ,])\s?([0-9]+)<РимЧ>\s(\bстолетий\b|\bвеков\b|\bтысячелетий\b|\bдесятилетий\b|\bсъездов\b)=\1<td2> \2 \3<td2> \4=gI
#  XIX-XX веках =
s=([0-9]+)<РимЧ>\s?(\bи\b|-,)\s?([0-9]+)<РимЧ>\s(\bстолетиях\b|\bвеках\b|\bтысячелетиях\b|\bдесятилетиях\b|\bсъездах\b)=\1<td6> \3<td6> \4=gI
#  XIX веком =
s=([0-9]+)<РимЧ>\s(\bвеком\b|\bстолетием\b|\bтысячелетием\b|\bдесятилетием\b|\bсъездом\b)=\1<td5> \2=gI
#  XIX веке =
s=([0-9]+)<РимЧ>\s(\bвеке\b|\bстолетии\b|\bтысячелетии\b|\bдесятилетии\b|\bсъезде\b)=\1<td6> \2=gI
#  кон. XIX в =
s=([0-9]+)<РимЧ>\s(\bв\.|\bвека\b)=\1<td2> века=gI
#  XIX века =
s=([0-9]+)<РимЧ>\s(\bвека\b|\bстолетия\b|\bтысячелетия\b|\bдесятилетия\b|\bсъезда\b)=\1<td2> \2=gI
#  XIX век =
s=([0-9]+)<РимЧ>\s(\bвек\b|\bсъезд\b|\bгенеральный\b)=\1<td1> \2=gI
#  XIX генеральной =
s=([0-9]+)<РимЧ>\s(\bгенеральной\b)=\1<te2> \2=gI
#  XIX генеральная =
s=([0-9]+)<РимЧ>\s(\bгенеральная\b)=\1<te1> \2=gI
#  XIX столетие =
s=([0-9]+)<РимЧ>\s(\bстолетие\b|\bтысячелетие\b|\bдесятилетие\b)=\1<tc1> \2=gI
#  в XIX-XX =
s=(\bв\b)\s([0-9]+)<РимЧ>\s?([,-])\s?([0-9]+)<РимЧ>=\1 \2<td6> \4<td6>=gI
#  до XIX-XX =
s=<Рп>([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>=\1<td2> - \3<td2>=gI
#  к XIX-XX =
s=(\bк\b)\s([0-9]+)<РимЧ>\s?([, -])\s?([0-9]+)<РимЧ>=\1 \2<td3> - \4<td3>=gI
#  до XIX =
s=(\bдо\b)\s([0-9]+)<РимЧ>=\1 \2<td2>=gI
#  к XIX =
s=<Дп>([0-9]+)<РимЧ>=\1<td3>=gI
#  в XIX * главе =
s=<Рп>([0-9]+)<РимЧ>\s(.*)?\s(\bглаве\b)=\1<te2> \2 \3=gI
#  в XIX =
s=<Рп>([0-9]+)<РимЧ>=\1<td6>=gI
#  концу XIX в =
s=(\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s([0-9]+)<РимЧ>\s(\bв\.|\bвека\b)=\1  \3<td2> века=gI
#  концу XIX в =
s=(\bначалу\b|\bконцу\b|\bсередине\b|(\bпервой\b|\bвторой\b)\s\bполовине\b)\s([0-9]+)<РимЧ>=\1 \3<td2>=gI
#############################################/=
#    Склонение имён с римскими числительными м.р. =
#############################################/=
#  Список имён - в начале файла =
#  Петр I (И.п.) =
s=<имяМ>[йь]?\s([0-9]+)<РимЧ>= \1<td4>=gI
#  Петра I (Р.п./В.п.) =
s=<имяМ>[ая]\s([0-9]+)<РимЧ>= \1<td2>=gI
#  Петру I (Д.п.) =
s=<имяМ>[ую]\s([0-9]+)<РимЧ>= \1<td3>=gI
#  Петром I (Тв.п.) =
s=<имяМ>[ое]м\s([0-9]+)<РимЧ>= \1<td5>=gI
#  Петре I (Пр.п.) =
s=<имяМ>[еи]\s([0-9]+)<РимЧ>= \1<td6>=gI
#############################################/=
#    Склонение имён с римскими числительными ж.р. =
#############################################=
#  Елизавета I (И.п.) =
s=<имяЖ>[ая]\s([0-9]+)<РимЧ>= \1<te1>=gI
#  Елизаветы I (р.п.) =
s=<имяЖ>[ый]\s([0-9]+)<РимЧ>= \1<te2>=gI
#  Елизавете I (Д.п.\Пр.п.) =
s=<имяЖ>[еи]\s([0-9]+)<РимЧ>= \1<te2>=gI
#  Елизавету I (в.п.) =
s=<имяЖ>[ую]\s([0-9]+)<РимЧ>= \1<te4>=gI
#  Елизаветой I (тв.п.) =
s=<имяЖ>[ое][йю]\s([0-9]+)<РимЧ>= \1<te2>=gI
##########################################/=
#  начала XIX века =
s=(\bначала\b|\bконца\b|\bсередины\b)\s([0-9]+)<РимЧ>\s(\bв\.|\bвек\.|\bвека\b)=\1 \2<td2> века=gI
#  с кон. XIX в \ с кон. XIX века \ с кон. XIX век. =
s=(\bс\b)\s(\bкон\.)\s([0-9]+)<РимЧ>\s(\bв\.?\b|\bвек\.?\b|\bвека\b)=\1 конца \3<td2> века=gI
#  XIX уровень =
s=([0-9]+)<РимЧ>\s(\bуровень\b)=\1<td1> \2=gI
#  ст. XIX =
s=(\bст\.)\s?([0-9]+)<РимЧ>=статья \2<te1>=gI
#  т. XIX =
s=(\bт\.)\s?([0-9]+)<РимЧ>=том \2<td4>=gI
#  Mk.II =
s=(\bMk\.?)\s?([0-9]+)<РимЧ>=Марк \2=gI
#  удаление лишнего =
s=<РимЧ>==g
s=\_([A-Z])\_=.\1.=g
###########################################################################################/=
# Шаблоны с арабскими числами =
###########################################################################################/=
s=([0-9])-([0-9])=\1 - \2=gI
s=(\bмлрд\.?|\bмлн\.?|\bтыс\.?)\s(руб\.?\b|рублей)=\1 рублей=gI
s=(\bмлрд\.?|\bмлн\.?|\bтыс\.?)\s(\bдолл\.?\b|\bдол\.?\b)=\1 долларов=gI
s=([0-9]+)(\s?-?\s?)([0-9]+)\s(\bмиллиард[абвгдеёжзийклмнопрстуфхцчшщъыьэюя]*|\bмлрд\.|\bмлрд\b)=\1<t1>\2\3<t1><mlrd>=gI
s=([0-9]+)\s(\bмиллиард[абвгдеёжзийклмнопрстуфхцчшщъыьэюя]*|\bмлрд\.|\bмлрд\b)=\1<t1><mlrd>=gI
s=([0-9]+)\s(\bмиллион[абвгдеёжзийклмнопрстуфхцчшщъыьэюя]*|\bмлн\.|\bмлн\b)=\1<t1><mln>=gI
s=([0-9]+)\s(\bтысяч[абвгдеёжзийклмнопрстуфхцчшщъыьэюя]*|\bтыс\.|\bтыс\b)=\1<t1><tis>=gI
#   Десятичные дроби =
# десятичные дроби на 0,5 =
s=(\bпосле\b|\bиз\b|\bс\b|\bв\b|\bдо\b|коло\b|выше\b|зительно\b|ее\b|ьше\b|делах\b|\bот\b)\s([0-9]+)([,.])([5])\s?\x25=\1 \2<ta2> с половиной процента=gI
s=<Рп>(([1-90]+)?[2-90][01]|[01])([,.])([5])\s?°=\1<ta2> с половиной градуса=gI
s=<Рп>([0-9]+)([,.])([5])\s?°=\1<ta2> с половиной градусов=gI
s=<Рп>([0-9]+)([,.])([5])=\1<ta2> с половиной=gI
s=<Вп>([0-9]+)([,.])([5])\s?\x25=\1<ta1> с половиной процента=gI
s=\b([1])([,.])([5])\b=полтора=gI
s=\b([1-9]{1,}[1])([,.])([5])\b=\1<tb4> с половиной=gI
s=\b([0-9]+)([,.])([5])\b=\1 с половиной=gI
#  Коррекция обыкновенных дробей: 1/3 -> 1 из 3 (если нужно) =
s=([0-9]+)\/([0-9]+)=\1 дробь \2=gI
#  =
# обыкновенные дроби на /3 =
s=<Рп>([1])\s?(\/)\s?([3])\b=\1 \2<tb2> трети=gI
s=<Рп>([2-3])\s?(\/)\s?([3])\b=\1 \2<tb2> третей=gI
s=<Вп>([1])\s?(\/)\s?([3])\b=\1 \2<tb4> треть=gI
s=<Вп>([2-3])\s?(\/)\s?([3])\b=\1 \2<tb4> трети=gI
s=\b([1])\s?(\/)\s?([3])\b=\1<tb1> треть=gI
s=\b([2-3])\s?(\/)\s?([3])\b=\1<tb1> трети=gI
# Десятичные дроби
s=\b([1])(,)([5])\b\s(литров)=полутора \4=gI
s=\b([1])(,)([5])\b=полтора=gI
s=\b([0-9]+)(,)(0+)\b=\1=gI
s=\b([0-9]+)(,)([0-9]{8})\b=\1 и \3<:8:>=gI
s=\b([0-9]+)(,)([0-9]{7})\b=\1 и \3<:7:>=gI
s=\b([0-9]+)(,)([0-9]{6})\b=\1 и \3<:6:>=gI
s=\b([0-9]+)(,)([0-9]{5})\b=\1 и \3<:5:>=gI
s=\b([0-9]+)(,)([0-9]{4})\b=\1 и \3<:4:>=gI
s=([0-9]*[1])(,)([0-9]{2}[1])=\1<tb1> целая \3<tb1><:3я:>=gI
s=([0-9]*[1])(,)([0-9]{3})=\1<tb1> целая \3<tb1><:3:>=gI
s=\b([0-9]+)(,)([0-9]{2}[1])\b=\1<tb1> целых \3<tb1><:3я:>=gI
s=\b([0-9]+)(,)([0-9]{3})\b=\1<tb1> целых \3<tb1><:3:>=gI
s=\b([1][1])(,)([0-9]{2})\b=\1<tb1> целых \3<tb1><:2:>=gI
s=\b([0-9]*[1])(,)([0-9][1])\b=\1<tb1> целая \3<tb1><:2я:>=gI
s=\b([0-9]+)(,)([0-9][0])\b=\1<tb1> целых \3<:2:>=gI
s=\b([0-9]+)(,)([0-9][1])\b=\1<tb1> целых \3<tb1><:2я:>=gI
s=\b([0-9]+)(,)([0-9][0])\b=\1<tb1> целых \3<:2:>=gI
s=\b([0-9]+)(,)([0-9][1])\b=\1<tb1> целых \3<tb1><:2я:>=gI
s=\b([0-9]+)(,)([0-9]{2})\b=\1<tb1> целых \3<tb4><:2:>=gI
s=\b([1][1])(,)([0-9][1])\b=\1<tb1> целых \3<tb1><:1я:>=gI
s=\b([1][1])(,)([0-9]{1})\b=\1<tb1> целых \3<tb1><:1:>=gI
s=\b([0-9]*[1])(,)([0-9]{1})\b=\1<tb1> целая \3<:1:>=gI
s=\b([0-9]*[02-9])(,)([0-9]{1})\b=\1<tb1> целых \3<tb1><:1:>=gI
s=\b([0-9]+)(,)([1])\b=\1<tb4> целых \3<tb1><:1я:>=gI
s=\b([0-9]+)(,)([1])\b=\1<tb4> целых \3<tb1><:1я:>=gI
s=\b([0-9]+)(,)([0-9]{1})\b=\1<tb1> целых \3<tb4><:1:>=gI
s=<:1:>= десятых=gI
s=<:1я:>= десятая=gI
s=<:2:>= сотых=gI
s=<:2я:>= сотая=gI
s=<:3:>= тысячных=gI
s=<:3я:>= тысячная=gI
s=<:4:>= десятитысячных=gI
s=<:5:>= стотысячных=gI
s=<:6:>= миллионных=gI
s=<:7:>= десятимиллионных=gI
s=<:8:>= стомиллионных=gI
s=\b(десят|сот)(ая|ых)\s?-?\s?(\bм\.?\b)=\1\2 метра=gI
s=\b(десят|сот)(ая|ых)\s?-?\s?(\bсм\.?\b)=\1\2 сантиметра=gI
s=\b(десят|сот)(ая|ых)\s?-?\s?(\bмм\.?\b)=\1\2 миллиметра=gI
#  дроби и вычисления =
s=([0-9.,]+)\s?(\\/)\s?([0-9.,]+)\s?\x3d=\1 разделить на \3 равно=gI
s=\x3d\s?([0-9.,]+)\s?(\\/)\s?([0-9.,]+)=равняется \1<tb3> \3<te3>=gI
s=([1])\s?(\/)\s?([0-9]+)\b=\1<tb1> \3<te1>=gI
s=([2-90])\s?(\/)\s?([0-9]+)\b=\1<tb1> \3<tf2>=gI
#  5x5 =
s=([0-9]+)\s?(x|х)\s?([0-9]+)=\1 на \3=gI
s=([0-9.,]+)\s?([хx*])\s?([0-9.,]+)\s?\==\1 умножить на \3 равно=gI
s=\=\s?(<\S+>)?([0-9.,]+)\s?([хx*])\s?(<\S+>)?([0-9.,]+)=равно \1\2 умножить на \4\5=gI
s=([0-9.,]+)\s?(-)\s?([0-9.,]+)\s?\==\1 минус \3 равно=gI
s=\=\s?(<\S+>)?([0-9.,]+)\s?(-)\s?(<\S+>)?([0-9.,]+)=равно \1\2 минус \4\5=gI
s=([0-9.,]+)\s?(\+)\s?([0-9.,]+)\s?\==\1 плюс \3 равно=gI
s=\=\s?(<\S+>)?([0-9.,]+)\s?(\+)\s?(<\S+>)?([0-9.,]+)=равно \1\2 плюс \4\5=gI
s=\=\s?(<\S+>)?([0-9]+)=равняется \1\2<tb3>=gI
#  1991-го-ого =
s=([0-9]+)\s(\х58|\х78|\хb5|\хb6|\х2a)\s([0-9]+)=\1\2\3=gI
#  =
s=([1])\s(\bшт\.|\bшт\b)=\1 штука=g
s=([2-4])\s(\bшт\.|\bшт\b)=\1 штуки=g
s=([5-90])\s(\bшт\.|\bшт\b)=\1 штук=g
#############################################=
#    Даты =
############################################=
#  (8апр с.р.им.п. t\=1/2)
s=([0-9]+)\s?\bянв\.?\b=\1 <mm:1:t1>=gI
s=([0-9]+)\s?\bфев\.?\b=\1 <mm:2:t1>=gI
s=([0-9]+)\s?\bмар\.?\b=\1 <mm:3:t1>=gI
s=([0-9]+)\s?\bапр\.?\b=\1 <mm:4:t1>=gI
s=([0-9]+)\s?\bмай\.?\b=\1 <mm:5:t1>=gI
s=([0-9]+)\s?\bиюн\.?\b=\1 <mm:6:t1>=gI
s=([0-9]+)\s?\bиюл\.?\b=\1 <mm:7:t1>=gI
s=([0-9]+)\s?\bавг\.?\b=\1 <mm:8:t1>=gI
s=([0-9]+)\s?\bсен\.?\b=\1 <mm:9:t1>=gI
s=([0-9]+)\s?\bокт\.?\b=\1 <mm:10:t1>=gI
s=([0-9]+)\s?\bноя\.?\b=\1 <mm:11:t1>=gI
s=([0-9]+)\s?\bдек\.?\b=\1 <mm:12:t1>=gI
s=([0-9]+)\s?<mm:([0-9]+):t1>=\1<tc1> <mm:\2:t2>=gI
s=(dd-mm-yy -> dd-mm-yyyy 1900-2000) ==gI
s=\b(3[01]|[0-2]?[0-9])(\.|-|\/)(1[0-2]|0?[1-9])(\.|-|\/)([01]?[0-9])\b=\1\2\3\420\5=gI
s=\b(3[01]|[0-2]?[0-9])(\.|-|\/)(1[0-2]|0?[1-9])(\.|-|\/)([2-9]?[0-9])\b=\1\2\3\419\5=gI
s=(dd-mm-yy, dd-mm-yyyy) ==gI
s=\b(3[01]|[0-2]?[0-9])(-)(1[0-2]|0?[1-9])(-)([0-9]{4})\b=\1<t1><dd> \3<t2><mm> \5<t2><yy>=gI
s=\b(3[01]|[0-2]?[0-9])(-)(1[0-2]|0?[1-9])(-)([0-9]{2})\b=\1<t1><dd> \3<t2><mm> \5<t2><yy>=gI
s=(dd-dd\.mm\.yy, dd-dd\.mm\.yyyy) ==gI
s=\b(3[01]|[0-2]?[0-9])-(3[01]|[0-2]?[0-9])\.(1[0-2]|0?[1-9])(\.)([0-9]{4})\b=\1<t1><dd> - \2<t1><dd> \3<t2><mm> \5<t2><yy>=gI
s=\b(3[01]|[0-2]?[0-9])-(3[01]|[0-2]?[0-9])\.(1[0-2]|0?[1-9])(\.)([0-9]{2})\b=\1<t1><dd> - \2<t1><dd> \3<t2><mm> \5<t2><yy>=gI
s=(dd\.mm\.yy, dd\.mm\.yyyy) ==gI
s=\b(3[01]|[0-2]?[0-9])(\.)(1[0-2]|0?[1-9])(\.)([0-9]{4})\b=\1<t1><dd> \3<t2><mm> \5<t2><yy>=gI
s=\b(3[01]|[0-2]?[0-9])(\.)(1[0-2]|0?[1-9])(\.)([0-9]{2})\b=\1<t1><dd> \3<t2><mm> \5<t2><yy>=gI
#(dd/mm/yy, dd/mm/yyyy) =
s=\b(3[01]|[0-2]?[0-9])(\/)(1[0-2]|0?[1-9])(\/)([0-9]{4})\b=\1<t1><dd> \3<t2><mm> \5<t2><yy>=gI
s=\b(3[01]|[0-2]?[0-9])(\/)(1[0-2]|0?[1-9])(\/)([0-9]{2})\b=\1<t1><dd> \3<t2><mm> \5<t2><yy>=gI
# 20… года=
s=([2][0])(…)\s(года)=дветысячи... энного \3=gI
#  январь 1991 года =
s=\b(январь|февраль|март|апрель|май|июнь|июль|август|сентябрь|октябрь|ноябрь|декабрь)\b\s([0-9]+)=\1 \2<tc2>=gI
s=<Рп>\b(январе|феврале|марте|апреле|мае|июне|июле|августе|сентябре|октябре|ноябре|декабре)\b(\s?-?\s?)\b(январе|феврале|марте|апреле|мае|июне|июле|августе|сентябре|октябре|ноябре|декабре)\b\s([0-9]+)=\1\2\3 \4<tc2> =gI
s=([0-9]+)\s?-\s?([0-9]+)\s\b(января|февраля|марта|апреля|мая|июня|июля|августа|\bсентября|октября|ноября|декабря)\b=\1<tc2> - \2<tc2> \3=gI
s=(\bянв|\bфев|\bмар|\bапр|\bмае|\bиюн|\bиюл|\bавг|\bсен|\bокт|\bноя|\bдек)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s([0-9]+)\s(\bгода\b|\bг\.|\bгод\.)=\1\2 \3<tc2> гОда=gI
s=(\bянв|\bфев|\bмарт|\bапр|\bмае|\bиюн|\bиюл|\bавг|\bсен|\bокт|\bноя|\bдек)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s([0-9]+)=\1\2 \3<tc2>=gI
s=<Вп>(\bянв|\bфев|\bмар|\bапр|\bмае|\bиюн|\bиюл|\bавг|\bсен|\bокт|\bноя|\bдек)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s([0-9]+)=\1\2 \3<tc2>=gI
#  1 2 января =
s=([0-9]+)\s\b(и|или)\b\s([0-9]+)\s\b(января|февраля|марта|апреля|мая|июня|июля|августа|\bсентября|октября|ноября|декабря)\b=\1<tc2> \2 \3<tc2> \4=gI
s=([0-9]{1,2})\s\(?([0-9]{1,2})\)?\s?\b(января|февраля|марта|апреля|мая|июня|июля|августа|\bсентября|октября|ноября|декабря)\b=\1<tc2> - \2<tc2> - \3=gI
#  1-2 января =
s=<Рп>?([0-9]{1,2})\s?(\bи\b|-|\bпо\b|\bдо\b)\s?([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1<tc2> \2 \3<tc2> \4=gI
# на по 1 января =
s=<Вп>([0-9]{1,2})\s?-\s?е\b\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1<tc1> \2=gI
s=<Вп>([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1<tc1> \2=gI
#  с 1 января =
s=<Рп>([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1<tc2> \2=gI
#  к 1 января =
s=<Дп>([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1<tc3> \2=gI
#  с 1-2 января =
s=<Рп>([0-9]{1,2})\s?(\bи\b|-|\bпо\b|\bдо\b)\s?([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1<td2> \2 \3<tc2> \4=gI
#  1 января =
s=\b(перед)\s\b([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1 \2<tc5> \3=gI
s=([0-9]{1,2})\s(\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)=\1<tc2> \2=gI
#-----------------------------------------------------------------------------------------=
# Около 1900 года
s=(\bоколо\b)\s([0-9]+)\s?-\s?(\bго\b)=\1 \2-го гОда=gI

#  между 1991-1992 годами =
s=(\bмежду\b)\s([0-9]{1,4})-?(\bым\b)?\s?-?(\bи\b)?\s?([0-9]{1,4})-?(\bым\b)?\s(\bгодами\b|\bгг\.|\bгод\.?\b)=\1 \2<td5> и \5<td5> годАми=gI
#  между 1991-м =
s=(\bмежду\b)\s([0-9]+)\s?-\s?(\bм\b)=\1 \2-ым=gI
#  этому 1991 году =
s=\b(Новому|этому),\s([0-9]+),\s(\bгоду\b|\bг\.)=\1 \2-ому гОду=gI
s=\b(Новому|этому)\b\s([0-9]+)\s(\bгоду\b|\bг\.)=\1 \2-ому гОду=gI
#  году в 1991 =
s=(\bгоду\b)\s(\bв\b)\s([0-9]+)-?(\bм\b)?=годУ \2 \3-м=gI
#  с 1991-1992 год =
s=<Рп>([0-9]+)\s?([,-]|\bдо\b|\bпо\b)\s?([0-9]+)\s(\bгг\.|\bгод\.?\b|\bгода\b|\bгоды\b)=\1<td2> по \3<td1> год=gI
#  с кон. 19 в \ с кон. 19 век. =
s=(\bс\b)\s(\bкон\.)\s([0-9]+)\s(\bв\.?\b|\bвек\.?\b)=\1 конца \3<td2> века=gI
#  с кон. 19 века =
s=(\bс\b)\s(\bкон\.)\s([0-9]+)\s(\bвека\b)=\1 конца \3<td2> века=gI
#  кон. 19 в \ с кон. 19 век. =
s=(\bкон\.)\s([0-9]+)\s(\bв\.?\b|\bвек\.?\b)=конец \2<td2> века=gI
#  кон. 19 века =
s=(\bкон\.)\s([0-9]+)\s(\bвека\b)=конец \2<td2> века=gI
#  =
s=([0-9]+)(\s?-\s?)([0-9]+)\s\b(век)\b=\1<td1> \2 \3<td1> \4=gI
s=([0-9]+)\s\b(век|год|степени|том)\b=\1<td1> \2=gI
s=([0-9]+)\s(\bвек\b|\bстолетие\b|\bтысячелетие\b|\bдесятилетие\b)=\1<tc1> \2=gI
s=([0-9]+)\s(\bвеком\b|\bстолетием\b|\bтысячелетием\b|\bдесятилетием\b)=\1<td5> \2=gI
s=([0-9]+)\s(\bвеке\b|\bстолетии\b|\bтысячелетии\b|\bдесятилетии\b)=\1<td6> \2=gI
s=([0-9]+)\s(\bвеку\b|\bстолетию\b|\bтысячелетию\b|\bдесятилетию\b)=\1<td3> \2=gI
s=([0-9]+)\s\b(века|десятилетия|месяца|поколения|столетия|тысячелетия|уровня)\b=\1<td2> \2=gI
s=([0-9]+)\s(\bвекам\b|\bстолетиям\b|\bтысячелетиям\b|\bдесятилетиям\b)=\1<td3> \2=gI
s=([0-9]+)\s(\bвеками\b|\bстолетиями\b|\bтысячелетиями\b|\bдесятилетиями\b)=\1<tf5> \2=gI
s=([0-9]+)\s(\bвеках\b|\bстолетиях\b|\bтысячелетиях\b|\bдесятилетиях\b)=\1<ta6> \2=gI
#  в 1991 году =
s=\b(следующем,)\s([0-9]+),?\s\b(году)\b=\1 \2-м годУ=gI
s=<Дп>([0-9]+)\s(\bгоду\b|\bг\.|\bгод\.?\b)=\1-ому гОду=gI
s=<Рп>([0-9]+)\s(\bгоду\b|\bг\.|\bгод\.?\b)\s(\bпрошёл\b)=\1-м годУ \3 =gI
s=<Рп>([0-9]+)\s?-\s?(\bом\b|\bем\b)\s(\bгоду\b|\bг\.)=\1-м годУ=gI
s=([0-9]+)\s(\bгоду\b|\bг\.)=\1-м годУ=gI
s=([0-9]+)\s?-\s?(\bом\b|\bем\b)\s(\bгоду\b|\bг\.)=\1-м годУ=gI
#  в 1991 год =
s=<Рп>([0-9]+)\s\b(год|отсек)\b=\1<td1> \2=gI
s=<Рп>([0-9]+)\s\b(окончил|полку)\b=\1<tc6> \2 =gI
s=<Рп>([0-9]+)(\s?-?\s?)([0-9]+)\s\b(командир|командующий|начальник)\b=\1<tc6>\2\3<tc6> \4=gI
#  с 1991 года =
s=<Рп>([0-9]+)\s(\bг\.|\bгод\.?\b|\bгода\b)=\1<td2> гОда=gI
#  с 1991 годом =
s=<Рп>([0-9]+)\s(\bгодом\b)=\1<tc5> годом=gI
#  в 1991-1992 гг =
s=<Рп>([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s(\bгодах\b|\bгг\.|\bгод\.?\b)=\1<td6> \2 \3<td6> годах=gI
#  до 1991-1992 гг =
s=(\bкон\.|\bконца\b|\bконце\b|\bконцу\b|\bна\b\s\bрубеже\b)\s([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s(\bгодов\b|\bгг\.|\bгод\.?\b)=\1 \2<td2> \3 \4<td2> годов=gI
#  к 1991-1992 гг =
s=<Дп>([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s(\bгодов\b|\bгг\.|\bгод\.?\b)=\1<td3> \2 \3<td3> годам=gI
#  в 1991-1992 году =
s=<Рп>([0-9]{2,4})\s(\bи\b|-)?\s?([0-9]{2,4})\s(\bгоду\b)=\1-м \3-м годУ=gI
#  1991 (1992) года =
s=([0-9]+)\s\(([0-9]+)\)\s(\bгода\b)=\1<td2> (\2<td2>) гОда=gI
#  1991-1992 годами =
s=([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s(\bгодами\b)=\1-ым \2 \3-ым \4=gI
#  1991-1992 годов =
s=([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s(\bгодов\b)=\1<td2> \2 \3<td2> \4=gI
#  1991-1992 годы =
s=([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s(\bгоды\b)=\1<td4> \2 \3<td4> \4=gI
# в 1996 и в 1997 годах =
s=([0-9]{2,4})\s?(\bи\b|-)\s?(\bв\b\s)?([0-9]{2,4})\s(\bгодах\b)=\1-м \2 \4-м \5=gI
#  в 1991-1992 =
s=<Рп>([0-9]+)\s?([,-])\s?([0-9]+)\s(\bмм\b)=\1<ta2> \3<ta2> миллиметров=gI
s=<Рп>([0-9]+)\s?([,-])\s?([0-9]+)\s?-\s?м\b=\1<tc6> \3<tc6>=gI
s=<Рп>([0-9]+)\s?-\s?([0-9]+)\s?-\s?е\b=\1<tf4> \2<tf4>=gI
# на 1991-1992 гг =
s=<Вп>([0-9]+)\s?-?\s?([0-9]+)\s(\bгг\.)=\1<td4> - \2<td4> года=gI
#  1991-1992 гг =
s=([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s(\bгодов\b|\bгг\.|\bгод\.?\b)=\1<td2> \2 \3<td2> годов=gI
#  в 90-е =
s=<Рп>([0-9]+)\s?-\s?(\bе\b)=\1<tf1>=gI
#  в 90-х гг =
s=<Рп>([0-9]+)(-(\bx\b|\bх\b|\bых\b))\s(\bгг\.)=\1<tf2> годах=gI
#  до 90-х гг =
s=(\bкон\.)\s([0-9]+)\s(-(\bx\b|\bх\b|\bых\b))\s(\bгг\.)=конец \2<tf2> годов=gI
#  к 90-х гг =
s=<Дп>([0-9]+)(-(\bм\b|\bым\b))\s(\bгг\.)=\1<td5> годам=gI
s=\b(в конце)\b\s([0-9]+)(-\bх\b)\s(\bгг\.)=\1 \2<tf6> годов=gI
#  в 19 веке =
s=<Рп>([0-9]+)\s(\bвеке\b|\bв\b|\bв\.)=\1-м веке=gI
#  к 1991 году =
s=<Дп>([0-9]{2,4})(\s(\bгоду\b|\bг\.|\bгод\.))=\1-ому гОду=gI
#  к 1991-1992 году =
s=<Дп>([0-9]{2,4})\s?(\bи\b|-)?\s?([0-9]{2,4})(\s(\bгоду\b|\bг\.|\bгг\.|\bгод\.))=\1-ому \3-ому гОду=gI
#  на 1991 год =
s=<Вп>([0-9]+)\s(\bг\.|\bгод\.?\b)=\1-ый год=gI
s=<Вп>([0-9]+)\s(\bгода\b)=\1<tg1> года=gI
#  о 1945 годе =
s=<Пп>([0-9]+)\s(\bгоде\b|\bг\.|\bгод\.?\b)=\1-м гОде=gI
#  начале 19 в =
s=(\bначале\b)\s([0-9]+)\s(\bв\b)=\1 \2<td2> века=gI
#  на 5 холмах =
s=<Вп>([0-9]+)\s(\bхолмах\b)=$-го \2=gI
#  за 1991-1992 =
s=(\bза\b)\s([0-9]{4})\s?([,-])\s?([0-9]{4})=\1 \2-ый \4-ый=gI
#  на протяжении 1991 =
s=(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s([0-9]+)\s?(\bсекунды\b|\bсек\.?\b)=\1 \2<t2><sec>=gI
s=(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s([0-9]+)\s?(\bминуты\b|\bмин\.?\b)=\1 \2<t2><min>=gI
s=(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s([0-9]+)\s?(\bчаса\b|\bчас\.?\b)=\1 \2<t2><hr>=gI
s=(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)\s([0-9]+)\s?(\bмесяца\b|\bмес\.?\b)=\1 \2<ta2><mnth>=gI
s=(\bу\b|\bтечение\b|\bтечении\b|\bпротяжении\b|\bвдоль)(\s([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+))?\s([0-9]+)\s(([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s)?(\bлет\b|\bдней\b|\bнедель\b|\bминут\b|\bчасов\b|\bсекунд\b)=\1\2 \4<ta2> \5\7=gI
s=(\bболее\b|\bвдоль\b|\bпротяжении\b|\bтечение\b|\bтечении\b|\bу\b)\s([0-9]+)\s?(\bнедели\b)=\1 \2<tb2><wek>=gI
s=(\bв течение|до|ниже\b)\s([0-9]+)\s?([,-])\s?([0-9]+)=\1 \2<tc2> \4<tc2>=gI
s=\b(у|года|течение|течении|протяжении|вдоль)\b\s([0-9]+)([^0-9-])=\1 \2<td2>\3=gI
#  стоит в 5 раз =
s=(\bстоит\b)\s(\bв\b)\s([0-9]+)\s(\bраз\b)=стОит \2 \3 \4=gI
#  18 века =
s=([0-9]+)(\s?|-|\s?)\b(века|класса|Кольта|мотострелкового|отделения|ранга|радиуса|управления)\b=\1<td2> \3=gI
#  1991 и 1992 года =
s=([0-9]{1,2})\s([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s([0-9]{2,4})\s(\bгода\b)=\1<td2> \2 \3<td2> \4=gI
#  по 1991 году =
s=<Вп>([0-9]{2,4})\s(\bгоду\b)=\1<td3> \2=gI
#  1991 года =
s=((\bянваря\b|\bфевраля\b|\bмарта\b|\bапреля\b|\bмая\b|\bиюня\b|\bиюля\b|\bавгуста\b|\bсентября\b|\bоктября\b|\bноября\b|\bдекабря\b)\s)?([0-9]{2,4})\s(\bг\.)=\1\3<td2> гОда=gI
s=\b(автор(\w+)?|возраст(\w+)?|для|свои|технолог(\w+)?)\b\s([0-9]+)\s(\bгода\b)=\1 \5<td2> гОда=gI
s=([0-9]{2,4})\s(\bгода\b)=\1<td2> гОда=gI
#  18 годам =
s=([0-9]+)\s(\bгодам\b)=\1<ta3> \2=gI
#  18 годах =
s=([0-9]+)\s(\bгодах\b)=\1-х \2=gI
#  квартале 1991 год. =
s=(\bквартал)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?\s([0-9]{2,4})\s(\bгод\.|\bг\.)=\1\2 \3-ого гОда=gI
#  1991 годов =
#([0-9]+)\s?-?\s?х?\b\s(\bгодов\b)=\1<tf2> \2
#  1991 годом =
s=([0-9]{2,4})\s(\bгодом\b)=\1-ым \2=gI
#  1991 году =
s=([0-9]{2,4})\s(\bгоду\b)=\1<td6> \2=gI
#  1991 год =
s=([0-9]{4})\s(\bгод\b|\bг\.)=\1-ый год=gI
#  год 1991 =
s=(\bгод\b)\s([0-9]{4})=\1 \2-ый=gI
#  10-е годы =
s=([0-9]+)\s?-\s?(\bе\b)\s(\bгоды\b)=\1<tf1> \3=gI
#  10-й =
s=([0-9]+)\s?-\s?(\bй\b)\s\b(был|оперативный)\b=\1-ый \3=gI
#  Конец 1993 =
s=(\bконец\b|\bначало\b|\bсередина\b)\s([0-9]+)\s?-\s?(\bй\b)=\1 \2<te3>=gI
s=(\bконец\b|\bначало\b|\bсередина\b)\s([0-9]+)\s?-\s?(\bх\b)=\1 \2<tf2>=gI
s=(\bконец\b|\bначало\b|\bсередина\b)\s([0-9]+)=\1 \2<td2>=gI
#  зимой 1993 =
s=(\bзим|\bвесн|\bлет|\bосен)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s([0-9]+)\s\(([0-9]+)\)=\1\2 \3<td2> (\4<td2>)=gI
s=(\bзим|\bвесн|компани|\bлет|\bосен)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s([0-9]+)\s?-\s?го=\1\2 \3<td2>=gI
#  новая строка - 1,2,3... - новая строка =
s=([\r\n]{2})([0-9]+)([\r\n]{2})=\1глава \2\3=gI
#  эпизод 1 =
s=\b(квартал|конгресс|образц|раздел|эпизод)(\w+)?\s([0-9]+)\s(\bгода\b|\bгод\.|\bг\.)=\1\2 \3<tc2> гОда=gI
s=(\bэпизод\b|\bраздел\b|\bквартал\b)\s([0-9]+)([^<0-9+-])?=\1 \2-ый\3=gI
#  глава 1 =
s=(\bглава\b|\bЗапись\b|\bчасть\b|\bкнига\b|\bсерия\b)\s([0-9]+)([^<0-9+-])?=\1 \2-я\3=gI
#  1 серия =
s=([0-9]+)\s(\bсерия\b|\bглава\b|\bчасть\b)=\1-я \2...=gI
#  блабла 1 =
s=\b(состава)\b\s([0-9]+)=\1 \2<te2>=gI
s=\b(пчела)\b\s([0-9]+)=\1 \2<tg1>=gI
s=\b(датирована)\b\s([0-9]+)=\1 \2<td2>=gI
# в =
s=(\bза\b)\s([0-9]+)\s(\bквартал\b|\bкв\.)=\1 \2-ый квартал=gI
s=<Рп>([0-9]+)\s(\bквартале\b|\bкв\.)=\1-м квартале=gI
s=(\bконца\b|\bконце\b|\bсередине\b|\bначале\b|\bтечение\b)\s([0-9]+)\s(\bквартала\b|\bкв\.)=\1 \2-ого квартала=gI
s=<Рп>([0-9]+)\s((\w+)?метрах)\b=\1-их \2=gI
#  до 5 лет =
s=<Рп>([0-9]+)\s(\bлет\b|\bчасов\b)=\1<ta2> \2=gI
s=(\bмоложе\b|\bстарше\b|\bиз-за\b)\s([0-9]+)\s(\bлет\b|\bчасов\b)=\1 \2<ta2> \3=gI
s=<Рп>([0-9]+)\s(\bмес\.|\bмесяца\b)=\1<t2><mnth>=gI
s=(\bмоложе\b|\bстарше\b|\bиз-за\b)\s([0-9]+)\s(\bмес\.|\bмесяца\b)=\1 \2<t2><mnth>=gI
s=<Рп>([0-9]+)\s(\bнедели\b)=\1<tb2><wek>=gI
s=(\bмоложе\b|\bстарше\b|\bиз-за\b)\s([0-9]+)\s(\bнедели\b)=\1 \2<tb2><wek>=gI
s=<Рп>([0-9]+)\s(\bгода\b)=\1<td2> \2=gI
s=(\bмоложе\b|\bстарше\b|\bиз-за\b)\s([0-9]+)\s(\bгода\b)=\1 \2<td2> \3=gI
#  около 5 лет =
s=<Ип>([0-9]+)\s\b(военнослужащих)\b=\1<th2> \2=gI
#  =
s=(\bвозрасте\b)\s([0-9]+)=\1 \2<ta2>=gI
#  2 половине =
s=([0-9]+)\s(\bэпохе\b|\bполовине\b|\bдекаде\b)=\1-й \2=gI
#  2-ой половине =
s=([0-9]+)\s?(-)\s?(\bой\b)\s(\bэпохе\b|\bполовине\b|\bдекаде\b)=\1-й \4=gI
#  18-20=
s=([0-9]+)\s?-?\s?([0-9]+)\s(\bлетн)=\1<th2> \2<th2> \3=gI
s=([0-9]+)\s?-?\s?([0-9]+)\s\b(созывов)\b=\1<tc2> \2<tc2> \3=gI
s=<Вп>([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s\b(годы)\b=\1<td1> \2 \3<td1> \4=gI
s=([0-9]{2,4})\s?(\bи\b|-)\s?([0-9]{2,4})\s\b(годы)\b=\1<tf1> \2 \3<tf1> \4=gI
s=<Рп>([0-9]+)\s(часов)\s([0-9]+)\s(минУт)=\1<ta2> \2 \3<ta2> \4=gI
s=(ая|ых)\b\s(км/ч(ас)?)=\1 километра в час=gI

########################/=
#    Порядковые числительные =
########################=
#  коррекция сокращений числительных =
s=([0-9]+)-ом=\1-м=gI
s=3-ем=3-м=gI
#  =
s=([0-9]+)\s(\bти\b|\bго\b|\bх\b)=\1-\2=g
s=(\bиз\b|\bк\b)\s([0-9]+)\s(\bй\b)=\1 \2-й=g
s=([0-9]+)\s(\bй\b)=\1-ый=g
s=([0-9]+)\s(\bю\b)=\1-\2=g
s=([0-9]{2,4})\s(\bе\b)=\1-ые=g
#  3%-ах =
s=([0-9]+)\s?(%)-(а?х\b)=\1<t6><per>=gI
#  в 2 раза =
s=<Рп>([0-9]+)\s?-?\s\b(раза)\b=\1<tg1>  \2=gI
#  1-ая =
s=([0-9]+)\s?-\s?(ая\b)=\1-я=gI
s=([0-9]+)\s\b(бронемашины|дивизии|моторизованная|танковая)\b=\1<tb1> \2=gI
# 3-ей =
s=<Дп>([0-9]+)\s-\sй\b\s\b(дивизии)\b=\1-й \2=gI
s=([0-9]+)\s?-\s?(ей\b)=\1-й=gI
#  с 5-го =
s=<Рп>([0-9]+)\s?(-?)\s(\bпо\b)\s([0-9]+)\s?-\s?(й\b)=\1<td2> \3 \4<td1>=gI
s=<Рп>([0-9]+)\s?-\s?(го\b)=\1<td2>=gI
s=([0-9]+)\s(и)\s([0-9]+)\s?-\s?(го\b)=\1<td2> \2 \3<td2>=gI
s=([0-9]+)\s?-\s?(е?го\b)=\1<td2>=gI
#  1991-е-ые =
s=([0-9]{4})\s?-\s?(е\b)=\1-ые=gI
#  20-е=
s=<Рп>([0-9]+)\s?-\s?е\b=\1-ые=gI
s=([0-9]+)\s?-\s?е\b\s\b(оперативное)\b=\1<tc1> \2=gI
s=([0-9]+)\s?-\s?е\b=\1-ые=gI
#  20-и=
s=([0-9]+)\s?-\s?и\b=\1-их=gI
#  33-ий =
s=([0-9]+)\s?-\s?(го\b)(\s(\w+))?\s(\bпо\b)\s([0-9]+)\s?-\s?(ий\b)=\1-ого\3 \5 \6-ый=gI
s=([0-9]+)\s?-\s?(ий\b)=\1-ый=gI
#  2-й =
s=<Рп>([0-9]+)\s?-\s?й\b\s((\w+)(ой)\b)=\1<te2> \2=gI
s=<Рп>([0-9]+)\s?-\s?й\b\s((\w+)(ый)\b)=\1<td4> \2 =gI
s=<Рп>([0-9]+)\s?-\s?й\b=\1-й=gI
s=<Вп>([0-9]+)\s?-\s?й\b=\1-й=gI
s=([0-9]+),\s([0-9]+)\s(и)\s([0-9]+)\s?-\s?й=\1-й, \2-й \3 \4-й=gI
s=([0-9]+)\s?-\s?й\b\s\b(отдел|полк|учебный|(\w+)?\s?фронт)\b=\1<td1> \2=gI
s=\b(бригад|как|направлени|нашей|отдел|полк|разведк|усилени|штаб)(\w+)?\s([0-9]+)\s?-\s?й\b=\1\2 \3<te3>=gI
s=([0-9]+)\s\b(армейской|артиллерийской|пехотной|стрелковой|танковой)\b=\1<te3> \2=gI
#([0-9]+)\s?-\s?й\b=\1-й
#  20-ка=
s=([0-9]+)\s?-\s?(\bка\b)=\1-го=gI
#  20-м=
s=<Рп>([0-9]+)\s?-\s?м\b\s\b(полком|флотом)\b=\1-ым  \2=gI
s=([0-9]+)\s?-\s?м\b\s(\bполком\b)=\1<tc5> \2=gI
s=([0-9]+)\s?-\s?м\b=\1-м=gI
#  300-ми-им =
s=(\bза\b)\s([0-9]+)\s?-\s?(\bми\b)=\1 \2-им=g
#  20-му=
s=([0-9]+)\s?-\s?е?му\b\sи\s([0-9]+)\s?-\s?му\b=\1-ому и \2-ому=gI
s=([0-9]+)\s?-\s?му\b=\1-ому=gI
s=([0-9]+)\s?-?\s?му\b\s\b(миллиметрам)\b=\1-ому \2=gI
s=([0-9]+)\s?-\s?(\bое\b)=\1-е=gI
#  с 21-м-ым =
s=<Рп>([0-9]+)\s?-\s?\bм\b\s(\bгоду\b)=\1-м \2=gI
s=<Рп>([0-9]{4})\s?-\s?\bм\b=\1-м=gI
s=<Рп>([0-9]+)\s?-\s?\bм\b=\1-ым=gI
#  2-мя-им =
s=([0-9]+)\s?-\s?(\bмя\b)=\1-им=gI
#  21-ого= 
s=([0-9]+)\s?-?\s?(ого\b)=\1-ого=gI
#  21-ой-й =
s=([0-9]+)\s?-\s?(\bой\b)=\1-й=gI
#  в 5-ом =
s=<Рп>([0-9]+)\s?-\s?(\bом\b)=\1 \2-м=gI
s=\b(далёком)\b\s([0-9]+)\s?-\s?(ом\b)=\1 \2-м=gI
#  к 21-ому =
s=<Дп>([0-9]+)\s?-\s?(ому)\b=\1-ому=gI
#  21-ти-ой =
s=([0-9]{2,4})\s?-\s?(\bти\b)=\1-го=gI
s=([0-9]+)\s?-\s?(\bти\b)=\1-ой=gI
#  20-ть =
s=([0])\s?-\s?(\bть\b)=\1=gI
#  5-му=
s=([0-9]+)\s?-\s?у\b=\1-ому=gI
#  5-ую=
s=([0-9]+)\s?-\s?(\bую\b)=\1-ю=gI
#  3-х=
s=<Вп>([0-9]+)\s?-\s?х\b=\1<tp2>=gI
s=([0-9]+)\s?-\s?х\b\s\b(крейсеров|русских)\b=\1<ta2> \2=gI
s=([0-9]+)\s?-\s?х\b\s\b(метровую)\b=\1<tb3> \2=gI
s=(ало\b|али\b|ала\b|ал\b)\s([0-9]+)\s?-\s?(\bм\b)=\1 \2-ым=gI
#  21-й-ый =
s=([0-9]+)\s?-\s?(\bй\b)\s\b((\w+)(кой))\b=\1<te3> \3=gI
s=([0-9]+)\s?-\s?(\bй\b)\s\b((\w+)(кий|ный))\b=\1<td1> \3=gI
s=([0-9]+)\s?-\s?(\bй\b)\s\b(([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ]\w+))\b=\1<te3> \3=g
s=([0-9]+)\s?-\s?(\bй\b)\s\b(век|год|день|дивизион|закон|квартал|класс|концерт|месяц|номер|пакет|по счету|поворот|приз|проем|раз|размер|розыгрыш|сезон|транш|тур|флот|час|этаж|этап|)\b=\1-ый \3=gI
s=([0-9]+)\s?-\s?(\bй\b)\s((\w|-)+)(кий\b|ный\b)=\1 \3\4=gI
s=([0-9]+)\s?-\s?(\bй\.)=\1-ый.=gI
#  21 ый =
s=([0-9]+)\s(\bый\b)=\1-\2=gI
#  до 3-х-го =
s=<Рп>([0-9]+)\s?-?\s([0-9]+)\s\b(из)\b=\1<th6> - \2<th6> \3=gI
s=([0-9]+)-(\bx\b|\bи\b)\s(\bлет\b|\bдней\b|\bнедель\b|\bминут\b|\bчасов\b|\bсекунд\b)=\1 \3=gI
s=<Рп>([0-9]+)\s?-\s?(\bи\b)=\1-их=gI
s=<Рп>([0-9]+)\s?-\s?(х\b)=\1<tf2>=gI
#\b(клипов|конец|конце|начале|образца|половине|фильмах)\b\s([0-9]+)\s?-\s?х\b=\1 \2<tf6>
#([0-9]+)\s?-\s?х\b=\1-ой
#  27-ю группами =
s=<Рп>([0-9]+)\s?-\s?(\bю\b)=\1-ю=gI
s=\b(ту же)\b\s([0-9]+)\s?-\s?ю\b=\1 \2<te4>=gI
s=([0-9]+)\s?-\s?(\bю\b)\s((\w|-)+)(ами\b)=\1-им \3\4=gI
s=([0-9]+)-\b(ю)\b\s\b(британскими)\b=\1<ta5> \3=gI
s=([0-9]+)\s?-\s?ю\b=\1-ю=gI
#  27-я=
s=<Рп>([0-9]+)\s?-\s?я\b=\1-я=gI
s=([0-9]+)\s?-\s?я\b=\1-я=gI
##############################=
#    Количественные числительные =
##########################=
#  8-летним =
s=([0-9]+)\s?(\bлетн)(его\b|ий\b|ему\b|им\b|ем\b|яя\b|ей\b|юю\b|ею\b|ее\b|их\b|ие\b|ими\b)=\1-\2\3=gI
s=([2-9]|[0-9]{2,})\s?(-)\s?(\bлетн)(его\b|ий\b|ему\b|им\b|ем\b|яя\b|ей\b|юю\b|ею\b|ее\b|их\b|ие\b|ими\b)=\1-го del_space \3\4=gI
s=(1)\s?(-)\s?(\bлетн)(его\b|ий\b|ему\b|им\b|ем\b|яя\b|ей\b|юю\b|ею\b|ее\b|их\b|ие\b|ими\b)=\1-о del_space \3\4=gI
#  14-часового =
s=([0-9]+)-([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)(ого\b|ное\b)=\1<ta6> \2\3=gI
#  итогам 1990 г =
s=(\bитогам\b|\bконце\b|\bпосле\b)\s([0-9]+)\s?(\bгода\b|\bг\.)=\1 \2-ого гОда=gI
#  итогам 10 =
s=\b(итогам|младше|после)\b\s([0-9]+)=\1 \2<ta2>=gI
s=([0-9]+)\s?-?\s?\b(дневную|калиберные|орудийная|суточную|танков)\b=\1<ta2> \2=gI
#  2 - 3  =
s=([0-9]+)\s?-?\s?([0-9]+)\s\b(кабельтовых|метрах)\b=\1<ta6> \2<ta6> \3=gI
s=<Вп>([0-9]+)\s?-?\s?([0-9]+)\s\b(кирпича)\b=\1<tg1> - \2<tg1> \3=gI
s=<Рп>([0-9]+)\s?-?\s?([0-9]+)\s\b(родственников)\b=\1<th2> - \2<th2> \3=gI
s=<Рп>([0-9]+)\s?-?\s?([0-9]+)\s\b(метра)\b=\1<tg1> - \2<tg1> \3=gI
#  2 миллиметров =
s=<Рп>([0-9]+)\s?-?\s?\b(мм)\s\b(дневной|калиберной|малой|орудийной)\b\b=\1<ta6> миллиметровой=gI
s=\b(оба)\b\s([0-9]+)\s?-?\s?\b(мм)=\1 \2<th2> миллиметровых=gI
#  2 миллиметровая =
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровая)\b(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(батарея|бронепалуба|гаубица|граната|зенитка|камера|пукалка|пушка|танковая|установка|\S+ная)\b=\1<ta6> миллиметровая \4 \5=gI
#  2 миллиметровкой =
s=([0-9]+)\s?-\s?\b(миллиметровкой)\b=\1<tb2> \2=gI
# 2 миллиметрового =
s=([0-9]+)\s?-?\s?\b(мм|миллиметрового)\b((\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(калибра|мином[её]та|пистолета|пулем[её]та|орудия|снаряда|эрликона|\S+(кого|вого))\b)=\1<ta2> миллиметрового \4 \5=gI
#  2 миллиметровое =
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровое)\b(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(орудие)\b=\1<ta6> миллиметровое \4 \5=gI
#  2 миллиметровой =
s=([0-9]+)?\s?-?\s?([0-9]+)\s?-?\s?\b(мм|миллиметровой)\b((\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(автоматической|батарее|броне|гаубицы|гранате|зенитки|зенитной|камер(е|ы|ой|ою)|пукалкой|пушк(и|ой)|самоходной|счетвер[её]нной|установкой)\b)=\1<ta6> - \2<ta6> миллиметровой \4=gI
s=\b(вооруж[её]нная|гладкоствольной|длинной|наименования|своей)\b\s([0-9]+)(\s?-?\s?)\b(мм|миллиметровой)=\1 \2<ta6> миллиметровой=gI
# 2 миллиметровом =
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровом)\b((\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(калибре|пистолете|пулем[её]те|орудии)\b)=\1<ta6> миллиметровом \4=gI
# 2 миллиметровому =
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровому)\b(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(калибру|пистолету|пулем[её]ту|орудию)\b=\1<ta6> миллиметровому \4 $=gI
#  2 миллиметровую =
s=\b(имеет|пустил)\s\b([0-9]+)(\s?-?\s?)\b(мм|миллиметровую)=\1 \2<tb3> миллиметровую=gI
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровую)\b(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(батарею|броню|гаубицу|гранату|зенитку|камеру|пукалку|пушку|самоходку|установку)\b=\1<ta6> миллиметровую \4 \5=gI
#  2 миллиметровые =
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровые)\b(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(автоматы|батареи|гаубицы|гранаты|зенитки|зенитные|калибры|камеры|колотушки|мином[её]ты|орудия|пистолеты|пукалки|пулем[её]ты|пушки|самоходные|снарядики|снаряды|стволы|установки)\b=\1<ta6> миллиметровые \4 \5=gI
s=\b(мощные)\b\s([0-9]+)(\s?|-?)\b(мм|миллиметровые)=\1 \2<ta6> миллиметровые=gI
#  2 миллиметровый =
s=([0-9]+)\s?-?\s\b(мм|(\w+)?метровый)\b(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s(выстрел|калибр|мином[её]т|осветительный|пистолет|подкалиберный|пулем[её]т|снаряд|эрликон|\S+ский)\b=\1<ta6> миллиметровый \4 \5=gI
#  2 миллиметровым =
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровым)\b(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(батареям|гаубицам|гранатам|зениткам|калибрам|калибром|камерам|мином[её]там|пистолетам|пукалкам|пулем[её]там|пушкам|оруди[ея]м|снарядом|эрликоном)\b=\1<ta6> миллиметровым \4 \5=gI
#  2 миллиметровыми =
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровыми\b)(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(батареями|гаубицами|гранатами|зенитками|калибрами|камерами|мином[её]тами|орудиями|пистолетами|пулем[её]тами|пушками|скорострелками|снарядами|эрликонами)\b=\1<ta6> миллиметровыми \4 \5=gI
#  2 миллиметровых =
s=<Рп>([0-9]+)\s?-?\s?\b(мм|миллиметровых)\s(болванок)\b=\1<ta6> миллиметровых \3=gI
s=\b(длинноствольных)\b\s([0-9]+)\s?-?\s?\b(мм\b)=\1 \2<ta6> миллиметровых=gI
s=([0-9]+)(\s?-?\s?)\b(мм|миллиметровых\b)(\s[абвгдеёжзийклмнопрстуфхцчшщъыьэюя-]+)?\s\b(батарей|болванок|гаубиц|гранат|зениток|калибров|камер|мином[её]тов|орудий|пистолетов|пукалками|пулем[её]тов|пушек|скорострелок|снарядов|стволов|танковых|эрликонов)\b=\1<ta6> миллиметровых \4 \5=gI
#  на 2 месте =
s=<Вп>([0-9]+)\s\b(ладу|месте)\b=\1-м \2=gI
#  1 созыва =
s=([0-9]+)\s(\bсозыва\b|\bсъезда\b|\bчисла\b)=\1-ого \2=gI
#  недели 2-3 / недели 2 =
s=(\bнедели\b|\bштуки\b)\s([0-9]+)\s?-\s?([0-9]+)=\1 \2<tb1> \3<tb1>=gI
s=\b(выиграв|недели|проведя|штуки)\b\s([0-9]+)\b=\1 \2<tb1>=gI
#  по 1 экз =
s=<Вп>(([0-9]+)?([02-9])(1)|(1))\s(\bэкз\.?\b)=\1-му экземпляру=gI
s=<Вп>(([0-9]+)?([02-9])([2-4])|([2-4]))\s(\bэкз\.?\b)=\1<tg1> экземпляра=gI
s=<Вп>([0-9]+)\s(\bэкз\.?\b)=\1<tb1> экземпляров=gI
#  ст. 1 =
s=(\bст\.)\s?([0-9]+)=статья \2-я=gI
#  5-звездочных =
s=([0-9]+)\s?-\s?(\bзвезд|\bмароч|\bкамерн|километровой|\bкомнатн|\bдверн|\bстворч|\bсторонн|\bклапанн)=\1<ta2> \2=gI
#  т. 1 =
s=(\bт\.)\s?([0-9]+)=том \2-ый=gI
s=([0-9]+)\s?-\s?(дневный|милионной|недель|орудийную|тонных|тысячетонный|тысячники|тысячных|часовой|рядная)\b=\1<tb2> \2=gI
#  2-3=
s=([0-9]+)\s?([,-])\s?([0-9]+)\s\b(дивизии|мили)\b=\1<tb4> \2 \3<tb4> \4=gI
s=\b(гарнитур|дюймов|минут|недель|пары|штук|узлов|через)\b\s([0-9]+)\s?-\s?([0-9]+)=\1 \2<tb4> \3<tb4>=gI
s=([0-9]+)\b\s\b(внутренние|войны|гарнитуру|заправку|машины|неделю|пару|позиции|раза|секунды|сумки|танковые|штуку)\b=\1<tb4> \2=gI
s=([0-9]+)\s\b(отделение|почтовое|число)\b=\1<tc1> \2=gI
s=([0-9]+)\s(\bи\b)\s([0-9]+)\s(полков)=\1<tc2> \2 \3<tc2> \4=gI
s=([0-9]+)\b\s\b(патрону)\b=\1<tc3> \2=gI
# в  =
s=<Рп>([0-9]+)\s?-?\s([0-9]+)\s\b(тонн)\b=\1<tg1> - \2<tg1> \3=gI
s=\b(больше)\b\s([0-9]+)\s\b(метров|тонн)\b=\1<tg1> \2=gI
s=<Рпо>([0-9]+)\s\b(метров|тонн)\b=\1<tg1> \2=gI
s=<Рп>([0-9]+)\s\b(метров|тонн)\b=\1<th2> \2=gI
s=<Рп>([0-9]+)\s\b(ночи)\b=\1<th1> \2=gI
s=<Рп>([0-9]+)\s\b(и|лет|ступеньки)\b=\1-и \2=gI
s=<Рп>([0-9]+)\s\b(магазинов)\b=\1-их \2=gI
s=<Рп>([0-9]+)\.=\1-их.=gI
# =
s=\b(год|том)\b\s([0-9]+)\b=\1 \2<td1>=gI
#  2-ого=
s=<Рп>([0-9]+)\s(\bраза\b)=\1<td2> \2=gI
#  вторая=
s=([0-9]+)\b\s\b(база|категория)\b=\1<te1> \2=gI
#  второй=
s=([0-9]+)\s\b(заставе)\b=\1<te2> \2=gI
#  вторую=
s=([0-9]+)\b\s\b(комнату|линию|мировую|роту|сд)\b=\1<te4> \2=gI
#  первый=
s=([0-9]+),\s([0-9]+),\s([0-9]+)\s\b(кузова)\b=\1<td4>, \2<td4>, \3<td4> кузовА=gI
s=([0-9]+),\s([0-9]+)\s\b(кузова)\b=\1<td4>, \2<td4> кузовА  =gI
s=([0-9]+),\s([0-9]+)\s?(-|и)?\s?([0-9]+)\s\b(кузова)\b=\1<td4>, \2<td4>\3 \4<td4> кузовА =gI
s=([0-9]+)\s(-|и)?\s?([0-9]+)\s\b(кузова)\b=\1<td4> \2 \3<td4> кузовА =gI
#  одно=
s=([1])\b\s?(-)?\s?\b(дюймовый|значный|кол[её]сном|летняя|литровый|сильного|\w+овый)\b=\1<th1>\2 \3=gI
s=([0-9]+)\s?(-)?\s?\b(дюймов(ого|ое|ом|ые|ый)|значн(ого|ое|ом|ые|ый)|кол[её]сн(ого|ое|ом|ые|ый)|летняя|литров(ого|ое|ом|ые|ый)|орудиях|сильн(ого|ое|ом|ые|ый)|\w+(ным|овым|ого|ыми))\b=\1<th6>\2 \3=gI
#  одного=
s=([1])\b\s?(-)?\s?\b(мигранта)\b=\1<th2>\2 \3=gI
#  трёх=
s=\b(в количестве)\b\s([0-9]+)\s\b(человек)=\1 \2<th2> \3=gI
s=([0-9]+)\s?(-)?\s?\b(балльн(ого|ых)|батарейн(ого|ых)|башен(ого|ых)|вальную|дюймов(ого|ых)|кормов(ого|ых)|орудийн(ого|ых)|пушечн(ого|ых)|саженной)=\1<th2>\2 \3=gI
#  = 
s=([0-9]+)\s?(-)?\s?\b(вольтами|магазинами|орудиями|патронами|пулем[её]тами|снарядами|фугасами)\b=\1<th5>\2 \3=gI
s=([0-9]+)\s(и|или)\s([0-9]+)\s?-?\s?\b(кузова|мерседесы)\b=\1<tf1> \2 \3<tf1> \4=gI
s=([0-9]+)\s?-?\s?\b(кузова|мерседесы)\b=\1<tf1> \2=gI
s=([0-9]+)\s(и|или)\s([0-9]+)\s?\b(единице|степени)\b=\1<te6> \2 \3<te6> \4=gI
s=<Рп>([0-9]+)\s?-?\s?\b(мм|миллиметров)\b=\1<ta6> миллиметров=gI
s=([0-9]+)\s?-?\s?\b(миллиметров|моторизованный)\b=\1<tg1> \2=gI
s=([0-9]+)\s?(-)?\s?(\bмм\b)=\1-и миллиметров=gI
s=([0-9]+)\s?-?\s?\b(миллиметровых)\b=\1<ta3> \2=gI
s=\b(калибр(\w+)?)\s\b([0-9]+)\s?(-)?\s?(\bмм\b)=\1 \3<tg1> миллиметра=gI
# 3-х =
s=([0-9]+)\s?-?\s?\b(дневную|калиберные|орудийная|суточную)\b=\1<ta2> \2=gI
#
#------------------------------------------------------------------------ =
s=<Вп>([0-9]+)\s?(-)?\s?([0-9]+)\s([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-и del_space \2 \3-и del_space \4\5\6=gI
s=<Вп>([0-9]+)\s?(-)?\s?([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-и del_space \3\4\5=gI
s=<Рп>([0-9]+)\s?(-)?\s?([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-и del_space \3\4\5=gI
s=<Ип>([0-9]+)\s?(-)?\s?([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-и del_space \3\4\5=gI
s=([0-9]+)\s?(-)?\s?([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-и del_space \3\4\5=gI
s=([0-9]+)\s?(-)?\s?([0-9]+)\s([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-и del_space \3-и del_space \4\5\6=gI
s=([0-9]+)\s?(-)?\s?(и?)\s?([0-9]+)\s?(-)?\s?([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-го del_space \3 \4-го del_space \6\7\8=gI
s=([0-9]+)\s?(-)?\s?([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=\1-го del_space \3\4\5=gI
#-----------------------------------------------------------------------------------------=
# 20 килотонной \ 20-килотонной =
s=([2-9]|[0-9]{2,})\s?(-)?\s?(\bкило|\bгига|\bмега|\bсанти|\bмили|\bметро|\bтонн)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(ая\b|ого\b|ое\b|ой\b|ом\b|ому\b|ою\b|ую\b|ые\b|ый\b|ым\b|ыми\b|ых\b)=\1-го del_space\3\4\5=gI
s=(1)\s?(-)?\s?(\bкило|\bгига|\bмега|\bсанти|\bмили|\bметро|\bтонн)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(ая\b|ого\b|ое\b|ой\b|ом\b|ому\b|ою\b|ую\b|ые\b|ый\b|ым\b|ыми\b|ых\b)=\1-о del_space\3\4\5=gI
##########################################/=
#  19 этаже\2 квартале\5 классе =
s=([0-9]+)\s(\bэтаже\b|\bквартале\b|\bклассе\b)=\1-м \2=gI
#  19 этаж\2 квартал\5 класс =
s=([0-9]+)\s(\bэтаж\b|\bквартал\b|\bкласс\b|\bэтап\b)=\1-ый \2=gI
#  200 летия \ 200-летия =
s=([2-9]|[0-9]{2,})\s?(-)?\s?(\bлети)(е\b|я\b|ю\b|ем\b|и\b)=\1-го del_space \3\4=gI
s=(1)\s?(-)?\s?(\bлети)(е\b|я\b|ю\b|ем\b|и\b)=\1-о del_space \3\4=gI
#  более 1% =
s=<Рп>([0-9]+)\s?(\x25)=\1<t2><per>=gI
s=<[ИВ]п>([0-9]+)\s?(\x25)=\1<t1><per>=gI
#  равная 1% =
s=(\bравная\b|\bравный\b|\bравное\b)\s([0-9]+)\s?(\x25)=\1 \2<t2><per>=gI
#  равная 1 =
s=(\bравная\b|\bравный\b|\bравное\b)\s([0-9]+)=\1 \2<ta3>=gI
#  в 1 книге =
s=(\bво\b|\bв\b|\bко\b|\bк\b)\s([0-9]+)\s(\bглаве\b|\bчасти\b|\bкниге\b|\bэпохе\b|\bполовине\b|\bдекаде\b)=\1 \2-й \3=gI
#  =
s=(\bглаве\b|\bчасти\b|\bкниге\b)\s([0-9]+)=\1 \2-й=gI
#  в 10 раз говорю =
s=<Рп>([0-9]+)\s(\bраз\b)\s(\bговорю\b|\bповторяю\b|\bпрошу\b)=\1-ый \2 \3=gI
#  в 10% случаев =
s=<Рп>([0-9]+)\s?(\x25)\s(\bслучаев\b)=\1<t2><per> \3=gI
#  в возрасте 10 =
s=(\bв\b)\s(\bвозрасте\b)\s([0-9]+)=\1 \2 \3-го=gI
# соотношение 2:3 =
s=(\bсоотношен|\bотношен)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\s([0-9]+)\s?:\s?([0-9]+)=\1\2 \3 к \4<ta3>=gI
# на 1000 =
s=<Вп>([0-9]+)([^<0-9-])=\1<tb4>\2=gI
#################################################################/=
#  Единицы измерения =
####################################################################/=
#  Время =
# около 18:45:18 =
s=<Ип>([0-9]{1,2})\s?:\s?([0-9]{1,2})\s?:\s?([0-9]{1,2})=\1<t2><hr> \2<t2><min> и \3<t2><sec>=gI
# около 18:00 =
s=<Ип>([0-9]{1,2})\s?:\s?(0+)=\1<t2><hr>=gI
# около 18:45 =
s=<Ип>([0-9]{1,2})\s?:\s?([0-9]{1,2})=\1<t2><hr> \2<t2><min>=gI
# 18:45:18 =
s=([0-9]+)\s?:\s?([0-9]+)\s?:\s?([0-9]+)=\1<t1><hr> \2<t1><min> \3<t1><sec>=gI
# 18:45 =
s=([0-9]+)\s?:\s?([0-9]+)=\1<t1><hr> \2<t1><min>=gI
#s= 18час\18ч ==gI
s=\b([0-9]{1,2})(<\S+>)?\s?(\bчас\.?\b|\bч\.?\b)=\1<ta1><hr>=gI
# на 1-2 мин =
s=<Вп>([0-9]{1,2})\s?-\s?([0-9]+)\s(\bмин\b|\bминуту\b|\bминуты\b|\bминут\b)=\1<tb4> - \2<t4><min>=gI
# на 45мин =
s=<Вп>([0-9]{1,2})\s?(\bмин\.?\b|\bmin\.?\b)=\1<tb4><min>=gI
# 45мин =
s=\b([0-9]{1,2})\s?(\bмин\.?\b|\bmin\.?\b)=\1<t1><min>=gI
# на 18сек =
s=<Вп>([0-9]{1,2})\s?(\bм|\bмк|\bн|\bm|\bmk|\bmn)?(s\.?\b|sec\.?\b|с\.?\b|сек\.?\b)=\1<tb4> \3<sec>=gI
# 18сек =
s=\b([0-9]{1,2})\s?(\bм|\bмк|\bн|\bm|\bmk|\bmn)?(s\.?\b|sec\.?\b|с\.\b|сек\.?\b)=\1<t1> \3<sec>=gI
#  Скорость =
#=
s=\b([1])\b\s\b(выстр\.)=\1<tg1> выстрел=gI
s=\b([234])\b\s\b(выстр\.)=\1<tg1> выстрела=gI
s=\b([0-9]+)\s\b(выстр\.)=\1<tg1> выстрелов=gI
#=
s=([0-9]*[1])\s(\bл\.?\s?\bс\.)=\1<tg1> лошадинная сила=gI
s=([0-9]*[234])\s(\bл\.?\s?\bс\.)=\1<tg1> лошадинные силы=gI
s=<Рп>([0-9]+)\s?-?\s([0-9]+)\s(л\.?\s?с\.?)=\1<tg1> - \2<tg1> лошадинных сил=gI
s=<Рп>([0-9]+)\s(л\.?\s?с\.?)=\1<tg1> лошадинных сил=gI
s=<Рп>([0-9]*[05-9])\s(л\.?\s?с\.?)=\1<tg1> лошадинных сил=gI
s=([0-9]*[05-9])\s(л\.?\/?\s?с\.?)=\1<tg1> лошадинных сил=gI
# =
s=<Рп>([0-9]+)\s?-?\s([0-9]+)\s(км/ч|кмч)=\1<tg1> - \2<tg1> \3=gI
s=<Рп>([0-9]+)\s(км/ч|кмч)=\1<th2> \2=gI
s=([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA0z])\/ч=\1 в час=gI
s=([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA0z])\.?\/с(ек)?=\1 в секунду=gI
s=([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA0z])\.?\/мин=\1 в минуту=gI
s=([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA0z])\.?\/год=\1 в год=gI
s=kmph=km в час=gI
s=кмч=km в час=gI
#   Длина / Площадь / Объём =
s=([0-9]+)\s?-?\s?(\bсм\b)\s\b(пушкам)\b=\1<ta2> сантиметровым \3=gI
s=([0-9]+)\s?-?\s?\b(см)\b\s\b(длинноствольную)\b=\1<ta2> сантиметровую \3=gI
# 15 кв. км, 15 куб. м =
s=([0-9]+)(<\S+>)\s(\bкв|\bкуб)\.\s?(\bк|\bд|\bс|\bм|\bмк|\bн)?(м)\b=\1\2 \4<mt><\3>=gI
s=([0-9]+)\s(\bкв|\bкуб)\.\s?(\bк|\bд|\bс|\bм|\bмк|\bн)?(м)\b=\1<t1> \3<mt><\2>=gI
s=<mt><кв>=<mt><sq>=gI
s=<mt><куб>=<mt><cub>=gI
# около 15 км, 15 м2, 15 м3 =
s=([0-9]+)(<\S+>)\s(\bk|\bd|\bc|\bm|\bmk|\bn|\bк|\bд|\bс|\bм|\bмк|\bн)?[mм]([23])\b=\1\2 \3<mt>\4=g
s=([0-9]+)(<\S+>)\s(\bk|\bd|\bc|\bm|\bmk|\bn|\bк|\bд|\bс|\bм|\bмк|\bн)?[mм]\.?\b=\1\2 \3<mt>=g
# 15км, 15 м2, 15 м3 =
s=\b([0-9]+)\s(\bk|\bd|\bc|\bm|\bmk|\bn|\bк|\bд|\bс|\bм|\bмк|\bн)?[mм]([23])\b=\1<t1> \2<mt>\3=g
s=\b([0-9]+)\s(\bk|\bd|\bc|\bm|\bmk|\bn|\bк|\bд|\bс|\bм|\bмк|\bн)?[mм]\.?\b=\1<t1> \2<mt>=g
s=<mt>2=<mt><sq>=gI
s=<mt>3=<mt><cub>=gI
# около 5л =
s=([0-9]+)(<\S+>)\s?(\bm|\bmk|\bм|\bмк)?(л\.?\b|l\.?\b)=\1\2 \3<lt>=gI
s= 5л ==gI
s=([0-9]+)\s?(\bm|\bmk|\bм|\bмк)?(л\.?\b|l\.?\b)=\1<t1> \2<lt>=gI
s=([0-9]+)\s(дюйм\.?)\s?(\w+)?\s(батарею|башню)=\1<th2> дюймовую \3 \4=gI
s=([0-9]+)\s(дюйм\.?)\s?(\w+)?\s(батарей|башен|кормовых|орудий|пушек)=\1<th2> дюймовых \3 \4=gI
s=\b([1])\b\s\b(дюйм\.?)=\1<tg1> дюйм=gI
s=\b([234])\b\s\b(дюйм\.?)=\1<tg1> дюйма=gI
s=([0-9]+)\s\b(дюйм\.)=\1<tg1> дюймов=gI
s=([0-9]+)\s?-?\s?([0-9]+)\s?(метра)\b=\1<tg4> \2<tg4> \3=gI
#  Масса =
# около 15гр =
s=([0-9]+)(<\S+>)\s?(\bk|\bm|\bmk|\bк|\bм|\bмк)(г\b|g\b)=\1\2 \3<gr>=g
s=([0-9]+)(<\S+>)\s?(гр\.?\b|gr\.?\b)=\1\2 <gr>=g
s=(<,[0-9]+>|нетто|брутто|вес|масса|весит|составля\S*)\s?([0-9]+)(<\S+>)\s?(г\b|g\b)=\1\2\3 <gr>=g
# 15гр =
s=<Рп>([0-9]+)\s?(\bk|\bm|\bmk|\bк|\bм|\bмк)(г\b|g\b)=\1<th2> \2<gr>=g
s=([0-9]+)\s?(\bk|\bm|\bmk|\bк|\bм|\bмк)(г\b|g\b)=\1<t1> \2<gr>=g
s=([0-9]+)\s?(гр\.?\b|gr\.?\b)=\1<t1> <gr>=g
s=(<,[0-9]+>|нетто|брутто|вес|масса|весит|составля\S*\s?)([0-9]+)\s?(г\b|g\b)=\1\2<t1> <gr>=g
# около 15т =
s=([0-9]+)(<\S+>)\s?(\bk|\bm|\bк|\bм)?(т\.?\b|t\.?\b)=\1\2 \3<tn>=g
# 15т =
s=([0-9]+)\s?(\bk|\bm|\bк|\bм)?(т\.?\b|t\.?\b)=\1<t1> \2<tn>=g
#   Валюта =
# около 100$\100дол. =
s=<Рп>([0-9]+)\s?($|\bдолл\.?\b|\bдол\.?\b)=\1<t2><usd>=gI
#s= 100$\100дол\. ==gI
s=([^,0-9])([0-9]+)\s?([$]|\bдолл\.?\b|\bдол\.?\b)=\1\2<t1><usd>=gI
# \100 =
s=([$])+\s?([0-9]+)([^,0-9])=\2<t1><usd>\3=gI
# около 10цент. =
s=<Рп>([0-9]+)\s?(¢|\bцент\.?\b)=\1<t2><cnt>=gI
# 10цент. =
s=([^,0-9])([0-9]+)\s?(¢|\bцент\.?\b)=\1\2<t1><cnt>=gI
# около 100руб =
s=<Рп>([0-9]+)\s?(\bруб\.?\b)=\1<t2><rub>=gI
# 100руб =
s=([^,0-9])([0-9]+)\s?(\bруб\.?\b)=\1\2<t1><rub>=gI
# около 10коп =
s=<Рп>([0-9]+)\s?(\bкоп\.?\b)=\1<t2><kop>=gI
# 10коп =
s=([^,0-9])([0-9]+)\s?(\bкоп\.?\b)=\1\2<t1><kop>=gI
# около 100€\100евро =
s=<Рп>([0-9]+)\s?(€|\bевр\.?\b|\bевро\b)=\1<t2><eur>=gI
# 100€\100евро =
s=([^,0-9])([0-9]+)\s?(€|\bевр\.?\b)=\1\2<t1><eur>=gI
# €100 =
s=(€)\s?([0-9]+)([^,0-9])=\2<t1><eur>\3=gI
# около 100грн =
s=<Рп>([0-9]+)\s?(₴|\bгрн\.?\b)=\1<t2><grn>=gI
# 100грн =
s=([^,0-9])([0-9]+)\s?(₴|\bгрн\.?\b)=\1\2<t1><grn>=gI
# €100 =
s=(₴)\s?([0-9]+)([^,0-9])=\2<t1><grn>\3=gI
# около 10евроцент. =
s=<Рп>([0-9]+)\s?(\bевроцент\.?\b)=\1<t2><ecn>=gI
# 10евроцент. =
s=([^,0-9])([0-9]+)\s?(\bевроцент\.?\b)=\1\2<t1><ecn>=gI
# =
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?([$]|\bдолл\.?\b|\bдол\.?\b)=\1\2 <usd>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bцент\.?\b)=\1\2 <cnt>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bруб\.?\b)=\1\2 <rub>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bкоп\.?\b)=\1\2 <kop>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(€|\bевр\.?\b)=\1\2 <eur>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(₴|\bгрн\.?\b)=\1\2 <grn>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bевроцент\.?\b)=\1\2 <ecn>=gI
# Температура =
# около 41° =
s=<Рп>([0-9]+)(°)=\1<t2><gra> =gI
# при 40° =
s=<Пп>([0-9]+)(°)=\1<t6><gra> =gI
# 41° =
s=([0-9]+)(°)=\1<t1><gra>=gI
#  Координаты =
# 41° с. ш.\ °41 с. ш. =
s=(([0-9]+)(°)(\s?([0-9]+)\s?(\'))?(\s?([0-9]+)\s?(\"))?)\s\bс\.\s\bш\.=\1 северной широтЫ=gI
s=((°)([0-9]+)(\s?(\')([0-9]+))?(\s?(\")([0-9]+))?)\s\bс\.\s\bш\.=\1 северной широтЫ=gI
# 41° ю. ш.\ °41 ю. ш. =
s=(([0-9]+)(°)(\s?([0-9]+)\s?(\'))?(\s?([0-9]+)\s?(\"))?)\s\bю\.\s\bш\.=\1 южной широтЫ=gI
s=((°)([0-9]+)(\s?(\')([0-9]+))?(\s?(\")([0-9]+))?)\s\bю\.\s\bш\.=\1 южной широтЫ=gI
# 41° в. д.\ °41 в. д. =
s=(([0-9]+)(°)(\s?([0-9]+)\s?(\'))?(\s?([0-9]+)\s?(\"))?)\s\bв\.\s\bд\.=\1 восточной долготЫ=gI
s=((°)([0-9]+)(\s?(\')([0-9]+))?(\s?(\")([0-9]+))?)\s\bв\.\s\bд\.=\1 восточной долготЫ=gI
# 41° з. д.\ °41 з. д. =
s=(([0-9]+)(°)(\s?([0-9]+)\s?(\'))?(\s?([0-9]+)\s?(\"))?)\s\bз\.\s\bд\.=\1 западной долготЫ=gI
s=((°)([0-9]+)(\s?(\')([0-9]+))?(\s?(\")([0-9]+))?)\s\bз\.\s\bд\.=\1 западной долготЫ=gI
# после 41° =
s=<Рп>([0-9]+)(°)(\s?([0-9]+)\s?(\'))?(\s?([0-9]+)\s?(\"))?=\1<t2><gra> \4<t2><min> \7<t2><sec>=gI
s=(\bпри\b)\s([0-9]+)(°)(\s?([0-9]+)\s?(\'))?(\s?([0-9]+)\s?(\"))?=\1 \2<t6><gra> \5<t6><min> \8<t6><sec>=gI
# 41° =
s=([0-9]+)(°)(\s?([0-9]+)\s?(\'))?(\s?([0-9]+)\s?(\"))?=\1<t1><gra> \4<t1><min> \7<t1><sec>=gI
# после °41 =
s=<Рп>(°)([0-9]+)(\s?(\')([0-9]+))?(\s?(\")([0-9]+))?=\2<t2><gra> \5<t2><min> \8<t2><sec>=gI
s=№(\bпри\b)\s(°)([0-9]+)(\s?(\')([0-9]+))?(\s?(\")([0-9]+))?=\1 \3<t6><gra> \6<t6><min> \9<t6><sec>=gI
# °41 =
s=(°)([0-9]+)(\s?(\')([0-9]+))?(\s?(\")([0-9]+))?=\2<t1><gra> \5<t1><min> \8<t1><sec>=gI
#    Биты и байты =
# около 100Гб =
s=([0-9]+)(<\S+>)\s?([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-z]+)?(байт\.?\b|б\.?\b|b\.?\b|byte\.?\b)=\1\2 \3<byt>=gI
# 100Гб =
s=([0-9]+)\s?([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-z]+)?(байт\.?\b|б\.?\b|b\.?\b|byte\.?\b)=\1<t1> \2<byt>=g
s= около 100Мбит ==gI
s=([0-9]+)(<\S+>)\s?([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-z]+)?(бит\.?\b|bit\.?\b)=\1\2 \3<bit>=gI
# 100Мбит =
s=([0-9]+)\s?([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-z]+)?(бит\.?\b|bit\.?\b)=\1<t1> \2<bit>=gI
s=([0-9]+)(<\S+>)\s?(\bk|\bm)?(bps\b)=\1\2 \3<bit> в секунду=gI
s=([0-9]+)\s?(\bk|\bm)?(bps\b)=\1<t1> \2<bit> в секунду=gI
# Порядки =
s=(\bT|\bТ)<(mt|lt|gr|tn|byt|bit|sec)>=<tera><\2>=g
s=(\bG|\bГ)<(mt|lt|gr|tn|byt|bit|sec)>=<giga><\2>=g
s=(\bM|\bМ)<(mt|lt|gr|tn|byt|bit|sec)>=<mega><\2>=g
s=(\bk|\bк)<(mt|lt|gr|tn|byt|bit|sec)>=<kilo><\2>=g
s=(\bd|\bд)<(mt|lt|gr|tn|byt|bit|sec)>=<deci><\2>=g
s=(\bc|\bс)<(mt|lt|gr|tn|byt|bit|sec)>=<santi><\2>=g
s=(\bm|\bм)<(mt|lt|gr|tn|byt|bit|sec)>=<mili><\2>=g
s=(\bmk|\bмк)<(mt|lt|gr|tn|byt|bit|sec)>=<micro><\2>=g
s=(\bn|\bн)<(mt|lt|gr|tn|byt|bit|sec)>=<nano><\2>=g
s=<mili><tn>=<mega><tn>=gI
# =
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?([$]|\bдолл\.?\b|\bдол\.?\b)=\1\2 <usd>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bцент\.?\b)=\1\2 <cnt>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bруб\.?\b)=\1\2 <rub>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bкоп\.?\b)=\1\2 <kop>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(€|\bевр\.?\b)=\1\2 <eur>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(₴|\bгрн\.?\b)=\1\2 <grn>=gI
s=([0-9]+)\s?(<[a-z0-9]+>)?\s?(\bевроцент\.?\b)=\1\2 <ecn>=gI
###########################################################################################/=
# млрд =
s=([0-9]+)\s?(\bмлрд\.|\bмлрд\b)=\1<t1><mlrd>=gI
# млн =
s=([0-9]+)\s?(\bмлн\.|\bмлн\b)=\1<t1><mln>=gI
# тыс =
s=([0-9]+)\s?(\тыс\.|\тыс\b)=\1<t1><tis>=gI
# =
s=(<t[a-z][0-9]>)(\s+)?(<[a-z]+>)?(\s+)?(\bтыс\b)=\1<tis>\3=gI
s=(<t[0-9]>)(\s+)?(<[a-z]+>)?(\s+)?(\bтыс\b)=\1<tis>\3=gI
s=(<[a-z0-9]+>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлн\b)=\1<mln>\3=gI
s=(<t[0-9]>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлн\b)=\1<mln>\3=gI
s=(<t[a-z][0-9]>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлрд\b)=\1<mlrd>\3=gI
s=(<t[0-9]>)(\s+)?(<[a-z]+>)?(\s+)?(\bмлрд\b)=\1<mlrd>\3=gI
# экз =
s=\b(([0-9]+)?([02-9])(1)|(1))\s(\bэкз\.?\b)=\1 экземпляр=gI
s=\b(([0-9]+)?([02-9])([2-4])|([2-4]))\s(\bэкз\.?\b)=\1 экземпляра=gI
s=\b([0-9]+)\s(\bэкз\.?\b)=\1 экземпляров=gI
s=<Рп>([0-9]+)([^<0-9+.,\/:-])=\1<ta2>\2=gI
s=(<[ИРДВТП]п>)([0-9]+) - (<,[0-9]+>)?([0-9]+)=\1\2 - \3\1\4=gI
s=<Рп>([0-9]+)([.,])=\1<tg1>\2=gI
s=<Рп>([0-9]+)=\1<ta2>=gI
s=<Дп>([0-9]+)=\1<ta3>=gI
s=<Вп>([0-9]+)=\1<ta4>=gI
s=<Тп>([0-9]+)=\1<ta5>=gI
s=<Пп>([0-9]+)=\1<ta6>=gI
s=<Ип>([0-9]+)=\1<tg1>=gI
###########################################################################################=
# коррекция ошибок =
s=<sec>\s(\bполовиной\b)=с \1=gI
s=([€$])\s?([0-9]+)=\2=gI
s=([0-9]+)\s?([€$])=\1=gI
s=<usd>\.?\s(\bдоллар)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=<usd>=gI
s=<rub>\.?\s(\bрубл)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=<rub>=gI
s=<grn>\.?\s(\bгрив)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)=<grn>=gI
s=<eur>\.?\s(\bевро\b)=<eur>=gI
s=([0-9]+)\s-\s(\bя\b)\s([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)(ал\b|ала\b)=\1. \2 \3\4=gI
s=<t[a-z][0-9]>(<t[0-9]>)=\1=gI
s=<t[a-z][0-9]>(<t[a-z][0-9]>)=\1=gI
s=(<tis>)\.=\1=gI
s=(<mln>)\.=\1=gI
s=(<mlrd>)\.=\1=gI
###########################################################################################=
# Форматирование замен =
###########################################################################################=
# Определение группы чисел =
s=\b([0]?1)<t([a-z])([0-9])>=<\1:\2s@1:t\3>=gI
s=\b([0-9]+)?([2-90])(1)<t([a-z])([0-9])>=<\1\2\3:\4s@1:t\5>=gI
s=\b([0-9]+)?([1])([2-4])<t([a-z])([0-9])>=<\1\2\3:\4s@3:t\5>=gI
s=\b([0-9]+)?([2-90])?([2-4])<t([a-z])([0-9])>=<\1\2\3:\4s@2:t\5>=gI
s=\b([0-9]+)<t([a-z])([0-9])>=<\1:\2s@3:t\3>=gI
s=\b([0]?1)<t([0-9])>=<\1:1:t\2>=gI
s=\b([0-9]+)?([2-90])(1)<t([0-9])>=<\1\2\3:1:t\4>=gI
s=\b([0-9]+)?([1])([2-4])<t([0-9])>=<\1\2\3:3:t\4>=gI
s=\b([0-9]+)?([2-90])?([2-4])<t([0-9])>=<\1\2\3:2:t\4>=gI
s=\b([0-9]+)<t([0-9])>=<\1:3:t\2>=gI
s=:([a-z])s@([0-9]):=:\1\2:=gI
# группы пояснительных слов =
# м.р.цел =
s=<([0-9]+):([a-z])([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>=gI
s=<([0-9]+):([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:a\2:t\3>\4 \5<\6:a\2:t\3>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:\2\3:t\4> \5<\6:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)?\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:\2\3:t\4> \5<\6:\2\3:t\4>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:a\2:t\3>\4 \5<\6:a\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:a\2:t\3> \4<\5:a\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?<(\bmnth\b|\bmlrd\b|\bmln\b|\bper\b|\bhr\b|\bmt\b|\bgr\b|\blt\b|\busd\b|\bcnt\b|\brub\b|\beur\b|\becn\b|\bgra\b|\bbyt\b|\bbit\b)>=<\1:a\2:t\3> <\4:a\2:t\3>=gI
# м.р.пор. =
#<([0-9]+):([a-z])([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\byy\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\byy\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\byy\b)>=<\1:\2\3:t\4> \5<\6:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?<(\byy\b)>=<\1:\2\3:t\4> <\5:\2\3:t\4>=gI
#<([0-9]+):([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\byy\b)>=<\1:d\2:t\3>\4 \5<\6:d\2:t\3>
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\byy\b)>=<\1:d\2:t\3>\4 \5<\6:d\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\byy\b)>=<\1:d\2:t\3> \4<\5:d\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?<(\byy\b)>=<\1:d\2:t\3> <\4:d\2:t\3>=gI
# ж.р.цел. =
#<([0-9]+):([a-z])([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:\2\3:t\4> \5<\6:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:\2\3:t\4> <\5:\2\3:t\4>=gI
#<([0-9]+):([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:b\2:t\3>\4 \5<\6:b\2:t\3>
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:b\2:t\3>\4 \5<\6:b\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:b\2:t\3> \4<\5:b\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?<(\btis\b|\bmin\b|\bsec\b|\btn\b|\bgrn\b|\bkop\b)>=<\1:b\2:t\3> <\4:b\2:t\3>=gI
# ж.р.пор. =
#<([0-9]+):([a-z])([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bwek\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bwek\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\bwek\b)>=<\1:\2\3:t\4> \5<\6:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?<(\bwek\b)>=<\1:\2\3:t\4> <\5:\2\3:t\4>=gI
#<([0-9]+):([0-9]):t([0-9])>(<[a-z]+>)?\s?(<[a-z]+>)?\s?<(\bwek\b)>=<\1:e\2:t\3>\4 \5<\6:e\2:t\3>
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bwek\b)>=<\1:e\2:t\3>\4 \5<\6:e\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\bwek\b)>=<\1:e\2:t\3> \4<\5:e\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?<(\bwek\b)>=<\1:e\2:t\3> <\4:e\2:t\3>=gI
# с.р.пор. =
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bdd\b)>=<\1:\2\3:t\4>\5 \6<\7:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\bdd\b)>=<\1:\2\3:t\4> \5<\6:\2\3:t\4>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>\s?<(\bdd\b)>=<\1:\2\3:t\4><\5:\2\3:t\4>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?(<[a-z]+>)\s?<(\bdd\b)>=<\1:c\2:t\3>\4 \5<\6:c\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?(<[a-z]+>)\s?<(\bdd\b)>=<\1:c\2:t\3> \4<\5:c\2:t\3>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])><(\bdd\b)>=<\1:\2\3:t\4><\5:\2\3:t\4>=gI
s=<([0-9]+):([0-9]):t([0-9])>\s?<(\bdd\b)>=<\1:c\2:t\3><\4:c\2:t\3>=gI
s=<([0-9]+):([0-9]):t([0-9])><mm>=<mm:\1:t\3>=gI
# удаление лишнего =
s=<([0-9]+):([0-9]):t([abcd])([0-9])>=<\1:\3\2:t\4>=gI
s=<([0-9]+):([0-9]):t([0-9])>=\1=gI
##########################################################################################/=
# Склонение пояснительных слов =
##########################################################################################/=
# коррекция склонения сокр. числительных =
s=<([0-9]+):([a-z])([0-9]):t([0-9])>(\s+?)<(\bmlrd\b|\bmln\b)>=<\1:\2\3:t\4><\6:\2\3:t\4>=gI
s=<([0-9]+):([0-9]):t([0-9])>(\s+?)<(\bmlrd\b|\bmln\b)>=<\1:a\2:t\3><\5:a\2:t\3>=gI
s=<([0-9]+):([a-z])([0-9]):t([0-9])>(\s+?)<(\btis\b)>=<\1:\2\3:t\4><\6:\2\3:t\4>=gI
s=<([0-9]+):([0-9]):t([0-9])>(\s+?)<(\btis\b)>=<\1:b\2:t\3><\5:b\2:t\3>=gI
# =
#<([0-9]+):a([0-9]):t([0-9])><tis=<\1:b\2:t\3><tis
s=<([0-9]+):b([0-9]):t([0-9])><(\bmln\b|\bmlrd\b)=<\1:a\2:t\3><\4=gI
s=(<(\bmln\b|\bmlrd\b|\btis\b):([ab])([0-9]+):t([0-9])>)<([a-z]+):([ab])[0-9]+:t([0-9])>=\1<\6:\7s@3:t\8>=gI
s=:([a-z])s@([0-9]):=:\1\2:=gI
# =
s=<([0-9]?[1]):a([1]):t([0-9])>(\s+)?<tis=<\1:a2:t\3><tis=gI
s=<([0-9]+):a([0-9]):t([0-9])>(\s+)?<tis=<\1:b\2:t\3><tis=gI
s=<([0-9]+):d([0-9]):t([0-9])>(\s+)?<tis=<\1:e\2:t\3><tis=gI
s=(<tis:[a-z][0-9]:t[0-9]>)(\s+)?<(\busd\b|\brub\b|\bgrn\b):a1:t2>=\1 <\3:a2:t2>=gI
# проценты =
s=<per:[a-z]1:t1>= процент=gI
s=<per:[a-z]1:t2>= процента=gI
s=<per:[a-z]1:t3>= проценту=gI
s=<per:[a-z]1:t4>= процент=gI
s=<per:[a-z]1:t5>= процентом=gI
s=<per:[a-z]1:t6>= проценте=gI
s=<per:[a-z]2:t1>= процента=gI
s=<per:[a-z]2:t2>= процентов=gI
s=<per:[a-z]2:t3>= процентам=gI
s=<per:[a-z]2:t4>= процента=gI
s=<per:[a-z]2:t5>= процентами=gI
s=<per:[a-z]2:t6>= процентах=gI
s=<per:[a-z]3:t1>= процентов=gI
s=<per:[a-z]3:t2>= процентов=gI
s=<per:[a-z]3:t3>= процентам=gI
s=<per:[a-z]3:t4>= процентов=gI
s=<per:[a-z]3:t5>= процентами=gI
s=<per:[a-z]3:t6>= процентах=gI
s=<per:[a-z]3:t7>= процентным=gI
# часы =
s=<hr:[a-z]1:t1>= час=gI
s=<hr:[a-z]1:t2>= часа=gI
s=<hr:[a-z]1:t3>= часу=gI
s=<hr:[a-z]1:t4>= час=gI
s=<hr:[a-z]1:t5>= часом=gI
s=<hr:[a-z]1:t6>= часе=gI
s=<hr:[a-z]2:t1>= часА=gI
s=<hr:[a-z]2:t2>= часов=gI
s=<hr:[a-z]2:t3>= часам=gI
s=<hr:[a-z]2:t4>= часА=gI
s=<hr:[a-z]2:t5>= часами=gI
s=<hr:[a-z]2:t6>= часах=gI
s=<hr:a3:t1>= часов=gI
s=<hr:[b-z]3:t1>= часы=gI
s=<hr:[a-z]3:t2>= часов=gI
s=<hr:[a-z]3:t3>= часам=gI
s=<hr:[a-z]3:t4>= часов=gI
s=<hr:[a-z]3:t5>= часами=gI
s=<hr:[a-z]3:t6>= часах=gI
# месяцы =
s=<mnth:[a-z]1:t1>= месяц=gI
s=<mnth:[a-z]1:t2>= месяца=gI
s=<mnth:[a-z]1:t3>= месяцу=gI
s=<mnth:[a-z]1:t4>= месяц=gI
s=<mnth:[a-z]1:t5>= месяцем=gI
s=<mnth:[a-z]1:t6>= месяце=gI
s=<mnth:[a-z]2:t1>= месяца=gI
s=<mnth:[a-z]2:t2>= месяцев=gI
s=<mnth:[a-z]2:t3>= месяцам=gI
s=<mnth:[a-z]2:t4>= месяца=gI
s=<mnth:[a-z]2:t5>= месяцами=gI
s=<mnth:[a-z]2:t6>= месяцах=gI
s=<mnth:[a-z]3:t1>= месяцы=gI
s=<mnth:[a-z]3:t2>= месяцев=gI
s=<mnth:[a-z]3:t3>= месяцам=gI
s=<mnth:[a-z]3:t4>= месяцов=gI
s=<mnth:[a-z]3:t5>= месяцами=gI
s=<mnth:[a-z]3:t6>= месяцах=gI
# неделя =
s=<wek:[a-z]1:t1>= неделя=gI
s=<wek:[a-z]1:t2>= недели=gI
s=<wek:[a-z]1:t3>= неделе=gI
s=<wek:[a-z]1:t4>= неделю=gI
s=<wek:[a-z]1:t5>= неделей=gI
s=<wek:[a-z]1:t6>= неделе=gI
s=<wek:[a-z]2:t1>= недели=gI
s=<wek:[a-z]2:t2>= недель=gI
s=<wek:[a-z]2:t3>= неделям=gI
s=<wek:[a-z]2:t4>= недели=gI
s=<wek:[a-z]2:t5>= неделями=gI
s=<wek:[a-z]2:t6>= неделях=gI
s=<wek:[a-z]3:t1>= недель=gI
s=<wek:[a-z]3:t2>= недель=gI
s=<wek:[a-z]3:t3>= неделям=gI
s=<wek:[a-z]3:t4>= недель=gI
s=<wek:[a-z]3:t5>= неделями=gI
s=<wek:[a-z]3:t6>= неделях=gI
# минуты =
s=<min:[a-z]1:t1>= минута=gI
s=<min:[a-z]1:t2>= минуты=gI
s=<min:[a-z]1:t3>= минуте=gI
s=<min:[a-z]1:t4>= минуту=gI
s=<min:[a-z]1:t5>= минутой=gI
s=<min:[a-z]1:t6>= минуте=gI
s=<min:[a-z]2:t1>= минуты=gI
s=<min:[a-z]2:t2>= минут=gI
s=<min:[a-z]2:t3>= минутам=gI
s=<min:[a-z]2:t4>= минуты=gI
s=<min:[a-z]2:t5>= минутами=gI
s=<min:[a-z]2:t6>= минутах=gI
s=<min:[a-z]3:t1>= минут=gI
s=<min:[a-z]3:t2>= минут=gI
s=<min:[a-z]3:t3>= минутам=gI
s=<min:[a-z]3:t4>= минут=gI
s=<min:[a-z]3:t5>= минутами=gI
s=<min:[a-z]3:t6>= минутах=gI
# тысяча =
s=<tis:[a-z]1:t1>= тысяча=gI
s=<tis:[a-z]1:t2>= тысячи=gI
s=<tis:[a-z]1:t3>= тысяче=gI
s=<tis:[a-z]1:t4>= тысячу=gI
s=<tis:[a-z]1:t5>= тысячей=gI
s=<tis:[a-z]1:t6>= тысяче=gI
s=<tis:[a-z]2:t1>= тысячи=gI
s=<tis:[a-z]2:t2>= тысяч=gI
s=<tis:[a-z]2:t3>= тысячам=gI
s=<tis:[a-z]2:t4>= тысячи=gI
s=<tis:[a-z]2:t5>= тысячами=gI
s=<tis:[a-z]2:t6>= тысячах=gI
s=<tis:[a-z]3:t1>= тысяч=gI
s=<tis:[a-z]3:t2>= тысяч=gI
s=<tis:[a-z]3:t3>= тысячам=gI
s=<tis:[a-z]3:t4>= тысяч=gI
s=<tis:[a-z]3:t5>= тысячами=gI
s=<tis:[a-z]3:t6>= тысячах=gI
# миллион =
s=<mln:[a-z]1:t1>= миллион=gI
s=<mln:[a-z]1:t2>= миллиона=gI
s=<mln:[a-z]1:t3>= миллиону=gI
s=<mln:[a-z]1:t4>= миллион=gI
s=<mln:[a-z]1:t5>= миллионом=gI
s=<mln:[a-z]1:t6>= миллионе=gI
s=<mln:[a-z]2:t1>= миллиона=gI
s=<mln:[a-z]2:t2>= миллионов=gI
s=<mln:[a-z]2:t3>= миллионам=gI
s=<mln:[a-z]2:t4>= миллиона=gI
s=<mln:[a-z]2:t5>= миллионами=gI
s=<mln:[a-z]2:t6>= миллионах=gI
s=<mln:[a-z]3:t1>= миллионов=gI
s=<mln:[a-z]3:t2>= миллионов=gI
s=<mln:[a-z]3:t3>= миллионам=gI
s=<mln:[a-z]3:t4>= миллионов=gI
s=<mln:[a-z]3:t5>= миллионами=gI
s=<mln:[a-z]3:t6>= миллионах=gI
# миллиард =
s=<mlrd:[a-z]1:t1>= миллиард=gI
s=<mlrd:[a-z]1:t2>= миллиарда=gI
s=<mlrd:[a-z]1:t3>= миллиарду=gI
s=<mlrd:[a-z]1:t4>= миллиард=gI
s=<mlrd:[a-z]1:t5>= миллиардом=gI
s=<mlrd:[a-z]1:t6>= миллиарде=gI
s=<mlrd:[a-z]2:t1>= миллиарда=gI
s=<mlrd:[a-z]2:t2>= миллиардов=gI
s=<mlrd:[a-z]2:t3>= миллиардам=gI
s=<mlrd:[a-z]2:t4>= миллиарда=gI
s=<mlrd:[a-z]2:t5>= миллиардами=gI
s=<mlrd:[a-z]2:t6>= миллиардах=gI
s=<mlrd:[a-z]3:t1>= миллиардов=gI
s=<mlrd:[a-z]3:t2>= миллиардов=gI
s=<mlrd:[a-z]3:t3>= миллиардам=gI
s=<mlrd:[a-z]3:t4>= миллиардов=gI
s=<mlrd:[a-z]3:t5>= миллиардами=gI
s=<mlrd:[a-z]3:t6>= миллиардах=gI
# секунды =
s=<sec:[a-z]1:t1>= секунда=gI
s=<sec:[a-z]1:t2>= секунды=gI
s=<sec:[a-z]1:t3>= секунде=gI
s=<sec:[a-z]1:t4>= секунду=gI
s=<sec:[a-z]1:t5>= секундой=gI
s=<sec:[a-z]1:t6>= секунде=gI
s=<sec:[a-z]2:t1>= секунды=gI
s=<sec:[a-z]2:t2>= секунд=gI
s=<sec:[a-z]2:t3>= секундам=gI
s=<sec:[a-z]2:t4>= секунды=gI
s=<sec:[a-z]2:t5>= секундами=gI
s=<sec:[a-z]2:t6>= секундах=gI
s=<sec:[a-z]3:t1>= секунд=gI
s=<sec:[a-z]3:t2>= секунд=gI
s=<sec:[a-z]3:t3>= секундам=gI
s=<sec:[a-z]3:t4>= секунд=gI
s=<sec:[a-z]3:t5>= секундами=gI
s=<sec:[a-z]3:t6>= секундах=gI
# число =
s=<dd:c([0-9]):t([0-9])>==gI
# месяцы =
s=<mm:12:t1>=декабрь=gI
s=<mm:12:t2>=декабря=gI
s=<mm:12:t3>=декабрю=gI
s=<mm:12:t4>=декабрь=gI
s=<mm:12:t5>=декабрем=gI
s=<mm:12:t6>=декабре=gI
s=<mm:11:t1>=ноябрь=gI
s=<mm:11:t2>=ноября=gI
s=<mm:11:t3>=ноябрю=gI
s=<mm:11:t4>=ноябрь=gI
s=<mm:11:t5>=ноябрем=gI
s=<mm:11:t6>=ноябре=gI
s=<mm:10:t1>=октябрь=gI
s=<mm:10:t2>=октября=gI
s=<mm:10:t3>=октябрю=gI
s=<mm:10:t4>=октябрь=gI
s=<mm:10:t5>=октябрем=gI
s=<mm:10:t6>=октябре=gI
s=<mm:0?9:t1>=сентябрь=gI
s=<mm:0?9:t2>=сентября=gI
s=<mm:0?9:t3>=сентябрю=gI
s=<mm:0?9:t4>=сентябрь=gI
s=<mm:0?9:t5>=сентябрем=gI
s=<mm:0?9:t6>=сентябре=gI
s=<mm:0?8:t1>=август=gI
s=<mm:0?8:t2>=августа=gI
s=<mm:0?8:t3>=августу=gI
s=<mm:0?8:t4>=август=gI
s=<mm:0?8:t5>=августом=gI
s=<mm:0?8:t6>=августе=gI
s=<mm:0?7:t1>=июль=gI
s=<mm:0?7:t2>=июля=gI
s=<mm:0?7:t3>=июлю=gI
s=<mm:0?7:t4>=июль=gI
s=<mm:0?7:t5>=июлем=gI
s=<mm:0?7:t6>=июле=gI
s=<mm:0?6:t1>=июнь=gI
s=<mm:0?6:t2>=июня=gI
s=<mm:0?6:t3>=июню=gI
s=<mm:0?6:t4>=июнь=gI
s=<mm:0?6:t5>=июнем=gI
s=<mm:0?6:t6>=июне=gI
s=<mm:0?5:t1>=май=gI
s=<mm:0?5:t2>=мая=gI
s=<mm:0?5:t3>=маю=gI
s=<mm:0?5:t4>=май=gI
s=<mm:0?5:t5>=маем=gI
s=<mm:0?5:t6>=мае=gI
s=<mm:0?4:t1>=апрель=gI
s=<mm:0?4:t2>=апреля=gI
s=<mm:0?4:t3>=апрелю=gI
s=<mm:0?4:t4>=апрель=gI
s=<mm:0?4:t5>=апрелем=gI
s=<mm:0?4:t6>=апреле=gI
s=<mm:0?3:t1>=март=gI
s=<mm:0?3:t2>=марта=gI
s=<mm:0?3:t3>=мару=gI
s=<mm:0?3:t4>=март=gI
s=<mm:0?3:t5>=мартом=gI
s=<mm:0?3:t6>=марте=gI
s=<mm:0?2:t1>=февраль=gI
s=<mm:0?2:t2>=февраля=gI
s=<mm:0?2:t3>=февралю=gI
s=<mm:0?2:t4>=февраль=gI
s=<mm:0?2:t5>=февралем=gI
s=<mm:0?2:t6>=феврале=gI
s=<mm:0?1:t1>=январь=gI
s=<mm:0?1:t2>=января=gI
s=<mm:0?1:t3>=январю=gI
s=<mm:0?1:t4>=январь=gI
s=<mm:0?1:t5>=январем=gI
s=<mm:0?1:t6>=январе=gI
# года =
#<([01]?[0-9]):d([0-9]):t([0-9])><yy:d([0-9]):t([0-9])>=<20\1:d\2:t\3><yy:d\4:t\5>
#<([2-9]?[0-9]):d([0-9]):t([0-9])><yy:d([0-9]):t([0-9])>=<19\1:d\2:t\3><yy:d\4:t\5>
s=<yy:[a-z]([0-9]):t1>= год=gI
s=<yy:[a-z]([0-9]):t2>= года=gI
s=<yy:[a-z]([0-9]):t3>= году=gI
s=<yy:[a-z]([0-9]):t4>= год=gI
s=<yy:[a-z]([0-9]):t5>= годом=gI
s=<yy:[a-z]([0-9]):t6>= годУ=gI
# метры =
s=<mt:[a-z]1:t1>= метр=gI
s=<mt:[a-z]1:t2>= метра=gI
s=<mt:[a-z]1:t3>= метру=gI
s=<mt:[a-z]1:t4>= метр=gI
s=<mt:[a-z]1:t5>= метром=gI
s=<mt:[a-z]1:t6>= метре=gI
s=<mt:[a-z]2:t1>= метра=gI
s=<mt:[a-z]2:t2>= метров=gI
s=<mt:[a-z]2:t3>= метрам=gI
s=<mt:[a-z]2:t4>= метра=gI
s=<mt:[a-z]2:t5>= метрами=gI
s=<mt:[a-z]2:t6>= метрах=gI
s=<mt:[a-z]3:t1>= метров=gI
s=<mt:[a-z]3:t2>= метров=gI
s=<mt:[a-z]3:t3>= метрам=gI
s=<mt:[a-z]3:t4>= метров=gI
s=<mt:[a-z]3:t5>= метрами=gI
s=<mt:[a-z]3:t6>= метрах=gI
# градусы =
s=<gra:[a-z]1:t1>= градус=gI
s=<gra:[a-z]1:t2>= градуса=gI
s=<gra:[a-z]1:t3>= градусу=gI
s=<gra:[a-z]1:t4>= градус=gI
s=<gra:[a-z]1:t5>= градусом=gI
s=<gra:[a-z]1:t6>= градусе=gI
s=<gra:[a-z]2:t1>= градуса=gI
s=<gra:[a-z]2:t2>= градусов=gI
s=<gra:[a-z]2:t3>= градусам=gI
s=<gra:[a-z]2:t4>= градуса=gI
s=<gra:[a-z]2:t5>= градусами=gI
s=<gra:[a-z]2:t6>= градусах=gI
s=<gra:[a-z]3:t1>= градусов=gI
s=<gra:[a-z]3:t2>= градусов=gI
s=<gra:[a-z]3:t3>= градусам=gI
s=<gra:[a-z]3:t4>= градусов=gI
s=<gra:[a-z]3:t5>= градусами=gI
s=<gra:[a-z]3:t6>= градусах=gI
# граммы =
s=<gr:[a-z]1:t1>= грамм=gI
s=<gr:[a-z]1:t2>= грамма=gI
s=<gr:[a-z]1:t3>= грамму=gI
s=<gr:[a-z]1:t4>= грамм=gI
s=<gr:[a-z]1:t5>= граммом=gI
s=<gr:[a-z]1:t6>= грамме=gI
s=<gr:[a-z]2:t1>= грамма=gI
s=<gr:[a-z]2:t2>= граммов=gI
s=<gr:[a-z]2:t3>= граммам=gI
s=<gr:[a-z]2:t4>= грамма=gI
s=<gr:[a-z]2:t5>= граммами=gI
s=<gr:[a-z]2:t6>= граммах=gI
s=<gr:[a-z]3:t1>= граммов=gI
s=<gr:[a-z]3:t2>= граммов=gI
s=<gr:[a-z]3:t3>= граммам=gI
s=<gr:[a-z]3:t4>= граммов=gI
s=<gr:[a-z]3:t5>= граммами=gI
s=<gr:[a-z]3:t6>= граммах=gI
# тонны =
s=<tn:[a-z]1:t1>= тонна=gI
s=<tn:[a-z]1:t2>= тонны=gI
s=<tn:[a-z]1:t3>= тонне=gI
s=<tn:[a-z]1:t4>= тонну=gI
s=<tn:[a-z]1:t5>= тонной=gI
s=<tn:[a-z]1:t6>= тонне=gI
s=<tn:[a-z]2:t1>= тонны=gI
s=<tn:[a-z]2:t2>= тонн=gI
s=<tn:[a-z]2:t3>= тоннам=gI
s=<tn:[a-z]2:t4>= тонны=gI
s=<tn:[a-z]2:t5>= тоннами=gI
s=<tn:[a-z]2:t6>= тоннах=gI
s=<tn:[a-z]3:t1>= тонн=gI
s=<tn:[a-z]3:t2>= тонн=gI
s=<tn:[a-z]3:t3>= тоннам=gI
s=<tn:[a-z]3:t4>= тонны=gI
s=<tn:[a-z]3:t5>= тоннами=gI
s=<tn:[a-z]3:t6>= тоннах=gI
# гривна =
s=<grn:[a-z]1:t1>= гривна=gI
s=<grn:[a-z]1:t2>= гривны=gI
s=<grn:[a-z]1:t3>= гривне=gI
s=<grn:[a-z]1:t4>= гривну=gI
s=<grn:[a-z]1:t5>= гривной=gI
s=<grn:[a-z]1:t6>= гривне=gI
s=<grn:[a-z]2:t1>= гривны=gI
s=<grn:[a-z]2:t2>= гривен=gI
s=<grn:[a-z]2:t3>= гривнам=gI
s=<grn:[a-z]2:t4>= гривны=gI
s=<grn:[a-z]2:t5>= гривнами=gI
s=<grn:[a-z]2:t6>= гривнах=gI
s=<grn:[a-z]3:t1>= гривен=gI
s=<grn:[a-z]3:t2>= гривен=gI
s=<grn:[a-z]3:t3>= гривнам=gI
s=<grn:[a-z]3:t4>= гривны=gI
s=<grn:[a-z]3:t5>= гривнами=gI
s=<grn:[a-z]3:t6>= гривнах=gI
# литры =
s=<lt:[a-z]1:t1>= литр=gI
s=<lt:[a-z]1:t2>= литра=gI
s=<lt:[a-z]1:t3>= литру=gI
s=<lt:[a-z]1:t4>= литр=gI
s=<lt:[a-z]1:t5>= литром=gI
s=<lt:[a-z]1:t6>= литре=gI
s=<lt:[a-z]2:t1>= литра=gI
s=<lt:[a-z]2:t2>= литров=gI
s=<lt:[a-z]2:t3>= литрам=gI
s=<lt:[a-z]2:t4>= литра=gI
s=<lt:[a-z]2:t5>= литрами=gI
s=<lt:[a-z]2:t6>= литрах=gI
s=<lt:[a-z]3:t1>= литров=gI
s=<lt:[a-z]3:t2>= литров=gI
s=<lt:[a-z]3:t3>= литрам=gI
s=<lt:[a-z]3:t4>= литров=gI
s=<lt:[a-z]3:t5>= литрами=gI
s=<lt:[a-z]3:t6>= литрах=gI
# доллары =
s=<usd:[a-z]1:t1>= доллар=gI
s=<usd:[a-z]1:t2>= доллара=gI
s=<usd:[a-z]1:t3>= доллару=gI
s=<usd:[a-z]1:t4>= доллар=gI
s=<usd:[a-z]1:t5>= долларом=gI
s=<usd:[a-z]1:t6>= долларе=gI
s=<usd:[a-z]2:t1>= доллара=gI
s=<usd:[a-z]2:t2>= долларов=gI
s=<usd:[a-z]2:t3>= долларам=gI
s=<usd:[a-z]2:t4>= доллара=gI
s=<usd:[a-z]2:t5>= долларами=gI
s=<usd:[a-z]2:t6>= долларах=gI
s=<usd:[a-z]3:t1>= долларов=gI
s=<usd:[a-z]3:t2>= долларов=gI
s=<usd:[a-z]3:t3>= долларам=gI
s=<usd:[a-z]3:t4>= долларов=gI
s=<usd:[a-z]3:t5>= долларами=gI
s=<usd:[a-z]3:t6>= долларах=gI
# центы =
s=<cnt:[a-z]1:t1>= цент=gI
s=<cnt:[a-z]1:t2>= цента=gI
s=<cnt:[a-z]1:t3>= центу=gI
s=<cnt:[a-z]1:t4>= цент=gI
s=<cnt:[a-z]1:t5>= центом=gI
s=<cnt:[a-z]1:t6>= центе=gI
s=<cnt:[a-z]2:t1>= цента=gI
s=<cnt:[a-z]2:t2>= центов=gI
s=<cnt:[a-z]2:t3>= центам=gI
s=<cnt:[a-z]2:t4>= цента=gI
s=<cnt:[a-z]2:t5>= центами=gI
s=<cnt:[a-z]2:t6>= центах=gI
s=<cnt:[a-z]3:t1>= центов=gI
s=<cnt:[a-z]3:t2>= центов=gI
s=<cnt:[a-z]3:t3>= центам=gI
s=<cnt:[a-z]3:t4>= центов=gI
s=<cnt:[a-z]3:t5>= центами=gI
s=<cnt:[a-z]3:t6>= центах=gI
# рубли =
s=<rub:[a-z]1:t1>= рубль=gI
s=<rub:[a-z]1:t2>= рубля=gI
s=<rub:[a-z]1:t3>= рублю=gI
s=<rub:[a-z]1:t4>= рубль=gI
s=<rub:[a-z]1:t5>= рублем=gI
s=<rub:[a-z]1:t6>= рубле=gI
s=<rub:[a-z]2:t1>= рубля=gI
s=<rub:[a-z]2:t2>= рублей=gI
s=<rub:[a-z]2:t3>= рублям=gI
s=<rub:[a-z]2:t4>= рубля=gI
s=<rub:[a-z]2:t5>= рублями=gI
s=<rub:[a-z]2:t6>= рублях=gI
s=<rub:[a-z]3:t1>= рублей=gI
s=<rub:[a-z]3:t2>= рублей=gI
s=<rub:[a-z]3:t3>= рублям=gI
s=<rub:[a-z]3:t4>= рублей=gI
s=<rub:[a-z]3:t5>= рублями=gI
s=<rub:[a-z]3:t6>= рублях=gI
# копейки =
s=<kop:[a-z]1:t1>= копейка=gI
s=<kop:[a-z]1:t2>= копейки=gI
s=<kop:[a-z]1:t3>= копейке=gI
s=<kop:[a-z]1:t4>= копейку=gI
s=<kop:[a-z]1:t5>= копейкой=gI
s=<kop:[a-z]1:t6>= копейке=gI
s=<kop:[a-z]2:t1>= копейки=gI
s=<kop:[a-z]2:t2>= копеек=gI
s=<kop:[a-z]2:t3>= копейкам=gI
s=<kop:[a-z]2:t4>= копейки=gI
s=<kop:[a-z]2:t5>= копейками=gI
s=<kop:[a-z]2:t6>= копейках=gI
s=<kop:[a-z]3:t1>= копеек=gI
s=<kop:[a-z]3:t2>= копеек=gI
s=<kop:[a-z]3:t3>= копейкам=gI
s=<kop:[a-z]3:t4>= копейки=gI
s=<kop:[a-z]3:t5>= копейками=gI
s=<kop:[a-z]3:t6>= копейках=gI
# евро =
s=<eur:[a-z]([0-9]):t([0-9])>= евро=gI
# евроценты =
s=<ecn:[a-z]1:t1>= евроцент=gI
s=<ecn:[a-z]1:t2>= евроцента=gI
s=<ecn:[a-z]1:t3>= евроценту=gI
s=<ecn:[a-z]1:t4>= евроцент=gI
s=<ecn:[a-z]1:t5>= евроцентом=gI
s=<ecn:[a-z]1:t6>= евроценте=gI
s=<ecn:[a-z]2:t1>= евроцента=gI
s=<ecn:[a-z]2:t2>= евроцентов=gI
s=<ecn:[a-z]2:t3>= евроцентам=gI
s=<ecn:[a-z]2:t4>= евроцента=gI
s=<ecn:[a-z]2:t5>= евроцентами=gI
s=<ecn:[a-z]2:t6>= евроцентах=gI
s=<ecn:[a-z]3:t1>= евроцентов=gI
s=<ecn:[a-z]3:t2>= евроцентов=gI
s=<ecn:[a-z]3:t3>= евроцентам=gI
s=<ecn:[a-z]3:t4>= евроцентов=gI
s=<ecn:[a-z]3:t5>= евроцентами=gI
s=<ecn:[a-z]3:t6>= евроцентах=gI
# байт =
s=<byt:[a-z]1:t1>= байт=gI
s=<byt:[a-z]1:t2>= байта=gI
s=<byt:[a-z]1:t3>= байту=gI
s=<byt:[a-z]1:t4>= байт=gI
s=<byt:[a-z]1:t5>= байтом=gI
s=<byt:[a-z]1:t6>= байте=gI
s=<byt:[a-z]2:t1>= байта=gI
s=<byt:[a-z]2:t2>= байтов=gI
s=<byt:[a-z]2:t3>= байтам=gI
s=<byt:[a-z]2:t4>= байта=gI
s=<byt:[a-z]2:t5>= байтами=gI
s=<byt:[a-z]2:t6>= байтах=gI
s=<byt:[a-z]3:t1>= байтов=gI
s=<byt:[a-z]3:t2>= байтов=gI
s=<byt:[a-z]3:t3>= байтам=gI
s=<byt:[a-z]3:t4>= байтов=gI
s=<byt:[a-z]3:t5>= байтами=gI
s=<byt:[a-z]3:t6>= байтах=gI
# бит =
s=<bit:[a-z]1:t1>= бит=gI
s=<bit:[a-z]1:t2>= бита=gI
s=<bit:[a-z]1:t3>= биту=gI
s=<bit:[a-z]1:t4>= бит=gI
s=<bit:[a-z]1:t5>= битом=gI
s=<bit:[a-z]1:t6>= бите=gI
s=<bit:[a-z]2:t1>= бита=gI
s=<bit:[a-z]2:t2>= битов=gI
s=<bit:[a-z]2:t3>= битам=gI
s=<bit:[a-z]2:t4>= бита=gI
s=<bit:[a-z]2:t5>= битами=gI
s=<bit:[a-z]2:t6>= битах=gI
s=<bit:[a-z]3:t1>= битов=gI
s=<bit:[a-z]3:t2>= битов=gI
s=<bit:[a-z]3:t3>= битам=gI
s=<bit:[a-z]3:t4>= битов=gI
s=<bit:[a-z]3:t5>= битами=gI
s=<bit:[a-z]3:t6>= битах=gI
#порядки =
s=<kilo>\s*= кило=gI
s=<santi>\s*= санти=gI
s=<mili>\s*= милли=gI
s=<tera>\s*= тера=gI
s=<giga>\s*= гига=gI
s=<mega>\s*= мега=gI
s=<micro>\s*= микро=gI
s=<nano>\s*= нано=gI
# квадратный (метр) =
s=<sq:[a-z]1:t1>=квадратный=gI
s=<sq:[a-z]1:t2>=квадратных=gI
s=<sq:[a-z]1:t3>=квадратному=gI
s=<sq:[a-z]1:t4>=квадратный=gI
s=<sq:[a-z]1:t5>=квадратным=gI
s=<sq:[a-z]1:t6>=квадратном=gI
s=<sq:[a-z]2:t1>=квадратных=gI
s=<sq:[a-z]2:t2>=квадратных=gI
s=<sq:[a-z]2:t3>=квадратным=gI
s=<sq:[a-z]2:t4>=квадратных=gI
s=<sq:[a-z]2:t5>=квадратными=gI
s=<sq:[a-z]2:t6>=квадратных=gI
s=<sq:[a-z]3:t1>=квадратных=gI
s=<sq:[a-z]3:t2>=квадратных=gI
s=<sq:[a-z]3:t3>=квадратным=gI
s=<sq:[a-z]3:t4>=квадратных=gI
s=<sq:[a-z]3:t5>=квадратными=gI
s=<sq:[a-z]3:t6>=квадратных=gI
# кубический (метр) =
s=<cub:[a-z]1:t1>=кубический=gI
s=<cub:[a-z]1:t2>=кубических=gI
s=<cub:[a-z]1:t3>=кубическому=gI
s=<cub:[a-z]1:t4>=кубический=gI
s=<cub:[a-z]1:t5>=кубическим=gI
s=<cub:[a-z]1:t6>=кубическом=gI
s=<cub:[a-z]2:t1>=кубических=gI
s=<cub:[a-z]2:t2>=кубических=gI
s=<cub:[a-z]2:t3>=кубическим=gI
s=<cub:[a-z]2:t4>=кубических=gI
s=<cub:[a-z]2:t5>=кубическими=gI
s=<cub:[a-z]2:t6>=кубических=gI
s=<cub:[a-z]3:t1>=кубических=gI
s=<cub:[a-z]3:t2>=кубических=gI
s=<cub:[a-z]3:t3>=кубическим=gI
s=<cub:[a-z]3:t4>=кубических=gI
s=<cub:[a-z]3:t5>=кубическими=gI
s=<cub:[a-z]3:t6>=кубических=gI
########################################################################################=
# склонение групп чисел =
s=<([0-9]+):0:t([0-9])>==gI
# од.м.р.ц. =
s=<([0-9]+):j([0-9]):t4>=<\1:a\2:t2>=gI
s=<([0-9]+):j([0-9]):t([0-9])>=<\1:a\2:t\3>=gI
# од.м.р.п. =
s=<([0-9]+):k([0-9]):t4>=<\1:d\2:t2>=gI
s=<([0-9]+):k([0-9]):t([0-9])>=<\1:d\2:t\3>=gI
# од.ж.р.ц. =
s=<([0-9]+):l([0-9]):t4>=<\1:b\2:t2>=gI
s=<([0-9]+):l([0-9]):t([0-9])>=<\1:b\2:t\3>=gI
# од.ж.р.п. =
s=<([0-9]+):m([0-9]):t4>=<\1:e\2:t2>=gI
s=<([0-9]+):m([0-9]):t([0-9])>=<\1:e\2:t\3>=gI
# од.мн.ц. =
s=<([0-9]+):n([0-9]):t4>=<\1:g\2:t2>=gI
s=<([0-9]+):n([0-9]):t([0-9])>=<\1:g\2:t\3>=gI
# од.мн.п. =
s=<([0-9]+):o([0-9]):t4>=<\1:f\2:t2>=gI
s=<([0-9]+):o([0-9]):t([0-9])>=<\1:f\2:t\3>=gI
# м.р.цел =
s=<([0-9]+):a([0-9]):t1>=\1=gI
s=<([0-9]+):a([0-9]):t2>=\1-го=gI
s=<([0-9]+):a([0-9]):t3>=\1-му=gI
s=<([0-9]+):a([0-9]):t4>=\1=gI
s=<([0-9]+):a([0-9]):t5>=\1-им=gI
s=<([0-9]+):a([0-9]):t6>=\1-ом=gI
# м.р.пор. =
s=<([0-9]+):d([0-9]):t1>=\1-ый=gI
s=<([0-9]+):d([0-9]):t2>=\1-ого=gI
s=<([0-9]+):d([0-9]):t3>=\1-ому=gI
s=<([0-9]+):d([0-9]):t4>=\1-ый=gI
s=<([0-9]+):d([0-9]):t5>=\1-ым=gI
s=<([0-9]+):d([0-9]):t6>=\1-м=gI
# ж.р.цел ед.чис. =
s=<([0-9]+):b([0-9]):t1>=\1-а=gI
s=<([0-9]+):b([0-9]):t2>=\1-ой=gI
s=<([0-9]+):b([0-9]):t3>=\1-ой=gI
s=<([0-9]+):b([0-9]):t4>=\1-у=gI
s=<([0-9]+):b([0-9]):t5>=\1-ой=gI
s=<([0-9]+):b([0-9]):t6>=\1-ой=gI
#<([0-9]+):b2:t1>=\1-а
#<([0-9]+):b2:t2>=\1-ой
#<([0-9]+):b2:t3>=\1-му
#<([0-9]+):b2:t4>=\1-а
#<([0-9]+):b2:t5>=\1-ою
#<([0-9]+):b2:t6>=\1-ой
#<([0-9]+):b3:t1>=\1-а
#<([0-9]+):b3:t2>=\1-ой
#<([0-9]+):b3:t3>=\1-му
#<([0-9]+):b3:t4>=\1-а
#<([0-9]+):b3:t5>=\1-ою
#<([0-9]+):b3:t6>=\1-ой
# ж.р.пор. =
s=<([0-9]+):e([0-9]):t1>=\1-я=gI
s=<([0-9]+):e([0-9]):t2>=\1-й=gI
s=<([0-9]+):e([0-9]):t3>=\1-й=gI
s=<([0-9]+):e([0-9]):t4>=\1-ю=gI
s=<([0-9]+):e([0-9]):t5>=\1-й=gI
s=<([0-9]+):e([0-9]):t6>=\1-й=gI
# с.р.пор. =
s=<([0-9]+):c([0-9]):t1>=\1-е=gI
s=<([0-9]+):c([0-9]):t2>=\1-ого=gI
s=<([0-9]+):c([0-9]):t3>=\1-ому=gI
s=<([0-9]+):c([0-9]):t4>=\1-е=gI
s=<([0-9]+):c([0-9]):t5>=\1-ым=gI
s=<([0-9]+):c([0-9]):t6>=\1-м=gI
# с.р.цел. =
s=<([0-9]+):h([0-9]):t1>=\1-о=gI
s=<([0-9]+):h([0-9]):t2>=\1-го=gI
s=<([0-9]+):h([0-9]):t3>=\1-му=gI
s=<([0-9]+):h([0-9]):t4>=\1-о=gI
s=<([0-9]+):h([0-9]):t5>=\1-им=gI
s=<([0-9]+):h([0-9]):t6>=\1-ом=gI
# мн.пор. =
s=<([0-9]+):f([0-9]):t1>=\1-ые=gI
s=<([0-9]+):f([0-9]):t2>=\1-х=gI
s=<([0-9]+):f([0-9]):t3>=\1-ым=gI
s=<([0-9]+):f([0-9]):t4>=\1-ые=gI
s=<([0-9]+):f([0-9]):t5>=\1-ми=gI
s=<([0-9]+):f([0-9]):t6>=\1-х=gI
# мн.цел. =
s=<([0-9]+):g([0-9]):t1>=\1-и=gI
s=<([0-9]+):g([0-9]):t2>=\1-их=gI
s=<([0-9]+):g([0-9]):t3>=\1-их=gI
s=<([0-9]+):g([0-9]):t4>=\1-и=gI
s=<([0-9]+):g([0-9]):t5>=\1-ими=gI
s=<([0-9]+):g([0-9]):t6>=\1-их=gI
# соб. =
s=<([0-9]+):p([0-9]):t1>=\1-ро=gI
s=<([0-9]+):p([0-9]):t2>=\1-ых=gI
s=<([0-9]+):p([0-9]):t3>=\1-рым=gI
s=<([0-9]+):p([0-9]):t4>=\1-ро=gI
s=<([0-9]+):p([0-9]):t5>=\1-ыми=gI
s=<([0-9]+):p([0-9]):t6>=\1-ах=gI
# од.соб. =
s=<([0-9]+):q([0-9]):t4>=<\1:p\2:t2>=gI
s=<([0-9]+):q([0-9]):t([0-9])>=<\1:p\2:t\3>=gI
# =
s=<([0-9]+):([a-z]+)([0-9]):t([0-9])>=\1=gI
s=\b(половиной)\b°=\1 градуса=gI
s=\b(половиной)\b\s\b(см)\b=половиной сантиметра=gI
########################################################################################### Сокращения =
s=\bг\.\s([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ]\w+)=город \1=g
# Цифровые окончания (начало) =
###########################################################################################=
# =
s=\b[0]-\bго\b=ноль=gI
#\b[0]-\bго\b=ноля
s=\b[0]-\bму\b=нолю=gI
s=\b[0]-\bим\b=нолём=gI
s=\b[0]-\bом\b=ноле=gI
s=\b[0]-\bа\b=ноль=gI
s=\b[0][0]-\bа\b=ноль=gI
s=\b[0]-\bой\b=ноля=gI
s=\b[0]-\bу\b=ноль=gI
s=\b[0]-\bою\b=нолём=gI
s=\b[0]-\bо\b=ноль=gI
s=\b[0]-\bими\b=нолями=gI
s=\b[0]-\bих\b=нолях=gI
s=\b[0]-\bи\b=ноль=gI
s=\b[0]-\bый\b=нулевой=gI
s=\b[0]-\bого\b=нулевого=gI
s=\b[0]-\bому\b=нулевому=gI
s=\b[0]-\bым\b=нулевым=gI
s=\b[0]-\bм\b=нулевом=gI
s=\b[0]-\bя\b=нулевая=gI
s=\b[0]-\bй\b=нулевой=gI
s=\b[0]-\bю\b=нулевую=gI
s=\b[0]-\bе\b=нулевое=gI
s=\b[0]-\bх\b=нулевых=gI
s=\b[0]-\bые\b=нулевые=gI
s=\b[0]-\bми\b=нулевыми=gI
# Количественные числительные =
s=\b([0-9])([0-9])([0-9])([0-9])\s?-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.3.\1.\5> <10.2.\2.\5> <10.1.\3.\5> <10.0.\4.\5> <скл.цел.числ.кон.>=g
s=\b([0-9])([0-9])([0-9])([0-9])\s?-\s?(\bро\b)=<скл.цел.числ.нач.> <10.3.\1.\5> <10.2.\2.\5> <10.1.\3.\5> <10.0.\4.\5> <скл.цел.числ.кон.>=g
s=\b([0-9])([0-9])([0-9])\s?-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.2.\1.\4> <10.1.\2.\4> <10.0.\3.\4> <скл.цел.числ.кон.>=g
s=\b([0-9])([0-9])([0-9])\s?-\s?(\bро\b)=<скл.цел.числ.нач.> <10.2.\1.\4> <10.1.\2.\4> <10.0.\3.\4> <скл.цел.числ.кон.>=g
s=\b([0-9])([0-9])\s?-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.1.\1.\3> <10.0.\2.\3> <скл.цел.числ.кон.>=g
s=\b([0-9])([0-9])\s?-\s?(\bро\b)=<скл.цел.числ.нач.> <10.1.\1.\3> <10.0.\2.\3> <скл.цел.числ.кон.>=g
s=\b([0-9])\s?-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)=<скл.цел.числ.нач.> <10.0.\1.\2> <скл.цел.числ.кон.>=g
s=\b([0-9])\s?-\s?(\bро\b)=<скл.цел.числ.нач.> <10.0.\1.\2> <скл.цел.числ.кон.>=g
# Порядковые числительные =
s=\b([0-9])([0-9])([0-9])([0-9])\s?-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.3.\1.> <10.2.\2.> <10.1.\3.> <10.0.\4.\5> <скл.пор.числ.кон.>=g
s=\b([0-9])([0-9])([0-9])\s?-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.2.\1.> <10.1.\2.> <10.0.\3.\4> <скл.пор.числ.кон.>=g
s=\b([0-9])([0-9])\s?-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.1.\1.> <10.0.\2.\3> <скл.пор.числ.кон.>=g
s=\b([0-9])\s?-\s?(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)=<скл.пор.числ.нач.> <10.0.\1.\2> <скл.пор.числ.кон.>=g
# Cобирательные числительные =
s=\b(2|3)(0)\s?-\s?(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)=<скл.соб.числ.нач.> <10.1.\1.\3> <10.0.\2.\3> <скл.соб.числ.кон.>=g
s=\b(1)([0-9])\s?-\s?(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)=<скл.соб.числ.нач.> <10.1.\1.\3> <10.0.\2.\3> <скл.соб.числ.кон.>=g
s=\b([2-9])\s?-\s?(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)=<скл.соб.числ.нач.> <10.0.\1.\2> <скл.соб.числ.кон.>=g
# Коррекция ноля для порядковых числительных =
s=<10\.1\.([0-9])\.>\s<10\.0\.0\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.1.\1.\2> <02.\2>=gI
s=<10\.2\.([0-9])\.>\s<10\.1\.0\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.2.\1.\2> <02.\2>=gI
s=<10\.3\.([0-9])\.>\s<10\.2\.0\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.3.\1.\2> <02.\2>=gI
# Коррекция ноля для количественных числительных =
s=<10\.1\.([0-9])\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})>=<10.1.\1.0> <0.\3>=gI
s=<10\.2\.([0-9])\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})>\s<10\.1\.0\.0>\s<0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})>=<10.2.\1.\2> <0.\3>=gI
s=<10\.3\.([0-9])\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})>\s<10\.2\.0\.0>\s<0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})>=<10.3.\1.\2> <0.\3>=gI
s=<10\.([0-9])\.([0-9])\.0>\s<0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})>=<10.\1.\2.\3>=gI
s=<0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>==gI
s=<02\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>==gI
#
s=<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>\s<10\.([0-9]+)\.([0-9]+)\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=<10.\2.\3.\4>=gI
s=<10\.([1-9])\.([2-9])\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>\s<10\.0\.0\.>=<10.\1.\2.\3>=gI
##########################################################################################=
# Коррекция степеней =
##########################################################################################=
s=<скл\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\.числ\.нач\.>\s+<10\.3\.1\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>\s+<скл\.пор\.числ\.кон\.>=<10.3.1.\2>=gI
s=<скл\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\.числ\.нач\.>\s+<10\.3\.([2-9])\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>\s+<скл\.пор\.числ\.кон\.>=<10.0.\2.го> <10.3.1.\3>=gI
s=<скл\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)\.числ\.нач\.>\s+<10\.3\.1\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.0.1.а> <10.3.1.а>=gI
s=<10\.3\.([2-4])\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.0.\1.а> <10.3.1.ой>=gI
s=<10\.3\.([5-9])\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)?>=<10.0.\1.а> <10.3.1.>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bго\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bму\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bим\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ом>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bом\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bа\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bой\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bо\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bими\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ою>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bи\b)>((\s(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>))+)?\s+<скл\.цел\.числ\.кон\.>=<10.3.1.ой>=gI
s=((<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>\s){3,999})<10\.3\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>==gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.1\.(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)>=<10.0.1.\1> <10.3.1.\1>=gI
s=<скл\.цел\.числ\.нач\.>\s+<10\.3\.([2-9])\.(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b)>=<10.0.\1.\2> <10.3.1.\2>=gI
#---------
s=<10\.0\.1\.(\bго\b)>\s+<10\.3\.1\.(\bго\b)>=<10.3.1.ой>=gI
s=<10\.0\.([0-9]+)\.(\bго\b)>\s+<10\.3\.1\.(\bго\b)>=<10.0.\1.\2> <10.3.1.>=gI
s=<10\.0\.1\.(\bму\b)>\s+<10\.3\.1\.(\bму\b)>=<10.3.1.ой>=gI
s=<10\.0\.([0-9]+)\.(\bму\b)>\s+<10\.3\.1\.(\bму\b)>=<10.0.\1.\2> <10.3.1.\3>=gI
s=<10\.0\.1\.(\bим\b)>\s+<10\.3\.1\.(\bим\b)>=<10.3.1.ом>=gI
s=<10\.0\.([2-9])\.(\bим\b)>\s+<10\.3\.1\.(\bим\b)>=<10.0.\1.\2> <10.3.1.ими>=gI
s=<10\.0\.1\.(\bом\b)>\s+<10\.3\.1\.(\bом\b)>=<10.3.1.ой>=gI
s=<10\.0\.([2-9])\.(\bом\b)>\s+<10\.3\.1\.(\bом\b)>=<10.0.\1.\2> <10.3.1.ах>=gI
s=<10\.0\.1\.(\bа\b)>\s+<10\.3\.1\.(\bа\b)>=<10.3.1.\2>=gI
s=<10\.0\.([2-9])\.(\bа\b)>\s+<10\.3\.1\.(\bа\b)>=<10.0.\1.\2> <10.3.1.>=gI
s=<10\.0\.1\.(\bой\b)>\s+<10\.3\.1\.(\bой\b)>=<10.3.1.\2>=gI
s=<10\.0\.([2-9])\.(\bой\b)>\s+<10\.3\.1\.(\bой\b)>=<10.0.\1.\2> <10.3.1.му>=gI
s=<10\.0\.1\.(\bу\b)>\s+<10\.3\.1\.(\bу\b)>=<10.3.1.\2>=gI
s=<10\.0\.1\.(\bу\b)>\s+<10\.3\.1\.(\bу\b)>=<10.0.\1.\2> <10.3.1.ро>=gI
s=<10\.0\.([2-4])\.(\bу\b)>\s+<10\.3\.1\.(\bу\b)>=<10.0.\1.\2> <10.3.1.ой>=gI
s=<10\.0\.([5-9])\.(\bу\b)>\s+<10\.3\.1\.(\bу\b)>=<10.0.\1.\2> <10.3.1.>=gI
s=<10\.0\.1\.(\bою\b)>\s+<10\.3\.1\.(\bою\b)>=<10.3.1.\2>=gI
s=<10\.0\.([2-9])\.(\bою\b)>\s+<10\.3\.1\.(\bою\b)>=<10.0.\1.\2> <10.3.1.ими>=gI
s=<10\.0\.1\.(\bо\b)>\s+<10\.3\.1\.(\bо\b)>=<10.3.1.ой>=gI
s=<10\.0\.([2-9])\.(\bо\b)>\s+<10\.3\.1\.(\bо\b)>=<10.0.\1.а> <10.3.1.>=gI
s=<10\.0\.1\.(\bими\b)>\s+<10\.3\.1\.(\bими\b)>=<10.3.1.ою>=gI
s=<10\.0\.([2-9])\.(\bими\b)>\s+<10\.3\.1\.(\bими\b)>=<10.0.\1.\2> <10.3.1.\3>=gI
s=<10\.0\.1\.(\bих\b)>\s+<10\.3\.1\.(\bих\b)>=<10.3.1.ой>=gI
s=<10\.0\.([2-9])\.(\bих\b)>\s+<10\.3\.1\.(\bих\b)>=<10.0.\1.\2> <10.3.1.>=gI
s=<10\.0\.1\.(\bи\b)>\s+<10\.3\.1\.(\bи\b)>=<10.3.1.ой>=gI
s=<10\.0\.([2-9])\.(\bи\b)>\s+<10\.3\.1\.(\bи\b)>=<10.0.\1.а> <10.3.1.ах>=gI
#-----
s=<10\.([1-2])\.([4-9])\.(\bро\b)>\s+<10\.0\.([0-9]+)\.(\bро\b)>=<10.\1.\2.> <10.0.\4.>=gI
s=<10\.([1-2])\.([4-9])\.(\bых\b)>\s+<10\.0\.([0-9]+)\.(\bых\b)>=<10.\1.\2.го> <10.0.\4.го>=gI
s=<10\.([1-2])\.([4-9])\.(\bым\b)>\s+<10\.0\.([0-9]+)\.(\bым\b)>=<10.\1.\2.му> <10.0.\4.му>=gI
s=<10\.([1-2])\.([4-9])\.(\bыми\b)>\s+<10\.0\.([0-9]+)\.(\bыми\b)>=<10.\1.\2.им> <10.0.\4.им>=gI
s=<10\.([1-2])\.([4-9])\.(\bыми\b)>\s+<10\.0\.([0-9]+)\.(\bыми\b)>=<10.\1.\2.ом> <10.0.\4.ом>=gI
#
s=<10\.1\.([0-9]+)\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>\s+<10\.0\.([0-9]+)\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>=<10.1.\1.> <10.0.\3.\4>=gI
s=<10\.1\.1\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>\s+<10\.0\.([0-9]+)\.(\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)>=<10.1.1.> <10.0.\2.\3>=gI
##########################################################################################=
s=(<10\.([0-9]+)\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>)+==gI
s=<10\.([1-9])\.([2-9])\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>\s<10\.0\.0\.>=<10.\1.\2.\3>=gI
##########################################################################################=
# коррекция для двух- трех- ... -тысячного =
s=(<10\.0\.[0-9]+\.\bго\b>)\s+(<10\.3\.1\.(\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b)>)=\1\2=gI
# Замена чисел словами =
s=<10\.1\.1\.>\s<10\.0\.0\.>=десять=gI
s=<10\.1\.1\.>\s<10\.0\.1\.>=одиннадцать=gI
s=<10\.1\.1\.>\s<10\.0\.2\.>=двенадцать=gI
s=<10\.1\.1\.>\s<10\.0\.3\.>=тринадцать=gI
s=<10\.1\.1\.>\s<10\.0\.4\.>=четырнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.5\.>=пятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.6\.>=шестнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.7\.>=семнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.8\.>=восемнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.9\.>=девятнадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десять=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцать=gI
s=<10\.1\.1\.\bа\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцать=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десяти=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцати=gI
s=<10\.1\.1\.\bго\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцати=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатое=gI
s=<10\.1\.1\.\bе\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатое=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десять=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцать=gI
s=<10\.1\.1\.\bи\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцать=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатью=gI
s=<10\.1\.1\.\bим\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатью=gI
s=<10\.1\.1\.\bими\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатью=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десяти=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцати=gI
s=<10\.1\.1\.\bих\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцати=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатый=gI
s=<10\.1\.1\.\bй\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатой=gI
s=<10\.1\.1\.\bый\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатый=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатом=gI
s=<10\.1\.1\.\bм\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатом=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатыми=gI
s=<10\.1\.1\.\bми\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатыми=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десяти=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцати=gI
s=<10\.1\.1\.\bму\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцати=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десять=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцать=gI
s=<10\.1\.1\.\bо\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцать=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатого=gI
s=<10\.1\.1\.\bого\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатого=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десяти=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцати=gI
s=<10\.1\.1\.\bой\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десяти=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцати=gI
s=<10\.1\.1\.\bом\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцати=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатому=gI
s=<10\.1\.1\.\bому\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатому=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатью=gI
s=<10\.1\.1\.\bою\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатью=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десять=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцать=gI
s=<10\.1\.1\.\bу\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцать=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатых=gI
s=<10\.1\.1\.\bх\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатых=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатые=gI
s=<10\.1\.1\.\bые\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатые=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатым=gI
s=<10\.1\.1\.\bым\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатым=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатую=gI
s=<10\.1\.1\.\bю\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатую=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=десятая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.1\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=одиннадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.2\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=двенадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.3\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=тринадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.4\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=четырнадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.5\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=пятнадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.6\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=шестнадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.7\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=семнадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.8\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=восемнадцатая=gI
s=<10\.1\.1\.\bя\b>\s<10\.0\.9\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>=девятнадцатая=gI
# =
s=<10\.1\.1\.>\s<10\.0\.0\.\bро\b>=десятеро=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bро\b>=одиннадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bро\b>=двенадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bро\b>=тринадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bро\b>=четырнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bро\b>=пятнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bро\b>=шестнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bро\b>=семнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bро\b>=восемнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bро\b>=девятнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bых\b>=десятерых=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bых\b>=одиннадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bых\b>=двенадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bых\b>=тринадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bых\b>=четырнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bых\b>=пятнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bых\b>=шестнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bых\b>=семнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bых\b>=восемнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bых\b>=девятнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bрым\b>=десятерым=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bрым\b>=одиннадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bрым\b>=двенадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bрым\b>=тринадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bрым\b>=четырнадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bрым\b>=пятнадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bрым\b>=шестнадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bрым\b>=семнадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bрым\b>=восемнадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bрым\b>=девятнадцатерым=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bро\b>=десятеро=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bро\b>=одиннадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bро\b>=двенадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bро\b>=тринадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bро\b>=четырнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bро\b>=пятнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bро\b>=шестнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bро\b>=семнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bро\b>=восемнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bро\b>=девятнадцатеро=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bых\b>=десятерых=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bых\b>=одиннадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bых\b>=двенадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bых\b>=тринадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bых\b>=четырнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bых\b>=пятнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bых\b>=шестнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bых\b>=семнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bых\b>=восемнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bых\b>=девятнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bыми\b>=десятерыми=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bыми\b>=одиннадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bыми\b>=двенадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bыми\b>=тринадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bыми\b>=четырнадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bыми\b>=пятнадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bыми\b>=шестнадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bыми\b>=семнадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bыми\b>=восемнадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bыми\b>=девятнадцатерыми=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bах\b>=десятерых=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bах\b>=одиннадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bах\b>=двенадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bах\b>=тринадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bах\b>=четырнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bах\b>=пятнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bах\b>=шестнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bах\b>=семнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bах\b>=восемнадцатерых=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bах\b>=девятнадцатерых=gI
# =
s=<10\.1\.1\.>\s<10\.0\.0\.\bа\b>=десять=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bа\b>=одиннадцать=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bа\b>=двенадцать=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bа\b>=тринадцать=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bа\b>=четырнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bа\b>=пятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bа\b>=шестнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bа\b>=семнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bа\b>=восемнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bа\b>=девятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bго\b>=десяти=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bго\b>=одиннадцати=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bго\b>=двенадцати=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bго\b>=тринадцати=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bго\b>=четырнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bго\b>=пятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bго\b>=шестнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bго\b>=семнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bго\b>=восемнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bго\b>=девятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bе\b>=десятое=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bе\b>=одиннадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bе\b>=двенадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bе\b>=тринадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bе\b>=четырнадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bе\b>=пятнадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bе\b>=шестнадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bе\b>=семнадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bе\b>=восемнадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bе\b>=девятнадцатое=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bи\b>=десять=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bи\b>=одиннадцать=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bи\b>=двенадцать=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bи\b>=тринадцать=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bи\b>=четырнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bи\b>=пятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bи\b>=шестнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bи\b>=семнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bи\b>=восемнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bи\b>=девятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bим\b>=десятью=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bим\b>=одиннадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bим\b>=двенадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bим\b>=тринадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bим\b>=четырнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bим\b>=пятнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bим\b>=шестнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bим\b>=семнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bим\b>=восемнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bим\b>=девятнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bими\b>=десятью=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bими\b>=одиннадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bими\b>=двенадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bими\b>=тринадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bими\b>=четырнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bими\b>=пятнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bими\b>=шестнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bими\b>=семнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bими\b>=восемнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bими\b>=девятнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bих\b>=десяти=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bих\b>=одиннадцати=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bих\b>=двенадцати=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bих\b>=тринадцати=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bих\b>=четырнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bих\b>=пятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bих\b>=шестнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bих\b>=семнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bих\b>=восемнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bих\b>=девятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bй\b>=десятой=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bый\b>=десятый=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bй\b>=одиннадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bый\b>=одиннадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bй\b>=двенадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bый\b>=двенадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bй\b>=тринадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bый\b>=тринадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bй\b>=четырнадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bый\b>=четырнадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bй\b>=пятнадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bый\b>=пятнадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bй\b>=шестнадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bый\b>=шестнадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bй\b>=семнадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bый\b>=семнадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bй\b>=восемнадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bый\b>=восемнадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bй\b>=девятнадцатой=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bый\b>=девятнадцатый=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bм\b>=десятом=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bм\b>=одиннадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bм\b>=двенадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bм\b>=тринадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bм\b>=четырнадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bм\b>=пятнадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bм\b>=шестнадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bм\b>=семнадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bм\b>=восемнадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bм\b>=девятнадцатом=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bми\b>=десятыми=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bми\b>=одиннадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bми\b>=двенадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bми\b>=тринадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bми\b>=четырнадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bми\b>=пятнадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bми\b>=шестнадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bми\b>=семнадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bми\b>=восемнадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bми\b>=девятнадцатыми=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bму\b>=десяти=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bму\b>=одиннадцати=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bму\b>=двенадцати=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bму\b>=тринадцати=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bму\b>=четырнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bму\b>=пятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bму\b>=шестнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bму\b>=семнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bму\b>=восемнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bму\b>=девятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bо\b>=десять=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bо\b>=одиннадцать=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bо\b>=двенадцать=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bо\b>=тринадцать=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bо\b>=четырнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bо\b>=пятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bо\b>=шестнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bо\b>=семнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bо\b>=восемнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bо\b>=девятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bого\b>=десятого=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bого\b>=одиннадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bого\b>=двенадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bого\b>=тринадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bого\b>=четырнадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bого\b>=пятнадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bого\b>=шестнадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bого\b>=семнадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bого\b>=восемнадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bого\b>=девятнадцатого=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bой\b>=десяти=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bой\b>=одиннадцати=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bой\b>=двенадцати=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bой\b>=тринадцати=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bой\b>=четырнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bой\b>=пятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bой\b>=шестнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bой\b>=семнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bой\b>=восемнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bой\b>=девятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bом\b>=десяти=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bом\b>=одиннадцати=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bом\b>=двенадцати=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bом\b>=тринадцати=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bом\b>=четырнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bом\b>=пятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bом\b>=шестнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bом\b>=семнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bом\b>=восемнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bом\b>=девятнадцати=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bому\b>=десятому=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bому\b>=одиннадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bому\b>=двенадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bому\b>=тринадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bому\b>=четырнадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bому\b>=пятнадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bому\b>=шестнадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bому\b>=семнадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bому\b>=восемнадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bому\b>=девятнадцатому=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bою\b>=десятью=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bою\b>=одиннадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bою\b>=двенадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bою\b>=тринадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bою\b>=четырнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bою\b>=пятнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bою\b>=шестнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bою\b>=семнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bою\b>=восемнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bою\b>=девятнадцатью=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bу\b>=десять=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bу\b>=одиннадцать=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bу\b>=двенадцать=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bу\b>=тринадцать=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bу\b>=четырнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bу\b>=пятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bу\b>=шестнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bу\b>=семнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bу\b>=восемнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bу\b>=девятнадцать=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bх\b>=десятых=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bх\b>=одиннадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bх\b>=двенадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bх\b>=тринадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bх\b>=четырнадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bх\b>=пятнадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bх\b>=шестнадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bх\b>=семнадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bх\b>=восемнадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bх\b>=девятнадцатых=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bые\b>=десятые=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bые\b>=одиннадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bые\b>=двенадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bые\b>=тринадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bые\b>=четырнадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bые\b>=пятнадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bые\b>=шестнадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bые\b>=семнадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bые\b>=восемнадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bые\b>=девятнадцатые=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bым\b>=десятым=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bым\b>=одиннадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bым\b>=двенадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bым\b>=тринадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bым\b>=четырнадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bым\b>=пятнадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bым\b>=шестнадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bым\b>=семнадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bым\b>=восемнадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bым\b>=девятнадцатым=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bю\b>=десятую=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bю\b>=одиннадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bю\b>=двенадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bю\b>=тринадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bю\b>=четырнадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bю\b>=пятнадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bю\b>=шестнадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bю\b>=семнадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bю\b>=восемнадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bю\b>=девятнадцатую=gI
s=<10\.1\.1\.>\s<10\.0\.0\.\bя\b>=десятая=gI
s=<10\.1\.1\.>\s<10\.0\.1\.\bя\b>=одиннадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.2\.\bя\b>=двенадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.3\.\bя\b>=тринадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.4\.\bя\b>=четырнадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.5\.\bя\b>=пятнадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.6\.\bя\b>=шестнадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.7\.\bя\b>=семнадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.8\.\bя\b>=восемнадцатая=gI
s=<10\.1\.1\.>\s<10\.0\.9\.\bя\b>=девятнадцатая=gI
# =
s=<10\.1\.1\.\bа\b>=десять=gI
s=<10\.1\.1\.\bго\b>=десяти=gI
s=<10\.1\.1\.\bе\b>=десятое=gI
s=<10\.1\.1\.\bи\b>=десять=gI
s=<10\.1\.1\.\bим\b>=десятью=gI
s=<10\.1\.1\.\bими\b>=десятью=gI
s=<10\.1\.1\.\bих\b>=десяти=gI
s=<10\.1\.1\.\bй\b>=десятой=gI
s=<10\.1\.1\.\bый\b>=десятый=gI
s=<10\.1\.1\.\bм\b>=десятом=gI
s=<10\.1\.1\.\bми\b>=десятыми=gI
s=<10\.1\.1\.\bму\b>=десяти=gI
s=<10\.1\.1\.\bо\b>=десять=gI
s=<10\.1\.1\.\bого\b>=десятого=gI
s=<10\.1\.1\.\bой\b>=десяти=gI
s=<10\.1\.1\.\bом\b>=десяти=gI
s=<10\.1\.1\.\bому\b>=десятому=gI
s=<10\.1\.1\.\bою\b>=десятью=gI
s=<10\.1\.1\.\bу\b>=десять=gI
s=<10\.1\.1\.\bх\b>=десятых=gI
s=<10\.1\.1\.\bые\b>=десятые=gI
s=<10\.1\.1\.\bым\b>=десятым=gI
s=<10\.1\.1\.\bю\b>=десятую=gI
s=<10\.1\.1\.\bя\b>=десятая=gI
s=<10\.1\.1\.\bро\b>=десятеро=gI
s=<10\.1\.1\.\bых\b>=десятерых=gI
s=<10\.1\.1\.\bрым\b>=десятерым=gI
s=<10\.1\.1\.\bро\b>=десятеро=gI
s=<10\.1\.1\.\bых\b>=десятерых=gI
s=<10\.1\.1\.\bыми\b>=десятерыми=gI
s=<10\.1\.1\.\bах\b>=десятерых=gI
s=<10\.1\.1\.\bки\b>=десятки=gI
s=<10\.1\.1\.>=десять=gI
# =
#<10\.3\.1\.\bах\b>=тысячах
s=<10\.0\.1\.>=один=gI
s=<10\.0\.1\.\bро\b>=один=gI
s=<10\.0\.1\.\bых\b>=одного=gI
s=<10\.0\.1\.\bрым\b>=одному=gI
s=<10\.0\.1\.\bыми\b>=одним=gI
s=<10\.0\.1\.\bах\b>=одном=gI
s=<10\.0\.1\.\bа\b>=одна=gI
s=<10\.0\.1\.\bго\b>=одного=gI
s=<10\.0\.1\.\bе\b>=первое=gI
s=<10\.0\.1\.\bи\b>=одни=gI
s=<10\.0\.1\.\bим\b>=одним=gI
s=<10\.0\.1\.\bими\b>=одними=gI
s=<10\.0\.1\.\bих\b>=одних=gI
s=<10\.0\.1\.\bй\b>=первой=gI
s=<10\.0\.1\.\bый\b>=первый=gI
s=<10\.0\.1\.\bм\b>=первом=gI
s=<10\.0\.1\.\bми\b>=первыми=gI
s=<10\.0\.1\.\bму\b>=одному=gI
s=<10\.0\.1\.\bо\b>=одно=gI
s=<10\.0\.1\.\bого\b>=первого=gI
s=<10\.0\.1\.\bой\b>=одной=gI
s=<10\.0\.1\.\bом\b>=одном=gI
s=<10\.0\.1\.\bому\b>=первому=gI
s=<10\.0\.1\.\bою\b>=одною=gI
s=<10\.0\.1\.\bу\b>=одну=gI
s=<10\.0\.1\.\bх\b>=первых=gI
s=<10\.0\.1\.\bые\b>=первые=gI
s=<10\.0\.1\.\bым\b>=первым=gI
s=<10\.0\.1\.\bю\b>=первую=gI
s=<10\.0\.1\.\bя\b>=первая=gI
s=<10\.0\.2\.>=два=gI
s=<10\.0\.2\.\bро\b>=двое=gI
s=<10\.0\.2\.\bых\b>=двоих=gI
s=<10\.0\.2\.\bрым\b>=двоим=gI
s=<10\.0\.2\.\bыми\b>=двоими=gI
s=<10\.0\.2\.\bах\b>=двоих=gI
s=<10\.0\.2\.\bа\b>=две=gI
s=<10\.0\.2\.\bго\b>=двух=gI
s=<10\.0\.2\.\bе\b>=второе=gI
s=<10\.0\.2\.\bи\b>=два=gI
s=<10\.0\.2\.\bим\b>=двумя=gI
s=<10\.0\.2\.\bими\b>=двумя=gI
s=<10\.0\.2\.\bих\b>=двух=gI
s=<10\.0\.2\.\bй\b>=второй=gI
s=<10\.0\.2\.\bый\b>=второй=gI
s=<10\.0\.2\.\bм\b>=втором=gI
s=<10\.0\.2\.\bми\b>=вторыми=gI
s=<10\.0\.2\.\bму\b>=двум=gI
s=<10\.0\.2\.\bо\b>=два=gI
s=<10\.0\.2\.\bого\b>=второго=gI
s=<10\.0\.2\.\bой\b>=двух=gI
s=<10\.0\.2\.\bом\b>=двух=gI
s=<10\.0\.2\.\bому\b>=второму=gI
s=<10\.0\.2\.\bою\b>=двумя=gI
s=<10\.0\.2\.\bу\b>=две=gI
s=<10\.0\.2\.\bх\b>=вторых=gI
s=<10\.0\.2\.\bые\b>=вторые=gI
s=<10\.0\.2\.\bым\b>=вторым=gI
s=<10\.0\.2\.\bю\b>=вторую=gI
s=<10\.0\.2\.\bя\b>=вторая=gI
s=<10\.0\.2\.\bки\b>=двойки=gI
s=<10\.0\.3\.>=три=gI
s=<10\.0\.3\.\bро\b>=трое=gI
s=<10\.0\.3\.\bых\b>=троих=gI
s=<10\.0\.3\.\bрым\b>=троим=gI
s=<10\.0\.3\.\bыми\b>=троими=gI
s=<10\.0\.3\.\bах\b>=троих=gI
s=<10\.0\.3\.\bа\b>=три=gI
s=<10\.0\.3\.\bго\b>=трёх=gI
s=<10\.0\.3\.\bе\b>=третье=gI
s=<10\.0\.3\.\bи\b>=три=gI
s=<10\.0\.3\.\bим\b>=тремя=gI
s=<10\.0\.3\.\bими\b>=тремя=gI
s=<10\.0\.3\.\bих\b>=трёх=gI
s=<10\.0\.3\.\bый\b>=третий=gI
s=<10\.0\.3\.\bй\b>=третьей=gI
s=<10\.0\.3\.\bм\b>=третьем=gI
s=<10\.0\.3\.\bми\b>=третьими=gI
s=<10\.0\.3\.\bму\b>=трём=gI
s=<10\.0\.3\.\bо\b>=три=gI
s=<10\.0\.3\.\bого\b>=третьего=gI
s=<10\.0\.3\.\bой\b>=трёх=gI
s=<10\.0\.3\.\bом\b>=трёх=gI
s=<10\.0\.3\.\bому\b>=третьему=gI
s=<10\.0\.3\.\bою\b>=тремя=gI
s=<10\.0\.3\.\bу\b>=три=gI
s=<10\.0\.3\.\bх\b>=третьих=gI
s=<10\.0\.3\.\bые\b>=третьи=gI
s=<10\.0\.3\.\bым\b>=третьим=gI
s=<10\.0\.3\.\bю\b>=третью=gI
s=<10\.0\.3\.\bя\b>=третья=gI
s=<10\.0\.3\.\bки\b>=тройки=gI
s=<10\.0\.4\.>=четыре=gI
s=<10\.0\.4\.\bро\b>=четверо=gI
s=<10\.0\.4\.\bых\b>=четверых=gI
s=<10\.0\.4\.\bрым\b>=четверым=gI
s=<10\.0\.4\.\bыми\b>=четверыми=gI
s=<10\.0\.4\.\bах\b>=четверых=gI
s=<10\.0\.4\.\bа\b>=четыре=gI
s=<10\.0\.4\.\bго\b>=четырёх=gI
s=<10\.0\.4\.\bе\b>=четвёртое=gI
s=<10\.0\.4\.\bи\b>=четыре=gI
s=<10\.0\.4\.\bим\b>=четырьмя=gI
s=<10\.0\.4\.\bими\b>=четырьмя=gI
s=<10\.0\.4\.\bих\b>=четырёх=gI
s=<10\.0\.4\.\bй\b>=четвёртой=gI
s=<10\.0\.4\.\bый\b>=четвёртый=gI
s=<10\.0\.4\.\bм\b>=четвёртом=gI
s=<10\.0\.4\.\bми\b>=четвёртыми=gI
s=<10\.0\.4\.\bму\b>=четырём=gI
s=<10\.0\.4\.\bо\b>=четыре=gI
s=<10\.0\.4\.\bого\b>=четвёртого=gI
s=<10\.0\.4\.\bой\b>=четырёх=gI
s=<10\.0\.4\.\bом\b>=четырёх=gI
s=<10\.0\.4\.\bому\b>=четвёртому=gI
s=<10\.0\.4\.\bою\b>=четырьмя=gI
s=<10\.0\.4\.\bу\b>=четыре=gI
s=<10\.0\.4\.\bх\b>=четвёртых=gI
s=<10\.0\.4\.\bые\b>=четвёртые=gI
s=<10\.0\.4\.\bым\b>=четвёртым=gI
s=<10\.0\.4\.\bю\b>=четвёртую=gI
s=<10\.0\.4\.\bя\b>=четвёртая=gI
s=<10\.0\.4\.\bки\b>=четвёрки=gI
s=<10\.0\.5\.>=пять=gI
s=<10\.0\.5\.\bро\b>=пятеро=gI
s=<10\.0\.5\.\bых\b>=пятерых=gI
s=<10\.0\.5\.\bрым\b>=пятерым=gI
s=<10\.0\.5\.\bыми\b>=пятерыми=gI
s=<10\.0\.5\.\bах\b>=пятерых=gI
s=<10\.0\.5\.\bа\b>=пять=gI
s=<10\.0\.5\.\bго\b>=пяти=gI
s=<10\.0\.5\.\bе\b>=пятое=gI
s=<10\.0\.5\.\bи\b>=пять=gI
s=<10\.0\.5\.\bим\b>=пятью=gI
s=<10\.0\.5\.\bими\b>=пятью=gI
s=<10\.0\.5\.\bих\b>=пяти=gI
s=<10\.0\.5\.\bй\b>=пятой=gI
s=<10\.0\.5\.\bый\b>=пятый=gI
s=<10\.0\.5\.\bм\b>=пятом=gI
s=<10\.0\.5\.\bми\b>=пятыми=gI
s=<10\.0\.5\.\bму\b>=пяти=gI
s=<10\.0\.5\.\bо\b>=пять=gI
s=<10\.0\.5\.\bого\b>=пятого=gI
s=<10\.0\.5\.\bой\b>=пяти=gI
s=<10\.0\.5\.\bом\b>=пяти=gI
s=<10\.0\.5\.\bому\b>=пятому=gI
s=<10\.0\.5\.\bою\b>=пятью=gI
s=<10\.0\.5\.\bу\b>=пять=gI
s=<10\.0\.5\.\bх\b>=пятых=gI
s=<10\.0\.5\.\bые\b>=пятые=gI
s=<10\.0\.5\.\bым\b>=пятым=gI
s=<10\.0\.5\.\bю\b>=пятую=gI
s=<10\.0\.5\.\bя\b>=пятая=gI
s=<10\.0\.6\.>=шесть=gI
s=<10\.0\.6\.\bро\b>=шестеро=gI
s=<10\.0\.6\.\bых\b>=шестерых=gI
s=<10\.0\.6\.\bрым\b>=шестерым=gI
s=<10\.0\.6\.\bыми\b>=шестерыми=gI
s=<10\.0\.6\.\bах\b>=шестерых=gI
s=<10\.0\.6\.\bа\b>=шесть=gI
s=<10\.0\.6\.\bго\b>=шести=gI
s=<10\.0\.6\.\bе\b>=шестое=gI
s=<10\.0\.6\.\bи\b>=шесть=gI
s=<10\.0\.6\.\bим\b>=шестью=gI
s=<10\.0\.6\.\bими\b>=шестью=gI
s=<10\.0\.6\.\bих\b>=шести=gI
s=<10\.0\.6\.\bй\b>=шестой=gI
s=<10\.0\.6\.\bый\b>=шестой=gI
s=<10\.0\.6\.\bм\b>=шестом=gI
s=<10\.0\.6\.\bми\b>=шестыми=gI
s=<10\.0\.6\.\bму\b>=шести=gI
s=<10\.0\.6\.\bо\b>=шесть=gI
s=<10\.0\.6\.\bого\b>=шестого=gI
s=<10\.0\.6\.\bой\b>=шести=gI
s=<10\.0\.6\.\bом\b>=шести=gI
s=<10\.0\.6\.\bому\b>=шестому=gI
s=<10\.0\.6\.\bою\b>=шестью=gI
s=<10\.0\.6\.\bу\b>=шесть=gI
s=<10\.0\.6\.\bх\b>=шестых=gI
s=<10\.0\.6\.\bые\b>=шестые=gI
s=<10\.0\.6\.\bым\b>=шестым=gI
s=<10\.0\.6\.\bю\b>=шестую=gI
s=<10\.0\.6\.\bя\b>=шестая=gI
s=<10\.0\.7\.>=семь=gI
s=<10\.0\.7\.\bро\b>=семеро=gI
s=<10\.0\.7\.\bых\b>=семерых=gI
s=<10\.0\.7\.\bрым\b>=семерым=gI
s=<10\.0\.7\.\bыми\b>=семерыми=gI
s=<10\.0\.7\.\bах\b>=семерых=gI
s=<10\.0\.7\.\bа\b>=семь=gI
s=<10\.0\.7\.\bго\b>=семи=gI
s=<10\.0\.7\.\bе\b>=седьмое=gI
s=<10\.0\.7\.\bи\b>=семь=gI
s=<10\.0\.7\.\bим\b>=семью=gI
s=<10\.0\.7\.\bими\b>=семью=gI
s=<10\.0\.7\.\bих\b>=семи=gI
s=<10\.0\.7\.\bй\b>=седьмой=gI
s=<10\.0\.7\.\bый\b>=седьмой=gI
s=<10\.0\.7\.\bм\b>=седьмом=gI
s=<10\.0\.7\.\bми\b>=седьмыми=gI
s=<10\.0\.7\.\bму\b>=семи=gI
s=<10\.0\.7\.\bо\b>=семь=gI
s=<10\.0\.7\.\bого\b>=седьмого=gI
s=<10\.0\.7\.\bой\b>=семи=gI
s=<10\.0\.7\.\bом\b>=семи=gI
s=<10\.0\.7\.\bому\b>=седьмому=gI
s=<10\.0\.7\.\bою\b>=семью=gI
s=<10\.0\.7\.\bу\b>=семь=gI
s=<10\.0\.7\.\bх\b>=седьмых=gI
s=<10\.0\.7\.\bые\b>=седьмые=gI
s=<10\.0\.7\.\bым\b>=седьмым=gI
s=<10\.0\.7\.\bю\b>=седьмую=gI
s=<10\.0\.7\.\bя\b>=седьмая=gI
s=<10\.0\.8\.>=восемь=gI
s=<10\.0\.8\.\bро\b>=восьмеро=gI
s=<10\.0\.8\.\bых\b>=восьмерых=gI
s=<10\.0\.8\.\bрым\b>=восьмерым=gI
s=<10\.0\.8\.\bыми\b>=восьмерыми=gI
s=<10\.0\.8\.\bах\b>=восьмерых=gI
s=<10\.0\.8\.\bа\b>=восемь=gI
s=<10\.0\.8\.\bго\b>=восьми=gI
s=<10\.0\.8\.\bе\b>=восьмое=gI
s=<10\.0\.8\.\bи\b>=восемь=gI
s=<10\.0\.8\.\bим\b>=восемью=gI
s=<10\.0\.8\.\bими\b>=восемью=gI
s=<10\.0\.8\.\bих\b>=восьми=gI
s=<10\.0\.8\.\bй\b>=восьмой=gI
s=<10\.0\.8\.\bый\b>=восьмой=gI
s=<10\.0\.8\.\bм\b>=восьмом=gI
s=<10\.0\.8\.\bми\b>=восьмыми=gI
s=<10\.0\.8\.\bму\b>=восьми=gI
s=<10\.0\.8\.\bо\b>=восемь=gI
s=<10\.0\.8\.\bого\b>=восьмого=gI
s=<10\.0\.8\.\bой\b>=восьми=gI
s=<10\.0\.8\.\bом\b>=восьми=gI
s=<10\.0\.8\.\bому\b>=восьмому=gI
s=<10\.0\.8\.\bою\b>=восемью=gI
s=<10\.0\.8\.\bу\b>=восемь=gI
s=<10\.0\.8\.\bх\b>=восьмых=gI
s=<10\.0\.8\.\bые\b>=восьмые=gI
s=<10\.0\.8\.\bым\b>=восьмым=gI
s=<10\.0\.8\.\bю\b>=восьмую=gI
s=<10\.0\.8\.\bя\b>=восьмая=gI
s=<10\.0\.9\.>=девять=gI
s=<10\.0\.9\.\bро\b>=девятеро=gI
s=<10\.0\.9\.\bых\b>=девятерых=gI
s=<10\.0\.9\.\bрым\b>=девятерым=gI
s=<10\.0\.9\.\bыми\b>=девятерыми=gI
s=<10\.0\.9\.\bах\b>=девятерых=gI
s=<10\.0\.9\.\bа\b>=девять=gI
s=<10\.0\.9\.\bго\b>=девяти=gI
s=<10\.0\.9\.\bе\b>=девятое=gI
s=<10\.0\.9\.\bи\b>=девять=gI
s=<10\.0\.9\.\bим\b>=девятью=gI
s=<10\.0\.9\.\bими\b>=девятью=gI
s=<10\.0\.9\.\bих\b>=девяти=gI
s=<10\.0\.9\.\bй\b>=девятой=gI
s=<10\.0\.9\.\bый\b>=девятый=gI
s=<10\.0\.9\.\bм\b>=девятом=gI
s=<10\.0\.9\.\bми\b>=девятыми=gI
s=<10\.0\.9\.\bму\b>=девяти=gI
s=<10\.0\.9\.\bо\b>=девять=gI
s=<10\.0\.9\.\bого\b>=девятого=gI
s=<10\.0\.9\.\bой\b>=девяти=gI
s=<10\.0\.9\.\bом\b>=девяти=gI
s=<10\.0\.9\.\bому\b>=девятому=gI
s=<10\.0\.9\.\bою\b>=девятью=gI
s=<10\.0\.9\.\bу\b>=девять=gI
s=<10\.0\.9\.\bх\b>=девятых=gI
s=<10\.0\.9\.\bые\b>=девятые=gI
s=<10\.0\.9\.\bым\b>=девятым=gI
s=<10\.0\.9\.\bю\b>=девятую=gI
s=<10\.0\.9\.\bя\b>=девятая=gI
s=<10\.1\.2\.>=двадцать=gI
s=<10\.1\.2\.\bро\b>=двадцатеро=gI
s=<10\.1\.2\.\bых\b>=двадцатерых=gI
s=<10\.1\.2\.\bрым\b>=двадцатерым=gI
s=<10\.1\.2\.\bыми\b>=двадцатерыми=gI
s=<10\.1\.2\.\bах\b>=двадцатерых=gI
s=<10\.1\.2\.\bа\b>=двадцать=gI
s=<10\.1\.2\.\bго\b>=двадцати=gI
s=<10\.1\.2\.\bе\b>=двадцатое=gI
s=<10\.1\.2\.\bи\b>=двадцать=gI
s=<10\.1\.2\.\bим\b>=двадцатью=gI
s=<10\.1\.2\.\bими\b>=двадцатью=gI
s=<10\.1\.2\.\bих\b>=двадцати=gI
s=<10\.1\.2\.\bй\b>=двадцатой=gI
s=<10\.1\.2\.\bый\b>=двадцатый=gI
s=<10\.1\.2\.\bм\b>=двадцатом=gI
s=<10\.1\.2\.\bми\b>=двадцатыми=gI
s=<10\.1\.2\.\bму\b>=двадцати=gI
s=<10\.1\.2\.\bо\b>=двадцать=gI
s=<10\.1\.2\.\bого\b>=двадцатого=gI
s=<10\.1\.2\.\bой\b>=двадцати=gI
s=<10\.1\.2\.\bом\b>=двадцати=gI
s=<10\.1\.2\.\bому\b>=двадцатому=gI
s=<10\.1\.2\.\bою\b>=двадцатью=gI
s=<10\.1\.2\.\bу\b>=двадцать=gI
s=<10\.1\.2\.\bх\b>=двадцатых=gI
s=<10\.1\.2\.\bые\b>=двадцатые=gI
s=<10\.1\.2\.\bым\b>=двадцатым=gI
s=<10\.1\.2\.\bю\b>=двадцатую=gI
s=<10\.1\.2\.\bя\b>=двадцатая=gI
s=<10\.1\.3\.>=тридцать=gI
s=<10\.1\.3\.\bро\b>=тридцатеро=gI
s=<10\.1\.3\.\bых\b>=тридцатерых=gI
s=<10\.1\.3\.\bрым\b>=тридцатерым=gI
s=<10\.1\.3\.\bыми\b>=тридцатерыми=gI
s=<10\.1\.3\.\bах\b>=тридцатерых=gI
s=<10\.1\.3\.\bа\b>=тридцать=gI
s=<10\.1\.3\.\bго\b>=тридцати=gI
s=<10\.1\.3\.\bе\b>=тридцатое=gI
s=<10\.1\.3\.\bи\b>=тридцать=gI
s=<10\.1\.3\.\bим\b>=тридцатью=gI
s=<10\.1\.3\.\bими\b>=тридцатью=gI
s=<10\.1\.3\.\bих\b>=тридцати=gI
s=<10\.1\.3\.\bй\b>=тридцатой=gI
s=<10\.1\.3\.\bый\b>=тридцатый=gI
s=<10\.1\.3\.\bм\b>=тридцатом=gI
s=<10\.1\.3\.\bми\b>=тридцатыми=gI
s=<10\.1\.3\.\bму\b>=тридцати=gI
s=<10\.1\.3\.\bо\b>=тридцать=gI
s=<10\.1\.3\.\bого\b>=тридцатого=gI
s=<10\.1\.3\.\bой\b>=тридцати=gI
s=<10\.1\.3\.\bом\b>=тридцати=gI
s=<10\.1\.3\.\bому\b>=тридцатому=gI
s=<10\.1\.3\.\bою\b>=тридцатью=gI
s=<10\.1\.3\.\bу\b>=тридцать=gI
s=<10\.1\.3\.\bх\b>=тридцатых=gI
s=<10\.1\.3\.\bые\b>=тридцатые=gI
s=<10\.1\.3\.\bым\b>=тридцатым=gI
s=<10\.1\.3\.\bю\b>=тридцатую=gI
s=<10\.1\.3\.\bя\b>=тридцатая=gI
s=<10\.1\.3\.\bки\b>=тридцать=gI
s=<10\.1\.4\.>=сорок=gI
s=<10\.1\.4\.\bро\b>=сорок=gI
s=<10\.1\.4\.\bых\b>=сорока=gI
s=<10\.1\.4\.\bрым\b>=сорока=gI
s=<10\.1\.4\.\bыми\b>=сорока=gI
s=<10\.1\.4\.\bах\b>=сорока=gI
s=<10\.1\.4\.\bа\b>=сорок=gI
s=<10\.1\.4\.\bго\b>=сорока=gI
s=<10\.1\.4\.\bе\b>=сороковое=gI
s=<10\.1\.4\.\bи\b>=сорок=gI
s=<10\.1\.4\.\bим\b>=сорока=gI
s=<10\.1\.4\.\bими\b>=сорока=gI
s=<10\.1\.4\.\bих\b>=сорока=gI
s=<10\.1\.4\.\bй\b>=сороковой=gI
s=<10\.1\.4\.\bый\b>=сороковой=gI
s=<10\.1\.4\.\bм\b>=сороковом=gI
s=<10\.1\.4\.\bми\b>=сороковыми=gI
s=<10\.1\.4\.\bму\b>=сорока=gI
s=<10\.1\.4\.\bо\b>=сорок=gI
s=<10\.1\.4\.\bого\b>=сорокового=gI
s=<10\.1\.4\.\bой\b>=сорока=gI
s=<10\.1\.4\.\bом\b>=сорока=gI
s=<10\.1\.4\.\bому\b>=сороковому=gI
s=<10\.1\.4\.\bою\b>=сорока=gI
s=<10\.1\.4\.\bу\b>=сорок=gI
s=<10\.1\.4\.\bх\b>=сороковых=gI
s=<10\.1\.4\.\bые\b>=сороковые=gI
s=<10\.1\.4\.\bым\b>=сороковым=gI
s=<10\.1\.4\.\bю\b>=сороковую=gI
s=<10\.1\.4\.\bя\b>=сороковая=gI
s=<10\.1\.4\.\bки\b>=сорок=gI
s=<10\.1\.5\.>=пятьдесят=gI
s=<10\.1\.5\.\bро\b>=пятьдесят=gI
s=<10\.1\.5\.\bых\b>=пятидесяти=gI
s=<10\.1\.5\.\bрым\b>=пятидесяти=gI
s=<10\.1\.5\.\bыми\b>=пятьюдесятью=gI
s=<10\.1\.5\.\bах\b>=пятидесяти=gI
s=<10\.1\.5\.\bа\b>=пятьдесят=gI
s=<10\.1\.5\.\bго\b>=пятидесяти=gI
s=<10\.1\.5\.\bе\b>=пятидесятое=gI
s=<10\.1\.5\.\bи\b>=пятьдесят=gI
s=<10\.1\.5\.\bим\b>=пятьюдесятью=gI
s=<10\.1\.5\.\bими\b>=пятьюдесятью=gI
s=<10\.1\.5\.\bих\b>=пятидесяти=gI
s=<10\.1\.5\.\bй\b>=пятидесятой=gI
s=<10\.1\.5\.\bый\b>=пятидесятый=gI
s=<10\.1\.5\.\bм\b>=пятидесятом=gI
s=<10\.1\.5\.\bми\b>=пятидесятыми=gI
s=<10\.1\.5\.\bму\b>=пятидесяти=gI
s=<10\.1\.5\.\bо\b>=пятьдесят=gI
s=<10\.1\.5\.\bого\b>=пятидесятого=gI
s=<10\.1\.5\.\bой\b>=пятидесяти=gI
s=<10\.1\.5\.\bом\b>=пятидесяти=gI
s=<10\.1\.5\.\bому\b>=пятидесятому=gI
s=<10\.1\.5\.\bою\b>=пятьюдесятью=gI
s=<10\.1\.5\.\bу\b>=пятьдесят=gI
s=<10\.1\.5\.\bх\b>=пятидесятых=gI
s=<10\.1\.5\.\bые\b>=пятидесятые=gI
s=<10\.1\.5\.\bым\b>=пятидесятым=gI
s=<10\.1\.5\.\bю\b>=пятидесятую=gI
s=<10\.1\.5\.\bя\b>=пятидесятая=gI
s=<10\.1\.6\.>=шестьдесят=gI
s=<10\.1\.6\.\bро\b>=шестьдесят=gI
s=<10\.1\.6\.\bых\b>=шестидесяти=gI
s=<10\.1\.6\.\bрым\b>=шестидесяти=gI
s=<10\.1\.6\.\bыми\b>=шестьюдесятью=gI
s=<10\.1\.6\.\bах\b>=шестидесяти=gI
s=<10\.1\.6\.\bа\b>=шестьдесят=gI
s=<10\.1\.6\.\bго\b>=шестидесяти=gI
s=<10\.1\.6\.\bе\b>=шестидесятое=gI
s=<10\.1\.6\.\bи\b>=шестьдесят=gI
s=<10\.1\.6\.\bим\b>=шестьюдесятью=gI
s=<10\.1\.6\.\bими\b>=шестьюдесятью=gI
s=<10\.1\.6\.\bих\b>=шестидесяти=gI
s=<10\.1\.6\.\bй\b>=шестидесятой=gI
s=<10\.1\.6\.\bый\b>=шестидесятый=gI
s=<10\.1\.6\.\bм\b>=шестидесятом=gI
s=<10\.1\.6\.\bми\b>=шестидесятыми=gI
s=<10\.1\.6\.\bму\b>=шестидесяти=gI
s=<10\.1\.6\.\bо\b>=шестьдесят=gI
s=<10\.1\.6\.\bого\b>=шестидесятого=gI
s=<10\.1\.6\.\bой\b>=шестидесяти=gI
s=<10\.1\.6\.\bом\b>=шестидесяти=gI
s=<10\.1\.6\.\bому\b>=шестидесятому=gI
s=<10\.1\.6\.\bою\b>=шестьюдесятью=gI
s=<10\.1\.6\.\bу\b>=шестьдесят=gI
s=<10\.1\.6\.\bх\b>=шестидесятых=gI
s=<10\.1\.6\.\bые\b>=шестидесятые=gI
s=<10\.1\.6\.\bым\b>=шестидесятым=gI
s=<10\.1\.6\.\bю\b>=шестидесятую=gI
s=<10\.1\.6\.\bя\b>=шестидесятая=gI
s=<10\.1\.7\.>=семьдесят=gI
s=<10\.1\.7\.\bро\b>=семьдесят=gI
s=<10\.1\.7\.\bых\b>=семидесяти=gI
s=<10\.1\.7\.\bрым\b>=семидесяти=gI
s=<10\.1\.7\.\bыми\b>=семьюдесятью=gI
s=<10\.1\.7\.\bах\b>=семидесяти=gI
s=<10\.1\.7\.\bа\b>=семьдесят=gI
s=<10\.1\.7\.\bго\b>=семидесяти=gI
s=<10\.1\.7\.\bе\b>=семидесятое=gI
s=<10\.1\.7\.\bи\b>=семьдесят=gI
s=<10\.1\.7\.\bим\b>=семьюдесятью=gI
s=<10\.1\.7\.\bими\b>=семьюдесятью=gI
s=<10\.1\.7\.\bих\b>=семидесяти=gI
s=<10\.1\.7\.\bй\b>=семидесятой=gI
s=<10\.1\.7\.\bый\b>=семидесятый=gI
s=<10\.1\.7\.\bм\b>=семидесятом=gI
s=<10\.1\.7\.\bми\b>=семидесятыми=gI
s=<10\.1\.7\.\bму\b>=семидесяти=gI
s=<10\.1\.7\.\bо\b>=семьдесят=gI
s=<10\.1\.7\.\bого\b>=семидесятого=gI
s=<10\.1\.7\.\bой\b>=семидесяти=gI
s=<10\.1\.7\.\bом\b>=семидесяти=gI
s=<10\.1\.7\.\bому\b>=семидесятому=gI
s=<10\.1\.7\.\bою\b>=семьюдесятью=gI
s=<10\.1\.7\.\bу\b>=семьдесят=gI
s=<10\.1\.7\.\bх\b>=семидесятых=gI
s=<10\.1\.7\.\bые\b>=семидесятые=gI
s=<10\.1\.7\.\bым\b>=семидесятым=gI
s=<10\.1\.7\.\bю\b>=семидесятую=gI
s=<10\.1\.7\.\bя\b>=семидесятая=gI
s=<10\.1\.8\.>=восемьдесят=gI
s=<10\.1\.8\.\bро\b>=восемьдесят=gI
s=<10\.1\.8\.\bых\b>=восьмидесяти=gI
s=<10\.1\.8\.\bрым\b>=восьмидесяти=gI
s=<10\.1\.8\.\bыми\b>=восьмьюдесятью=gI
s=<10\.1\.8\.\bах\b>=восьмидесяти=gI
s=<10\.1\.8\.\bа\b>=восемьдесят=gI
s=<10\.1\.8\.\bго\b>=восьмидесяти=gI
s=<10\.1\.8\.\bе\b>=восьмидесятое=gI
s=<10\.1\.8\.\bи\b>=восемьдесят=gI
s=<10\.1\.8\.\bим\b>=восьмьюдесятью=gI
s=<10\.1\.8\.\bими\b>=восьмьюдесятью=gI
s=<10\.1\.8\.\bих\b>=восьмидесяти=gI
s=<10\.1\.8\.\bй\b>=восьмидесятой=gI
s=<10\.1\.8\.\bый\b>=восьмидесятый=gI
s=<10\.1\.8\.\bм\b>=восьмидесятом=gI
s=<10\.1\.8\.\bми\b>=восьмидесятыми=gI
s=<10\.1\.8\.\bму\b>=восьмидесяти=gI
s=<10\.1\.8\.\bо\b>=восемьдесят=gI
s=<10\.1\.8\.\bого\b>=восьмидесятого=gI
s=<10\.1\.8\.\bой\b>=восьмидесяти=gI
s=<10\.1\.8\.\bом\b>=восьмидесяти=gI
s=<10\.1\.8\.\bому\b>=восьмидесятому=gI
s=<10\.1\.8\.\bою\b>=восьмьюдесятью=gI
s=<10\.1\.8\.\bу\b>=восемьдесят=gI
s=<10\.1\.8\.\bх\b>=восьмидесятых=gI
s=<10\.1\.8\.\bые\b>=восьмидесятые=gI
s=<10\.1\.8\.\bым\b>=восьмидесятым=gI
s=<10\.1\.8\.\bю\b>=восьмидесятую=gI
s=<10\.1\.8\.\bя\b>=восьмидесятая=gI
s=<10\.1\.9\.>=девяносто=gI
s=<10\.1\.9\.\bро\b>=девяносто=gI
s=<10\.1\.9\.\bых\b>=девяноста=gI
s=<10\.1\.9\.\bрым\b>=девяноста=gI
s=<10\.1\.9\.\bыми\b>=девяноста=gI
s=<10\.1\.9\.\bах\b>=девяноста=gI
s=<10\.1\.9\.\bа\b>=девяносто=gI
s=<10\.1\.9\.\bго\b>=девяноста=gI
s=<10\.1\.9\.\bе\b>=девяностое=gI
s=<10\.1\.9\.\bи\b>=девяносто=gI
s=<10\.1\.9\.\bим\b>=девяноста=gI
s=<10\.1\.9\.\bими\b>=девяноста=gI
s=<10\.1\.9\.\bих\b>=девяноста=gI
s=<10\.1\.9\.\bй\b>=девяностой=gI
s=<10\.1\.9\.\bый\b>=девяностый=gI
s=<10\.1\.9\.\bм\b>=девяностом=gI
s=<10\.1\.9\.\bми\b>=девяностыми=gI
s=<10\.1\.9\.\bму\b>=девяноста=gI
s=<10\.1\.9\.\bо\b>=девяносто=gI
s=<10\.1\.9\.\bого\b>=девяностого=gI
s=<10\.1\.9\.\bой\b>=девяноста=gI
s=<10\.1\.9\.\bом\b>=девяноста=gI
s=<10\.1\.9\.\bому\b>=девяностому=gI
s=<10\.1\.9\.\bою\b>=девяноста=gI
s=<10\.1\.9\.\bу\b>=девяносто=gI
s=<10\.1\.9\.\bх\b>=девяностых=gI
s=<10\.1\.9\.\bые\b>=девяностые=gI
s=<10\.1\.9\.\bым\b>=девяностым=gI
s=<10\.1\.9\.\bю\b>=девяностую=gI
s=<10\.1\.9\.\bя\b>=девяностая=gI
s=<10\.2\.1\.>=сто=gI
s=<10\.2\.1\.\bро\b>=сто=gI
s=<10\.2\.1\.\bых\b>=ста=gI
s=<10\.2\.1\.\bрым\b>=ста=gI
s=<10\.2\.1\.\bыми\b>=ста=gI
s=<10\.2\.1\.\bах\b>=ста=gI
s=<10\.2\.1\.\bа\b>=сто=gI
s=<10\.2\.1\.\bго\b>=сотого=gI
s=<10\.2\.1\.\bе\b>=сотое=gI
s=<10\.2\.1\.\bи\b>=сто=gI
s=<10\.2\.1\.\bим\b>=стам=gI
s=<10\.2\.1\.\bими\b>=стами=gI
s=<10\.2\.1\.\bих\b>=ста=gI
s=<10\.2\.1\.\bй\b>=сотой=gI
s=<10\.2\.1\.\bый\b>=сотый=gI
s=<10\.2\.1\.\bм\b>=сотом=gI
s=<10\.2\.1\.\bми\b>=сотыми=gI
s=<10\.2\.1\.\bму\b>=сотому=gI
s=<10\.2\.1\.\bо\b>=сто=gI
s=<10\.2\.1\.\bого\b>=сотого=gI
s=<10\.2\.1\.\bой\b>=ста=gI
s=<10\.2\.1\.\bом\b>=ста=gI
s=<10\.2\.1\.\bому\b>=сотому=gI
s=<10\.2\.1\.\bою\b>=сотою=gI
s=<10\.2\.1\.\bу\b>=сто=gI
s=<10\.2\.1\.\bх\b>=сотых=gI
s=<10\.2\.1\.\bые\b>=сотые=gI
s=<10\.2\.1\.\bым\b>=сотым=gI
s=<10\.2\.1\.\bю\b>=сотую=gI
s=<10\.2\.1\.\bя\b>=сотая=gI
s=<10\.2\.2\.>=двести=gI
s=<10\.2\.2\.\bро\b>=двести=gI
s=<10\.2\.2\.\bых\b>=двухсот=gI
s=<10\.2\.2\.\bрым\b>=двумстам=gI
s=<10\.2\.2\.\bыми\b>=двумястами=gI
s=<10\.2\.2\.\bах\b>=двухстах=gI
s=<10\.2\.2\.\bа\b>=двести=gI
s=<10\.2\.2\.\bго\b>=двухсот=gI
s=<10\.2\.2\.\bе\b>=двухсотое=gI
s=<10\.2\.2\.\bи\b>=двести=gI
s=<10\.2\.2\.\bим\b>=двумястами=gI
s=<10\.2\.2\.\bими\b>=двумястами=gI
s=<10\.2\.2\.\bих\b>=двухсот=gI
s=<10\.2\.2\.\bй\b>=двухсотой=gI
s=<10\.2\.2\.\bый\b>=двухсотый=gI
s=<10\.2\.2\.\bм\b>=двухсотом=gI
s=<10\.2\.2\.\bми\b>=двухсотыми=gI
s=<10\.2\.2\.\bму\b>=двумстам=gI
s=<10\.2\.2\.\bо\b>=двести=gI
s=<10\.2\.2\.\bого\b>=двухсотого=gI
s=<10\.2\.2\.\bой\b>=двухсот=gI
s=<10\.2\.2\.\bом\b>=двухстах=gI
s=<10\.2\.2\.\bому\b>=двухсотому=gI
s=<10\.2\.2\.\bою\b>=двумястами=gI
s=<10\.2\.2\.\bу\b>=двести=gI
s=<10\.2\.2\.\bх\b>=двухсотых=gI
s=<10\.2\.2\.\bые\b>=двухсотые=gI
s=<10\.2\.2\.\bым\b>=двухсотым=gI
s=<10\.2\.2\.\bю\b>=двухсотую=gI
s=<10\.2\.2\.\bя\b>=двухсотая=gI
s=<10\.2\.3\.>=триста=gI
s=<10\.2\.3\.\bро\b>=триста=gI
s=<10\.2\.3\.\bых\b>=трехсот=gI
s=<10\.2\.3\.\bрым\b>=трёмстам=gI
s=<10\.2\.3\.\bыми\b>=тремястами=gI
s=<10\.2\.3\.\bах\b>=трёхстах=gI
s=<10\.2\.3\.\bа\b>=трехсот=gI
s=<10\.2\.3\.\bго\b>=трехсот=gI
s=<10\.2\.3\.\bе\b>=трёхсотое=gI
s=<10\.2\.3\.\bи\b>=триста=gI
s=<10\.2\.3\.\bим\b>=тремястами=gI
s=<10\.2\.3\.\bими\b>=трёмстам=gI
s=<10\.2\.3\.\bих\b>=трехсот=gI
s=<10\.2\.3\.\bй\b>=трёхсотой=gI
s=<10\.2\.3\.\bый\b>=трёхсотый=gI
s=<10\.2\.3\.\bм\b>=трёхсотом=gI
s=<10\.2\.3\.\bми\b>=трёхсотыми=gI
s=<10\.2\.3\.\bму\b>=трёмстам=gI
s=<10\.2\.3\.\bо\b>=трехсот=gI
s=<10\.2\.3\.\bого\b>=трёхсотого=gI
s=<10\.2\.3\.\bой\b>=трёмстам=gI
s=<10\.2\.3\.\bом\b>=трёхстах=gI
s=<10\.2\.3\.\bому\b>=трёхсотому=gI
s=<10\.2\.3\.\bою\b>=тремястами=gI
s=<10\.2\.3\.\bу\b>=триста=gI
s=<10\.2\.3\.\bх\b>=трёхсотых=gI
s=<10\.2\.3\.\bые\b>=трёхсотые=gI
s=<10\.2\.3\.\bым\b>=трёхсотым=gI
s=<10\.2\.3\.\bю\b>=трёхсотую=gI
s=<10\.2\.3\.\bя\b>=трёхсотая=gI
s=<10\.2\.4\.>=четыреста=gI
s=<10\.2\.4\.\bро\b>=четыреста=gI
s=<10\.2\.4\.\bых\b>=четырёхсот=gI
s=<10\.2\.4\.\bрым\b>=четырёмстам=gI
s=<10\.2\.4\.\bыми\b>=четырьмястами=gI
s=<10\.2\.4\.\bах\b>=четырёхстах=gI
s=<10\.2\.4\.\bа\b>=четырёхсот=gI
s=<10\.2\.4\.\bго\b>=четырёхсот=gI
s=<10\.2\.4\.\bе\b>=четырёхсотое=gI
s=<10\.2\.4\.\bи\b>=четыреста=gI
s=<10\.2\.4\.\bим\b>=четырьмястами=gI
s=<10\.2\.4\.\bими\b>=четырёмстам=gI
s=<10\.2\.4\.\bих\b>=четырёхсот=gI
s=<10\.2\.4\.\bй\b>=четырёхсотой=gI
s=<10\.2\.4\.\bый\b>=четырёхсотый=gI
s=<10\.2\.4\.\bм\b>=четырёхсотом=gI
s=<10\.2\.4\.\bми\b>=четырёхсотыми=gI
s=<10\.2\.4\.\bму\b>=четырёмстам=gI
s=<10\.2\.4\.\bо\b>=четырёхсот=gI
s=<10\.2\.4\.\bого\b>=четырёхсотого=gI
s=<10\.2\.4\.\bой\b>=четырёмстам=gI
s=<10\.2\.4\.\bом\b>=четырёхстах=gI
s=<10\.2\.4\.\bому\b>=четырёхсотому=gI
s=<10\.2\.4\.\bою\b>=четырьмястами=gI
s=<10\.2\.4\.\bу\b>=четыреста=gI
s=<10\.2\.4\.\bх\b>=четырёхсотых=gI
s=<10\.2\.4\.\bые\b>=четырёхсотые=gI
s=<10\.2\.4\.\bым\b>=четырёхсотым=gI
s=<10\.2\.4\.\bю\b>=четырёхсотую=gI
s=<10\.2\.4\.\bя\b>=четырёхсотая=gI
s=<10\.2\.5\.>=пятьсот=gI
s=<10\.2\.5\.\bро\b>=пятьсот=gI
s=<10\.2\.5\.\bых\b>=пятисот=gI
s=<10\.2\.5\.\bрым\b>=пятистам=gI
s=<10\.2\.5\.\bыми\b>=пятьюстами=gI
s=<10\.2\.5\.\bах\b>=пятистах=gI
s=<10\.2\.5\.\bа\b>=пятисот=gI
s=<10\.2\.5\.\bго\b>=пятисот=gI
s=<10\.2\.5\.\bе\b>=пятисотое=gI
s=<10\.2\.5\.\bи\b>=пятьсот=gI
s=<10\.2\.5\.\bим\b>=пятьюстами=gI
s=<10\.2\.5\.\bими\b>=пятистам=gI
s=<10\.2\.5\.\bих\b>=пятисот=gI
s=<10\.2\.5\.\bй\b>=пятисотой=gI
s=<10\.2\.5\.\bый\b>=пятисотый=gI
s=<10\.2\.5\.\bм\b>=пятисотом=gI
s=<10\.2\.5\.\bми\b>=пятисотыми=gI
s=<10\.2\.5\.\bму\b>=пятистам=gI
s=<10\.2\.5\.\bо\b>=пятисот=gI
s=<10\.2\.5\.\bого\b>=пятисотого=gI
s=<10\.2\.5\.\bой\b>=пятистам=gI
s=<10\.2\.5\.\bом\b>=пятистах=gI
s=<10\.2\.5\.\bому\b>=пятисотому=gI
s=<10\.2\.5\.\bою\b>=пятьюстами=gI
s=<10\.2\.5\.\bу\b>=пятьсот=gI
s=<10\.2\.5\.\bх\b>=пятисотых=gI
s=<10\.2\.5\.\bые\b>=пятисотые=gI
s=<10\.2\.5\.\bым\b>=пятисотым=gI
s=<10\.2\.5\.\bю\b>=пятисотую=gI
s=<10\.2\.5\.\bя\b>=пятисотая=gI
s=<10\.2\.6\.>=шестьсот=gI
s=<10\.2\.6\.\bро\b>=шестьсот=gI
s=<10\.2\.6\.\bых\b>=шестисот=gI
s=<10\.2\.6\.\bрым\b>=шестистам=gI
s=<10\.2\.6\.\bыми\b>=шестьюстами=gI
s=<10\.2\.6\.\bах\b>=шестистах=gI
s=<10\.2\.6\.\bа\b>=шестисот=gI
s=<10\.2\.6\.\bго\b>=шестисот=gI
s=<10\.2\.6\.\bе\b>=шестисотое=gI
s=<10\.2\.6\.\bи\b>=шестьсот=gI
s=<10\.2\.6\.\bим\b>=шестьюстами=gI
s=<10\.2\.6\.\bими\b>=шестистам=gI
s=<10\.2\.6\.\bих\b>=шестисот=gI
s=<10\.2\.6\.\bй\b>=шестисотой=gI
s=<10\.2\.6\.\bый\b>=шестисотый=gI
s=<10\.2\.6\.\bм\b>=шестисотом=gI
s=<10\.2\.6\.\bми\b>=шестисотыми=gI
s=<10\.2\.6\.\bму\b>=шестистам=gI
s=<10\.2\.6\.\bо\b>=шестисот=gI
s=<10\.2\.6\.\bого\b>=шестисотого=gI
s=<10\.2\.6\.\bой\b>=шестистам=gI
s=<10\.2\.6\.\bом\b>=шестистах=gI
s=<10\.2\.6\.\bому\b>=шестисотому=gI
s=<10\.2\.6\.\bою\b>=шестьюстами=gI
s=<10\.2\.6\.\bу\b>=шестьсот=gI
s=<10\.2\.6\.\bх\b>=шестисотых=gI
s=<10\.2\.6\.\bые\b>=шестисотые=gI
s=<10\.2\.6\.\bым\b>=шестисотым=gI
s=<10\.2\.6\.\bю\b>=шестисотую=gI
s=<10\.2\.6\.\bя\b>=шестисотая=gI
s=<10\.2\.7\.>=семьсот=gI
s=<10\.2\.7\.\bро\b>=семьсот=gI
s=<10\.2\.7\.\bых\b>=семисот=gI
s=<10\.2\.7\.\bрым\b>=семистам=gI
s=<10\.2\.7\.\bыми\b>=семьюстами=gI
s=<10\.2\.7\.\bах\b>=семистах=gI
s=<10\.2\.7\.\bа\b>=семисот=gI
s=<10\.2\.7\.\bго\b>=семисот=gI
s=<10\.2\.7\.\bе\b>=семисотое=gI
s=<10\.2\.7\.\bи\b>=семьсот=gI
s=<10\.2\.7\.\bим\b>=семьюстами=gI
s=<10\.2\.7\.\bими\b>=семистам=gI
s=<10\.2\.7\.\bих\b>=семисот=gI
s=<10\.2\.7\.\bй\b>=семисотой=gI
s=<10\.2\.7\.\bый\b>=семисотый=gI
s=<10\.2\.7\.\bм\b>=семисотом=gI
s=<10\.2\.7\.\bми\b>=семисотыми=gI
s=<10\.2\.7\.\bму\b>=семистам=gI
s=<10\.2\.7\.\bо\b>=семисот=gI
s=<10\.2\.7\.\bого\b>=семисотого=gI
s=<10\.2\.7\.\bой\b>=семистам=gI
s=<10\.2\.7\.\bом\b>=семистах=gI
s=<10\.2\.7\.\bому\b>=семисотому=gI
s=<10\.2\.7\.\bою\b>=семьюстами=gI
s=<10\.2\.7\.\bу\b>=семьсот=gI
s=<10\.2\.7\.\bх\b>=семисотых=gI
s=<10\.2\.7\.\bые\b>=семисотые=gI
s=<10\.2\.7\.\bым\b>=семисотым=gI
s=<10\.2\.7\.\bю\b>=семисотую=gI
s=<10\.2\.7\.\bя\b>=семисотая=gI
s=<10\.2\.8\.>=восемьсот=gI
s=<10\.2\.8\.\bро\b>=восемьсот=gI
s=<10\.2\.8\.\bых\b>=восьмисот=gI
s=<10\.2\.8\.\bрым\b>=восьмистам=gI
s=<10\.2\.8\.\bыми\b>=восьмьюстами=gI
s=<10\.2\.8\.\bах\b>=восьмистах=gI
s=<10\.2\.8\.\bа\b>=восьмисот=gI
s=<10\.2\.8\.\bго\b>=восьмисот=gI
s=<10\.2\.8\.\bе\b>=восьмисотое=gI
s=<10\.2\.8\.\bи\b>=восемьсот=gI
s=<10\.2\.8\.\bим\b>=восьмьюстами=gI
s=<10\.2\.8\.\bими\b>=восьмистам=gI
s=<10\.2\.8\.\bих\b>=восьмисот=gI
s=<10\.2\.8\.\bй\b>=восьмисотой=gI
s=<10\.2\.8\.\bый\b>=восьмисотый=gI
s=<10\.2\.8\.\bм\b>=восьмисотом=gI
s=<10\.2\.8\.\bми\b>=восьмисотыми=gI
s=<10\.2\.8\.\bму\b>=восьмистам=gI
s=<10\.2\.8\.\bо\b>=восьмисот=gI
s=<10\.2\.8\.\bого\b>=восьмисотого=gI
s=<10\.2\.8\.\bой\b>=восьмистам=gI
s=<10\.2\.8\.\bом\b>=восьмистах=gI
s=<10\.2\.8\.\bому\b>=восьмисотому=gI
s=<10\.2\.8\.\bою\b>=восьмьюстами=gI
s=<10\.2\.8\.\bу\b>=восемьсот=gI
s=<10\.2\.8\.\bх\b>=восьмисотых=gI
s=<10\.2\.8\.\bые\b>=восьмисотые=gI
s=<10\.2\.8\.\bым\b>=восьмисотым=gI
s=<10\.2\.8\.\bю\b>=восьмисотую=gI
s=<10\.2\.8\.\bя\b>=восьмисотая=gI
s=<10\.2\.9\.>=девятьсот=gI
s=<10\.2\.9\.\bро\b>=девятьсот=gI
s=<10\.2\.9\.\bых\b>=девятисот=gI
s=<10\.2\.9\.\bрым\b>=девятистам=gI
s=<10\.2\.9\.\bыми\b>=девятьюстами=gI
s=<10\.2\.9\.\bах\b>=девятистах=gI
s=<10\.2\.9\.\bа\b>=девятисот=gI
s=<10\.2\.9\.\bго\b>=девятисот=gI
s=<10\.2\.9\.\bе\b>=девятисотое=gI
s=<10\.2\.9\.\bи\b>=девятьсот=gI
s=<10\.2\.9\.\bим\b>=девятьюстами=gI
s=<10\.2\.9\.\bими\b>=девятистам=gI
s=<10\.2\.9\.\bих\b>=девятисот=gI
s=<10\.2\.9\.\bй\b>=девятисотой=gI
s=<10\.2\.9\.\bый\b>=девятисотый=gI
s=<10\.2\.9\.\bм\b>=девятисотом=gI
s=<10\.2\.9\.\bми\b>=девятисотыми=gI
s=<10\.2\.9\.\bму\b>=девятистам=gI
s=<10\.2\.9\.\bо\b>=девятисот=gI
s=<10\.2\.9\.\bого\b>=девятисотого=gI
s=<10\.2\.9\.\bой\b>=девятистам=gI
s=<10\.2\.9\.\bом\b>=девятистах=gI
s=<10\.2\.9\.\bому\b>=девятисотому=gI
s=<10\.2\.9\.\bою\b>=девятьюстами=gI
s=<10\.2\.9\.\bу\b>=девятьсот=gI
s=<10\.2\.9\.\bх\b>=девятисотых=gI
s=<10\.2\.9\.\bые\b>=девятисотые=gI
s=<10\.2\.9\.\bым\b>=девятисотым=gI
s=<10\.2\.9\.\bю\b>=девятисотую=gI
s=<10\.2\.9\.\bя\b>=девятисотая=gI
s=<10\.3\.1\.>=тысяч=gI
s=<10\.3\.1\.\bро\b>=тысяча=gI
s=<10\.3\.1\.\bых\b>=тысячи=gI
s=<10\.3\.1\.\bрым\b>=тысячи=gI
s=<10\.3\.1\.\bыми\b>=тысячами=gI
s=<10\.3\.1\.\bах\b>=тысячах=gI
s=<10\.3\.1\.\bа\b>=тысяча=gI
s=<10\.3\.1\.\bго\b>=тысяч=gI
s=<10\.3\.1\.\bе\b>=тысячное=gI
s=<10\.3\.1\.\bи\b>=тысячах=gI
s=<10\.3\.1\.\bим\b>=тысячу=gI
s=<10\.3\.1\.\bими\b>=тысячами=gI
s=<10\.3\.1\.\bих\b>=тысячах=gI
s=<10\.3\.1\.\bй\b>=тысячной=gI
s=<10\.3\.1\.\bый\b>=тысячный=gI
s=<10\.3\.1\.\bм\b>=тысячном=gI
s=<10\.3\.1\.\bми\b>=тысячными=gI
s=<10\.3\.1\.\bму\b>=тысячам=gI
s=<10\.3\.1\.\bо\b>=тысяч=gI
s=<10\.3\.1\.\bого\b>=тысячного=gI
s=<10\.3\.1\.\bой\b>=тысячи=gI
s=<10\.3\.1\.\bом\b>=тысячей=gI
s=<10\.3\.1\.\bому\b>=тысячному=gI
s=<10\.3\.1\.\bою\b>=тысячей=gI
s=<10\.3\.1\.\bу\b>=тысячу=gI
s=<10\.3\.1\.\bх\b>=тысячных=gI
s=<10\.3\.1\.\bые\b>=тысячные=gI
s=<10\.3\.1\.\bым\b>=тысячным=gI
s=<10\.3\.1\.\bю\b>=тысячную=gI
s=<10\.3\.1\.\bя\b>=тысячная=gI
s=<10\.3\.1\.\bах\b>=тысячах=gI
# =
s=<10\.0\.0\.>=ноль=gI
s=<10\.0\.0\.\bро\b>=ноль=gI
s=<10\.0\.0\.\bых\b>=ноля=gI
s=<10\.0\.0\.\bрым\b>=нолю=gI
s=<10\.0\.0\.\bро\b>=ноль=gI
s=<10\.0\.0\.\bых\b>=ноль=gI
s=<10\.0\.0\.\bыми\b>=нолём=gI
s=<10\.0\.0\.\bах\b>=ноле=gI
s=<10\.0\.0\.\bа\b>=ноль=gI
s=<10\.0\.0\.\bго\b>=ноля=gI
s=<10\.0\.0\.\bе\b>=нулевое=gI
s=<10\.0\.0\.\bи\b>=ноль=gI
s=<10\.0\.0\.\bим\b>=нолём=gI
s=<10\.0\.0\.\bими\b>=нолями=gI
s=<10\.0\.0\.\bих\b>=нолях=gI
s=<10\.0\.0\.\bый\b>=нулевой=gI
s=<10\.0\.0\.\bй\b>=нулевой=gI
s=<10\.0\.0\.\bм\b>=нулевом=gI
s=<10\.0\.0\.\bми\b>=нулевыми=gI
s=<10\.0\.0\.\bму\b>=нолю=gI
s=<10\.0\.0\.\bо\b>=ноль=gI
s=<10\.0\.0\.\bого\b>=нулевого=gI
s=<10\.0\.0\.\bой\b>=ноля=gI
s=<10\.0\.0\.\bом\b>=ноле=gI
s=<10\.0\.0\.\bому\b>=нулевому=gI
s=<10\.0\.0\.\bою\b>=нолём=gI
s=<10\.0\.0\.\bу\b>=ноль=gI
s=<10\.0\.0\.\bх\b>=нулевых=gI
s=<10\.0\.0\.\bые\b>=нулевые=gI
s=<10\.0\.0\.\bым\b>=нулевым=gI
s=<10\.0\.0\.\bю\b>=нулевую=gI
s=<10\.0\.0\.\bя\b>=нулевая=gI
# =
s=<10\.0\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>==gI
s=<10\.1\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>==gI
s=<10\.2\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>==gI
s=<10\.3\.0\.([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]{1,3})?>==gI
# Удаление лишнего =
s=<скл\.пор\.числ\.нач\.>==gI
s=<скл\.пор\.числ\.кон\.>==gI
s=<скл\.цел\.числ\.нач\.>==gI
s=<скл\.цел\.числ\.кон\.>==gI
s=<скл\.соб\.числ\.нач\.>==gI
s=<скл\.соб\.числ\.кон\.>==gI
###########################################################################################=
# Цифровые окончания (конец) =
###########################################################################################=
s=<РимЧ>==gI
s=\s*(del_space)==gI
s=(\S)\s+=\1 =gI
#s=(<)([\w0-9.-]+)(>)==gI
# удаление лишнего =
s=\s?-\s?(\bго\b|\bму\b|\bим\b|\bом\b|\bа\b|\bой\b|\bу\b|\bою\b|\bо\b|\bими\b|\bих\b|\bи\b|\bый\b|\bй\b|\bого\b|\b\bому\b|\bым\b|\bм\b|\bя\b|\bй\b|\bю\b|\bе\b|\bх\b|\bые\b|\bми\b|\bро\b|\bых\b|\bрым\b|\bро\b|\bых\b|\bыми\b|\bах\b)==g
s=\bгг\.==gI
s=\b(гОда)\b\s\b(года)\b=\1=gI
s=\b(огогОда)\b=гОда=gI
s=(ого го)\b\s\b(года)\b=ого гОда=gI
s=(ого)\sго\b\s=\1 =gI
s=([0-9]+)\s?(-)?\s?([0-9]+)\s([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)?(метр)([абвгдеёжзийклмнопрстуфхцчшщъыьэюя]+)([0-9]+)-(\w)= \2=gI
s=([0-9]+)\sH\b=\1 аШ=gI
s=([0-9]+)\s(P)\b=\1 Пэ=gI
s=(\S+(ов))\s?([/])(час)=\1 в \4=gI
s=км в час=километров в час=gI
s=\bкм в час=километров в час=gI
s=([0-9]+)\s(\bчасов\b)\s(0)\s(минУт)=\1 \2=gI
s=(\w+)\s(\bчасов\b)\s(0|ноль)\s(минУт)=\1 \2=gI
s=(\s)(-)(\w+)=\1 \3=gI
s=\b(гОда г)\b=гОда.=gI
s=-\s\bго\b\s\b(года)\b=гОда=gI
s= …=…=gI
s=([0-9]+)-(\w)=\1 \2=gI
s=([0-9]+)\sH\b=\1 аШ=gI
s=([0-9]+)\s(P)\b=\1 Пэ=gI
s=(\S+(ов))\s?([/])(час)=\1 в \4=gI
# =
#s=\/= - =gI
s=\bч\.==gI
s=\bгОда г\.=гОда.=gI
s=\bгОда рождения =гОда рождения. =gI
s=\bтрёх тонк(\w+)=трёхтонк\1=gI
s=\bтрёх дневник(\w+)?=трёхдневник\1=gI
s=\bу н/п=у населённого пункта=gI
s=\+=плюс =gI
s=\b(Жигул|Кольт)(\w+)?\s([0-9][0-9])([0-9][0-9])=\1\2 \3 \4=gI
#<\s?(\w+\s?[0-9])\s?>=
#s=\.,=,=gI
s=N-ской=энской=gI
#s=(\w+)(\r+)=\1...\r\n=gI
#s=(\w)\s([0-9]+)(\r+)=\1 \2...\r\n=gI
s=\s+([-,.…)])=\1=gI
s=(\S)\s+=\1 =gI
s=\(\s+=(=gI
s=-\s+=- =gI
s=\s+(\)|<\/p>)=\1=gI

# Сокращения эр и веков
s=\sн\.\s?э\.= нашей эры=g


