# Последняя версия файла тут: https://github.com/Balamoote/gtts-dic 
s=\bсказали все сами за себя\.\b=сказали всё сами за себя\.=gI
s=\b- все, мы в\b=- Всё, мы в=gI
s=\b(в)се текли и текли\.\b=\1сё текли и текли\.=gI
s=\bвыложила мне все:\b=выложила мне всё:=gI
s=\bвыложил мне все:\b=выложил мне всё:=gI
s=\bвыложили мне все:\b=выложили мне всё:=gI
s=\bтут же близко все\.\b=тут же близко всё\.=gI
s=\bзаметил все и сейчас\.\b=заметил всё и сейчас\.=gI
s=\bвыражать все торжество\b=выражать всё торжество=gI
s=\bразом потеряли все значение\.\b=разом потеряли всё значение\.=gI
s=\bпосмотреть на все снизу, чтобы\b=посмотреть на всё снизу, чтобы=gI
s=\bмогло все быть\b=могло всё быть=gI
s=\bнам сообщил все,\b=нам сообщил всё,=gI
s=\bнужно завершить все и\b=нужно завершить всё и=gI
s=\b- Завтра я получу все\.\b=- Завтра я получу всё\.=gI
s=\bтам уже все подготовили\b=там уже всё подготовили=gI
s=\bмы все обследовали\b=мы всё обследовали=gI
s=\b- Да понимают они все,\b=- Да понимают они всё,=gI
s=\bблагодарность за все\.\b=благодарность за всё\.=gI
s=\bправо знать все\.\b=право знать всё\.=gI
s=\bправо знать все,\b=право знать всё,=gI
s=\bправо знать все!\b=право знать всё!=gI
s=\bразведал он там все\.\b=разведал он там всё\.=gI
s=\bразведал он там все,\b=разведал он там всё,=gI
s=\b- все, ребята\.\b=- всё, ребята\.=gI
s=\bЭто все или ещ[её] что тоъ\b=Это всё или ещё что тоъ=gI
s=\bспособен на все\.\b=способен на всё\.=gI
s=\bспособна на все\.\b=способна на всё\.=gI
s=\bспособен на все!\b=способен на всё!=gI
s=\bспособна на все!\b=способна на всё!=gI
s=\bТолько из дерева постройте все\.\b=Только из дерева постройте всё\.=gI
s=\bнаше все\.\b=наше всё\.=gI
s=\bчтобы их все полностью устраивало\b=чтобы их всё полностью устраивало=gI
s=\bНо мы ведь все уже выяснили\.\b=Но мы ведь всё уже выяснили\.=gI
s=\bруки все не доходили\b=руки всё не доходили=gI
s=\bВы все делаете совершенно правильно\b=Вы все делаете совершенно правильно=gI
s=\bвы все делаете совершенно правильно\b=вы всё делаете совершенно правильно=gI
s=\bотвечать за все\.\b=отвечать за всё\.=gI
s=\bотвечать за все, кроме\b=отвечать за всё, кроме=gI
s=\bв дом все перетаскали\b=в дом всё перетаскали=gI
s=\bосмыслив все\.\b=осмыслив всё\.=gI
s=\bу парнишки уже все убрали\b=у парнишки уже всё убрали=gI
s=\bмы сделаем все\.\b=мы сделаем всё\.=gI
s=\b(В)се, на сегодня\b=Всё, на сегодня=gI
s=\b(В)се в вашем кабинете\.\b=Всё в вашем кабинете\.=gI
s=\b(В)се надеюсь найти от них ключи\b=Всё надеюсь найти от них ключи=gI
s=\bв целом все неплохо\.\b=в целом всё неплохо\.=gI
s=\bслов, которые ставили все на места\.\b=слов, которые ставили всё на места\.=gI
s=\bКак только они ушли домой, мы перетащили все за\b=Как только они ушли домой, мы перетащили всё за=gI
s=\b(В)се нарастающее ощущение\b=Всё нарастающее ощущение=gI
s=\bМне уже все сообщили\b=Мне уже всё сообщили=gI
s=\bИ главные чайные короли давно уже все отладили\.\b=И главные чайные короли давно уже всё отладили\.=gI
s=\bИ тайно верн[её]т все в архив\b=И тайно вернёт всё в архив=gI
s=\bЛыков с Проданом выбили все на отлично и прониклись ещ[её] большим взаимным уважением\.\b=Лыков с Проданом выбили всё на отлично и прониклись ещё большим взаимным уважением\.=gI
s=\bОблаву на Бугаевке пришлось отменить - сил на все сразу у сыскного отделения не хватало\.\b=Облаву на Бугаевке пришлось отменить - сил на всё сразу у сыскного отделения не хватало\.=gI
s=\bПока все, сволочь, не выложишь\.\b=Пока всё, сволочь, не выложишь\.=gI
s=\bНу я все сказал,\b=Ну я всё сказал,=gI
s=\bНу я все сказала,\b=Ну я всё сказала,=gI
s=\bне закроет все осведомление,\b=не закроет всё осведомление,=gI
s=\bсбежалось бы все общежитие\b=сбежалось бы всё общежитие=gI
s=\bсбежалось все общежитие\b=сбежалось всё общежитие=gI
s=\bпереваривая все, приключившееся за\b=переваривая всё, приключившееся за=gI
s=\bчто напарники все будут делать за тебя\b=что напарники всё будут делать за тебя=gI
s=\bДостало все\b=Достало всё=gI
s=\bМы всЁ очень попросим,\b=Мы все очень попросим,=gI
s=\bи все стоически терпит\b=и всё стоически терпит=gI
s=\b- Это все я!\b=- Это всё я!=gI
s=\bМы тоъ всЁ тогда кто\?\b=Мы тоъ все тогда кто\?=gI
s=\bМы все внимательно осмотрели\b=Мы всё внимательно осмотрели=gI
s=\bГоворил мне все, пел\b=Говорил мне всё, пел=gI
s=\bМы все знаем!\b=Мы всё знаем!=gI
s=\bМы все съели\.\b=Мы все съели\.=gI
s=\b(В)се, что мог\b=Всё, что мог=gI
s=\b(В)се, изложенное\b=Всё, изложенное=gI
s=\bпять серебряных листочков за все,\b=пять серебряных листочков за всё,=gI
s=\b(В)се, отработку зачли!\b=Всё, отработку зачли!=gI
s=\b(В)се! Дыши\b=Всё! Дыши=gI
s=\b(в)се мясо не съели\b=\1сё мясо не съели=gI
s=\b(в)се мясо съели\b=\1сё мясо съели=gI
s=\bА когда вы все готовить успеваете\?\b=А когда вы всё готовить успеваете\?=gI
s=\b(В)се ведь точно предсказала\b=Все ведь точно предсказала=gI
s=\bдолжно решиться все\.\b=должно решиться всё\.=gI
s=\bдолжно решиться все!\b=должно решиться всё!=gI
s=\bдолжно решиться все\?\b=должно решиться всё\?=gI
s=\bпонимаю, хоть тоже не все\.\b=понимаю, хоть тоже не всё\.=gI
s=\bвыболтал все\.\b=выболтал всё\.=gI
s=\bвыболтала все\.\b=выболтала всё\.=gI
s=\bВам бы все хиханьки\b=Вам бы всё хиханьки=gI
s=\b(В)се, сколько вас тут есть\.\b=Всё, сколько вас тут есть\.=gI
s=\bкоторым все всегда без разницы\b=которым всё всегда без разницы=gI
s=\bХватался за все,\b=Хватался за всё,=gI
s=\bХватался за все\.\b=Хватался за всё\.=gI
s=\bхочу услышать все от тебя\b=хочу услышать всё от тебя=gI
s=\bВр[её]шь все\b=Врёшь всё=gI
s=\b(в)се меньше места\b=\1сё меньше места=gI
s=\b(В)се больше как тоъ\b=Всё больше как тоъ=gI
s=\bмрут, как мухи, а вам все шутки\b=мрут, как мухи, а вам всё шутки=gI
s=\bПоэты должны знать все,\b=Поэты должны знать всё,=gI
s=\bНу а теперь снимай все,\b=Ну а теперь снимай всё,=gI
s=\bА теперь снимай все,\b=А теперь снимай всё,=gI
s=\bТеперь снимай все,\b=Теперь снимай всё,=gI
s=\bОднако все, вместе взятое\b=Однако всё, вместе взятое=gI
s=\b(в)се вместе взятое\b=\1сё вместе взятое=gI
s=\b(в)се фиксирует в памяти\b=\1сё фиксирует в памяти=gI
s=\bвыворачивающий все внутри\b=выворачивающий всё внутри=gI
s=\b(в)се таки\b=\1сё таки=gI
s=\b(в)се время\b=\1сё время=gI
s=\b(в)се равно\b=\1сё равно=gI
s=\bкак все в действительности обстоит\b=как всё в действительности обстоит=gI
s=\bВидела все как бы\b=Видела всё как бы=gI
s=\bВидел все как бы\b=Видел всё как бы=gI
s=\bкоторому принадлежит все\.\b=которому принадлежит всё\.=gI
s=\bкоторой принадлежит все\.\b=которой принадлежит всё\.=gI
s=\bкоторым принадлежит все\.\b=которым принадлежит всё\.=gI
s=\bбудто знаете все\.\b=будто знаете всё\.=gI
s=\bа мои воины все прибывают и\b=а мои воины всё прибывают и=gI
s=\bвыдумал все!\b=выдумал всё!=gI
s=\bвыдумал все\.\b=выдумал всё\.=gI
s=\b(в)се, без утайки\b=\1сё, без утайки=gI
s=\b(в)се без утайки\b=\1сё без утайки=gI
s=\bотдаст ей все:\b=отдаст ей всё:=gI
s=\bотдаст ему все:\b=отдаст ему всё:=gI
s=\bотдаст им все:\b=отдаст им всё:=gI
s=\bЕжели не поможет то все!\b=Ежели не поможет то всё!=gI
s=\bэто все без нас\b=это всё без нас=gI
s=\bКак только все закончите,\b=Как только всё закончите,=gI
s=\b- Пока все,\b=- Пока всё,=gI
s=\b- Ну, если у вас все… \b=- Ну, если у вас всё… =gI
s=\bвзять от жизни все -\b=взять от жизни всё -=gI
s=\bесли с этим все, предлагаю\b=если с этим всё, предлагаю=gI
s=\bесли с этим все, то предлагаю\b=если с этим всё, то предлагаю=gI
s=\bя все утрясу\b=я всё утрясу=gI
s=\bЯ, как и вс[её], тут же начала\b=Я, как и все, тут же началА=gI
s=\bЯ, как и вс[её], тут же начал\b=Я, как и все, тут же нАчал=gI
s=\b(В)се, прощай\b=Всё, прощай=gI
s=\bтоже все ожидаемо\.\b=тоже всё ожидаемо\.=gI
s=\b- Ты мне утром все подпишешь\b=- Ты мне утром всё подпишешь=gI
s=\bТак что они все подготовят,\b=Так что они всё подготовят,=gI
s=\bна все вообще согласная\b=на всё вообще согласная=gI
s=\bИ в общем все, - закончила я свой рассказ\b=И в общем всё, - закончила я свой рассказ=gI
s=\bВот повезло, и все тут!\b=Вот повезло, и всё тут!=gI
s=\bтам все здоровски,\b=там всё здоровски,=gI
s=\b(В)се собрать и навести порядок\b=Всё собрать и навести порядок=gI
s=\b(В)се шикарненько!\b=Всё шикарненько!=gI
s=\b(в)се все просекли\b=все всё просекли=gI
s=\bпроверить все таки стоит\b=проверить всё таки стОит=gI
s=\b(в)с[её]\. Вернее, почти все\b=\1сё\. Вернее, почти всё=gI
s=\bза это за все\.\b=за это за всё\.=gI
s=\bза это за все!\b=за это за всё!=gI
s=\bза это за все\?\b=за это за всё\?=gI
s=\b(в)се вокруг исползали\.\b=\1сё вокруг исползали\.=gI
s=\b(в)се вокруг исползали,\b=\1сё вокруг исползали,=gI
s=\bпомнил почти все, но\b=помнил почти всё, но=gI
s=\bвидеть их вс[её],\b=видеть их все,=gI
s=\bвидеть их вс[её]\.\b=видеть их все\.=gI
s=\bвидеть их вс[её]!\b=видеть их все!=gI
s=\bвидеть их вс[её]\?\b=видеть их все\?=gI
s=\b(в)се от настроения зависит\b=\1сё от настроения зависит=gI
s=\b(в)се схватываешь нал[её]ту\b=\1сё схватываешь налету=gI
s=\b(в)се схватываешь налету\b=\1сё схватываешь налету=gI
s=\b(в)се вр[её]шь\b=\1сё врёшь=gI
s=\bмы все подпишем\b=мы всё подпишем=gI
s=\b(в)се одно е[её] зазря\b=\1сё одно её зазря=gI
s=\b(в)се приходится делать\b=\1сё приходится делать=gI
s=\b(в)се по уму сделали\b=\1сё по уму сделали=gI
s=\bмы ж все понимаем\b=мы ж всё понимаем=gI
s=\b(в)се может оказаться\b=\1сё может оказаться=gI
s=\b(в)се забеременеть не может\b=\1сё забеременеть не может=gI
s=\bскоро за все заплатишь\b=скоро за всё заплатишь=gI
s=\b(в)се, приплыли\.\b=\1сё, приплыли\.=gI
s=\b(в)се, приплыли!\b=\1сё, приплыли!=gI
s=\b(в)се, приплыли\?\b=\1сё, приплыли\?=gI
s=\bвот все и встало\b=вот всё и встало=gI
s=\bэти тоъ о жизни все знают\b=эти тоъ о жизни всё знают=gI
s=\bэти о жизни все знают\b=эти о жизни всё знают=gI
s=\bони о жизни все знают\b=они о жизни всё знают=gI
s=\bони тоъ о жизни все знают\b=они тоъ о жизни всё знают=gI
s=\bмы видим все, а нас не видит никто\b=мы видим всё, а нас не видит никто=gI
s=\bмы видим все, а нас никто не видит\b=мы видим всё, а нас никто не видит=gI
s=\b- вроде все!\b=- Вроде всё!=gI
s=\b- все битком,\b=- всё битком,=gI
s=\b- все вот тут!\b=- всё вот тут!=gI
s=\b- все здесь!\b=- всё здесь!=gI
s=\b- все к вашим\b=- всё к вашим =gI
s=\b- все на месте\.\b=- всё на месте\.=gI
s=\b- все найду!\b=- всё найду!=gI
s=\b- все там\.\b=- всё там\.=gI
s=\b- все тебе\.\b=- всё тебе\.=gI
s=\b- все, - с наигранным\b=- всё, - с наигранным=gI
s=\b- все, мы на месте\b=- Всё, мы на месте=gI
s=\b- здесь все\?\b=- Здесь всё\?=gI
s=\b- и все\.\b=- и всё\.=gI
s=\b- у вас все,\b=- У вас всё,=gI
#s=\b#все ж\b=всё ж=gI
#s=\b#все знаете\b=всё знаете=gI
#s=\b#все о\b=всё о=gI
#s=\b#все по\b=всё по=gI
#s=\b#все помните\b=всё пОмните=gI
#s=\b#все я\b=всё я=gI
#s=\b#я все\b=я всё=gI
s=\b- Это все\?\b=- Это всё\?=gI
s=\b… И все,\b=… И всё,=gI
s=\bА ты все:\b=А ты всё:=gI
s=\bВообще все\.\b=Вообще всё\.=gI
s=\bВроде бы все\.\b=Вроде бы всё\.=gI
s=\b(В)се вокруг в их\b=\1сё вокруг в их=gI
s=\b(В)се как договаривались\b=Всё как договаривались=gI
s=\b(В)се на месте\b=\1сё на месте=gI
s=\b(В)се на этого\b=\1сё на этого=gI
s=\b(в)се непостоянно\b=\1сё непостоянно=gI
s=\b(В)се, мне конец\b=Всё, мне конец=gI
s=\b(В)се, хана\b=Всё, хана=gI
s=\b(В)с[её]\. Практически все\b=Всё\. Практически всё=gI
s=\bВы все делали правильно\b=Вы всё делали правильно=gI
s=\bИ все -\b=И всё -=gI
s=\bИ все ли мы сделали,\b=И всё ли мы сделали,=gI
s=\bИ все ли они сделали,\b=И всё ли они сделали,=gI
s=\bИ все,\b=И всё,=gI
s=\bИ все\?\b=И всё\?=gI
s=\bИ это все\.\b=И это всё\.=gI
s=\bМы все понимаем\.\b=Мы все понимаем\.=gI
s=\bНа все полчаса!\b=На всё полчаса!=gI
s=\bНесите все сюда\b=Несите всё сюда=gI
s=\bНу все!\b=Ну всё!=gI
s=\bНу все,\b=Ну всё,=gI
s=\bНу все\.\b=Ну всё\.=gI
s=\bПонятно все\.\b=Понятно всё\.=gI
s=\bТоже все понаслышке\.\b=Тоже всё понаслышке\.=gI
s=\bЧто все\?\b=Что всё\?=gI
s=\bЭто все -\b=Это всё -=gI
s=\bЭто все да\b=Это всё да=gI
s=\bЭто все\.\b=Это всё\.=gI
s=\bа все ведь просто\b=А всё ведь просто=gI
s=\bа все ж\b=а всё ж=gI
s=\bа все из за какой\b=а всё из за какой=gI
s=\bа все из за\b=А всё из за=gI
s=\bа все империя\b=А всё Империя=gI
s=\bа все как эмигрант\b=а всё как эмигрант=gI
s=\bа все не так\b=а всё не так=gI
s=\bа все планирование\b=а всё планирование=gI
s=\bа все подворье\.\b=а всё подворье\.=gI
s=\bа все почему\b=а всё почему=gI
s=\bа все развлечение\b=а всё развлечение=gI
s=\bа все сил[её]нок то\b=а всё силёнок то=gI
s=\bа все сил[её]нок тоъ\b=а всё силёнок тоъ=gI
s=\bа все туда же\b=а всё туда же=gI
s=\bа все\.\b=а всё\.=gI
s=\bа вы все дрыхнете\b=а вы всё дрыхнете=gI
s=\bа дело то все больше\b=а дело то всё больше=gI
s=\bа дело то все\b=а дело то всё=gI
s=\bа дело тоъ все больше\b=а дело тоъ всё больше=gI
s=\bа дело тоъ все\b=а дело тоъ всё=gI
s=\bа он все\b=а он всё=gI
s=\bа они все шли\b=а они всё шли=gI
s=\bа сейчас все\.\b=а сейчас всё\.=gI
s=\bа так все\.\b=а так всё\.=gI
s=\bа ты все смотри\b=а ты всё смотри=gI
s=\bа это все -\b=а это всё -=gI
s=\bа я все бил\b=А я всё бил=gI
s=\bа я все своих\b=а я всё своих=gI
s=\bа я все стою\b=а я всё стоЮ=gI
s=\bактивировать все сво[её]\b=активировать всё своё=gI
s=\bартиллерией все перемешали\b=артиллерией всё перемешали=gI
s=\bбанка все спрячет\b=банка всё спрячет=gI
s=\bбарахло все и оружие\b=барахло всё и оружие=gI
s=\bбегом, все время тут бегом\b=бегОм, всё время тут бегОм=gI
s=\bбез него все решат,\b=без него всё решат,=gI
s=\bбез толку все\b=без толку всё=gI
s=\bберега все также\b=берегА всё также=gI
s=\bберет вс[её], что\b=берёт всё, что=gI
s=\bбесплатно все сделаю\b=бесплатно всё сделаю=gI
s=\bболит все,\b=болит всё,=gI
s=\bбольшого, но все же острова\b=большого, но всё же Острова=gI
s=\bбрать все как\b=брать всё как=gI
s=\bбросай все и\b=бросай всё и=gI
s=\bбросают все и бегут\b=бросают всё и бегут=gI
s=\bбросил все и собираться\b=бросил всё и собираться=gI
s=\bбросил все на\b=бросил всё на=gI
s=\bбросим все и\b=бросим всё и=gI
s=\bбросит все\.\b=бросит всё\.=gI
s=\bбросить бы все к\b=бросить бы всё к=gI
s=\bбросить все и укрыться\b=бросить всё и укрыться=gI
s=\bбросить все и\b=бросить всё и=gI
s=\bбросить все на секунду\b=бросить всё на секунду=gI
s=\bбросить все уходим\b=бросить всё уходим=gI
s=\bбросить все,\b=бросить всё,=gI
s=\bброшу все и\b=брошу всё и=gI
s=\bбудем все больше\b=будем всё больше=gI
s=\bбудет все отрицать\b=будет всё отрицать=gI
s=\bбудет становиться все\b=будет становиться всё=gI
s=\bбудет у него все\b=будет у него всё=gI
s=\bбудто вымерло все\b=будто вымерло всё=gI
s=\bбудто это все\b=будто это всё=gI
s=\bбудь со мной все по другому\b=будь со мной всё по другому=gI
s=\bбуквально все в радиусе\b=буквально всё в радиусе=gI
s=\bбуря все пропитала\b=буря всё пропитала=gI
s=\bбы все отдал\b=бы всё отдал=gI
s=\bбывает на все\b=бывает на всё=gI
s=\bбыл все ещ[её] в\b=был всё ещё в=gI
s=\bбыл все ещ[её]\b=был всё ещё=gI
s=\bбыло бы все не перекрыть\b=было бы всё не перекрыть=gI
s=\bбыло все в\b=было всё в=gI
s=\bбыло все для\b=было всё для=gI
s=\bбыло все же\b=было всё же=gI
s=\bбыло все их\b=было всё их=gI
s=\bбыло все спокойно\b=было всё спокойно=gI
s=\bбыло позабыто все\b=было позабыто всё=gI
s=\bбыло уже все это\b=было уже всё это=gI
s=\bбыстро все сорганизовали\b=быстро всё сорганизовали=gI
s=\bбыстро говори все!\b=быстро говори всё!=gI
s=\bбыстро говори все,\b=быстро говори всё,=gI
s=\bбыстро говори все\.\b=быстро говори всё\.=gI
s=\bбыть все лучше\b=быть всё лучше=gI
s=\bбыть, все из за не[её]\b=быть, всё из за неё=gI
s=\bв книгу все\.\b=в книгу всё\.=gI
s=\bв меру все\.\b=В меру всё\.=gI
s=\bв ночной клуб ВсЕ для знати\.\b=в ночной клуб Всё для знати\.=gI
s=\bв подробностях все\.\b=В подробностях всё\.=gI
s=\bв порядке все,\b=в порядке всё,=gI
s=\bв пыль все то\b=в пыль всё то=gI
s=\bв руины все\b=в руины всё=gI
s=\bв себя все\b=в себя всё=gI
s=\bв этой жизни все\.\b=в этой жизни всё\.=gI
s=\bв этом всем\b=в этом всём=gI
s=\bвали все на\b=вали всё на=gI
s=\bвалить все на\b=валить всё на=gI
s=\bвам все на словах\b=вам всё на словах=gI
s=\bвам все об\b=вам всё об=gI
s=\bвам все пояснить\b=вам всё пояснить=gI
s=\bвам все разъяснят\b=вам всё разъяснят=gI
s=\bвам все это\b=вам всё это=gI
s=\bвам еду и все\b=вам едУ и всё=gI
s=\bвами все кругами\b=вами всё кругами=gI
s=\bввязался во все это\b=ввязался во всё это=gI
s=\bвед[её]т все в\b=ведёт всё в=gI
s=\bвезде все одинаково\.\b=везде всё одинаково\.=gI
s=\bвезде по своему все\.\b=везде посвОему всё\.=gI
s=\bвеки\. все\.\b=веки\. всё\.=gI
s=\bверни все назад\b=верни всё назад=gI
s=\bвернул все обратно\b=вернул всё обратно=gI
s=\bвернула все на\b=вернула всё на=gI
s=\bвернула все обратно\b=вернула всё обратно=gI
s=\bвернуть все назад\b=вернуть всё назад=gI
s=\bвзвыл на все\b=взвыл на всё=gI
s=\bвзглядом все вокруг\b=взглядом всё вокруг=gI
s=\bвзлетая все выше\b=взлетая всё выше=gI
s=\bвзрывать все будут\b=взрывать всё будут=gI
s=\bвзяли все и сд[её]рнули\b=Взяли всё и сдёрнули=gI
s=\bвидел все будто\b=видел всё будто=gI
s=\bвидел все вокруг\b=видел всё вокруг=gI
s=\bвидел все и все испытал\b=видел всё и всё испытал=gI
s=\bвидел вс[её] и все испытал\b=видел всё и всё испытал=gI
s=\bвидел все и\b=видел всё и=gI
s=\bвидел все как\b=видел всё как=gI
s=\bвидела все с какой то\b=видела всё с какой то=gI
s=\bвидела все с какой тоъ\b=видела всё с какой тоъ=gI
s=\bвидела все то\b=видела всё то=gI
s=\bвидела все\.\b=видела всё\.=gI
s=\bвидели все вокруг\b=видели всё вокруг=gI
s=\bвиделось все мирно\b=виделось всё мирно=gI
s=\bвидеть все вокруг\b=видеть всё вокруг=gI
s=\bвидеть все до конца\b=видеть всё до конца=gI
s=\bвидеть все именно\b=видеть всё именно=gI
s=\bвидеть все как\b=видеть всё как=gI
s=\bвидеть все таким\b=видеть всё таким=gI
s=\bвидим все в\b=видим всё в=gI
s=\bвидит все так\b=видит всё так=gI
s=\bвидит сразу все\b=видит сразу всё=gI
s=\bвидишь все с\b=видишь всё с=gI
s=\bвидишь все собственными\b=видишь всё собственными=gI
s=\bвидишь все то\b=видишь всё то=gI
s=\bвидно все достаточно\b=видно всё достаточно=gI
s=\bвидно все, и\b=видно всё, и=gI
s=\bвидно далеко не все\b=видно далеко не всё=gI
s=\bвидя все это\b=видя всё это=gI
s=\bвижу все в\b=вижу всё в=gI
s=\bвижу все насквозь\b=вижу всё насквозь=gI
s=\bвкусно все\.\b=вкусно всё\.=gI
s=\bвлезал все с большим\b=влезал всё с большим=gI
s=\bвлезал все с\b=влезал всё с=gI
s=\bвлезло почти все\b=Влезло почти всё=gI
s=\bвместе все делали\b=вместе всё делали=gI
s=\bвнешним все бывает\b=внешним всё бывает=gI
s=\bвнизу, все попроще\b=внизу, всё попроще=gI
s=\bвнимательно все осмотрим\b=внимательно всё осмотрим=gI
s=\bвнимательно все складываем\b=Внимательно всё складываем=gI
s=\bво все большую\b=во всё бОльшую=gI
s=\bво все верю\b=во всё верю=gI
s=\bво все горло\b=во всё горло=gI
s=\bво все подряд\b=во всё подряд=gI
s=\bво все свежее\b=во всё свЕжее=gI
s=\bво все сво[её]\b=во всё своё=gI
s=\bво все тело\b=во всё тело=gI
s=\bво все той же\b=во всё той же=gI
s=\bво все том же\b=во всё том же=gI
s=\bво все ч[её]рное\b=во всё чёрное=gI
s=\bво все чистое\b=во всё чистое=gI
s=\bво все это влезать\b=во всё это влезать=gI
s=\bво все это\b=во всё это=gI
s=\bво всем вина\b=во всём винА=gI
s=\bво всем замке\b=во всём зАмке=gI
s=\bво всем не признаетесь\b=во всём не признАетесь=gI
s=\bво всем округе\b=во всём Округе=gI
s=\bво всем признаюсь\b=во всём признАюсь=gI
s=\bво всем роду\b=во всём родУ=gI
s=\bво всем сознаюсь\b=во всём сознаюсь=gI
s=\bво всем\b=во всём=gI
s=\bвозвестит нам все\b=возвестит нам всё=gI
s=\bвоззрение на все\b=воззрение на всё=gI
s=\bвозможно абсолютно все\b=возможно абсолютно всё=gI
s=\bвозможность узнать все\b=возможность узнать всё=gI
s=\bвозьм[её]т и все испортит\b=возьмёт и всё испортит=gI
s=\bвозьмут все под\b=возьмут всё под=gI
s=\bволны все так же\b=волны всё так же=gI
s=\bвон все как\b=вон всё как=gI
s=\bвообще все делают\b=вообще всё делают=gI
s=\bвообще все очень\b=вообще всё очень=gI
s=\bворовство отберут все\b=воровство отберут всё=gI
s=\bвоспринимает все вместе\b=воспринимает всё вместе=gI
s=\bвоспринимали все как\b=воспринимали всё как=gI
s=\bвот все здесь\.\b=вот всё здесь\.=gI
s=\bвот все и решили\b=вот всё и решили=gI
s=\bвот и все вроде\.\b=Вот и всё вроде\.=gI
s=\bвот и все!\b=вот и всё!=gI
s=\bвот и все, ребята\.\b=вот и всё, ребята\.=gI
s=\bвот и все,\b=вот и всё,=gI
s=\bвот и все\.\b=вот и всё\.=gI
s=\bвот это вот все\b=вот это вот всё=gI
s=\bвполне все прилично\b=вполне всё прилично=gI
s=\bвраги все прибывали\b=враги всё прибывали=gI
s=\bврань[её] это все\b=враньё это всё=gI
s=\bвремени на все катастрофически\b=времени на всё катастрофически=gI
s=\bвремя все лечит\b=время всё лечит=gI
s=\bвр[её]т он все\b=врёт он всё=gI
s=\bвр[её]т она все\b=врёт она всё=gI
s=\bвр[её]шь ты все\b=врёшь ты всё=gI
s=\bвроде все и попроще\b=вроде всё и попроще=gI
s=\bвроде все целое\b=Вроде всё целое=gI
s=\bвроде все\.\b=вроде всё\.=gI
s=\bвроде нормально все,\b=вроде нормально всё,=gI
s=\bвроде официально все\b=Вроде официально всё=gI
s=\b(в)се - амба\b=\1сё - амба=gI
s=\b(в)се - врань[её]\b=\1сё - враньё=gI
s=\b(в)се - давай\b=\1сё - давай=gI
s=\b(в)се - день\b=\1сё - день=gI
s=\b(в)се - задаром\b=\1сё - задаром=gI
s=\b(в)се - и хорошее\b=\1сё - и хорошее=gI
s=\b(в)се - как всегда\b=\1сё - как всегда=gI
s=\b(в)се - клиент готов\b=\1сё - клиент готов=gI
s=\b(в)се - наступление\b=\1сё - наступление=gI
s=\b(в)се - обычная\b=\1сё - обычная=gI
s=\b(в)се - пиши пропало\b=\1сё - пиши пропало=gI
s=\b(в)се - поздно\b=\1сё - поздно=gI
s=\b(в)се - тогда\b=\1сё - тогда=gI
s=\b(в)се - хана\b=\1сё - хана=gI
s=\b(в)се - ч[её]рное\b=\1сё - чёрное=gI
s=\b(в)се абсолютно законно\b=\1сё абсолютно законно=gI
s=\b(в)се абсолютно нормально\b=\1сё абсолютно нормально=gI
s=\b(в)се абсолютно серь[её]зно\.\b=\1сё абсолютно серьёзно\.=gI
s=\b(в)се автомат совал\b=\1сё автомат совал=gI
s=\b(в)се аж зазвенело\b=\1сё аж зазвенело=gI
s=\b(в)се аккуратно лежит\b=\1сё аккуратно лежит=gI
s=\b(в)се аккуратно сгрузил\b=\1сё аккуратно сгрузил=gI
s=\b(в)се аккуратно устроил\b=\1сё аккуратно устроил=gI
s=\b(в)се аккуратно, уютно\.\b=\1сё аккуратно, уютно\.=gI
s=\b(в)се армейское имущество\b=\1сё армейское имущество=gI
s=\b(в)се б ржать\b=\1сё б ржать=gI
s=\b(в)се бегом делала\b=\1сё бегом делала=gI
s=\b(в)се бегом и на ходу\b=\1сё бегОм и на ходУ=gI
s=\b(в)се бегом,\b=\1сё бегОм,=gI
s=\b(в)се без видимого результата\b=\1сё без видимого результата=gI
s=\b(в)се без дураков\b=\1сё без дураков=gI
s=\b(в)се без изменений\b=\1сё без изменений=gI
s=\b(в)се без малейшего толку\b=\1сё без малейшего толку=gI
s=\b(в)се без обмана\b=\1сё без обмана=gI
s=\b(в)се без сучка без задоринки\b=\1сё без сучка без задоринки=gI
s=\b(в)се без толку\b=\1сё без толку=gI
s=\b(в)се безопасно\.\b=\1сё безопасно\.=gI
s=\b(в)се безрассудство затеи\b=\1сё безрассудство затеи=gI
s=\b(в)се белилами замазать\b=\1сё белилами замазать=gI
s=\b(в)се беломором травишься\b=\1сё беломором травишься=gI
s=\b(в)се белье в\b=\1сё бельё в=gI
s=\b(в)се бережно собирать\b=\1сё бережно собирать=gI
s=\b(в)се бессмысленно,\b=\1сё бессмысленно,=gI
s=\b(в)се бесхитростно,\b=\1сё бесхитростно,=gI
s=\b(в)се ближе и ближе\b=\1сё ближе и ближе=gI
s=\b(в)се ближе подходя\b=\1сё ближе подходя=gI
s=\b(в)се богатство\.\b=\1сё богатство\.=gI
s=\b(в)се богу молится\b=\1сё богу молится=gI
s=\b(в)се бодрее зашагал\b=\1сё бодрее зашагал=gI
s=\b(в)се боком ид[её]т\b=\1сё боком идёт=gI
s=\b(в)се более и более\b=\1сё более и более=gI
s=\b(в)се более менее незаконное\b=\1сё более менее незаконное=gI
s=\b(в)се более менее понятно\b=\1сё более менее понятно=gI
s=\b(в)се более менее утихло\b=\1сё более менее утихло=gI
s=\b(в)се более менее утряслось\b=\1сё более менее утряслось=gI
s=\b(в)се более менее ясно\b=\1сё более менее ясно=gI
s=\b(в)се более мощный\b=\1сё более мощный=gI
s=\b(в)се более связной\b=\1сё более свЯзной=gI
s=\b(в)се более смелые походы\b=\1сё более смелые походы=gI
s=\b(в)се более шумно\b=\1сё более шумно=gI
s=\b(в)се болото\.\b=\1сё болото\.=gI
s=\b(в)се больнее,\b=\1сё больнее,=gI
s=\b(в)се больнее\.\b=\1сё больнее\.=gI
s=\b(в)се больше для\b=\1сё больше для=gI
s=\b(в)се больше и\b=\1сё больше и=gI
s=\b(в)се больше из\b=\1сё больше из=gI
s=\b(в)се больше казался\b=\1сё больше казался=gI
s=\b(в)се больше места\b=\1сё больше мЕста=gI
s=\b(в)се больше накапливается\b=\1сё больше накапливается=gI
s=\b(в)се больше пикапы\b=\1сё больше пикапы=gI
s=\b(в)се больше под[её]ргивалось\b=\1сё больше подёргивалось=gI
s=\b(в)се больше пространства\b=\1сё больше пространства=gI
s=\b(в)се больше распаляют\b=\1сё больше распаляют=gI
s=\b(в)се больше склонялся\b=\1сё больше склонялся=gI
s=\b(в)се больше старались\b=\1сё больше старались=gI
s=\b(в)се больше стягивающиеся\b=\1сё больше стягивающиеся=gI
s=\b(в)се больше удивляясь\b=\1сё больше удивляясь=gI
s=\b(в)се большие и большие\b=\1сё бОльшие и бОльшие=gI
s=\b(в)се большие сомнения\b=\1сё бОльшие сомнения=gI
s=\b(в)се больший объем\b=\1сё бОльший объем=gI
s=\b(в)се большим и большим\b=\1сё большим и большим=gI
s=\b(в)се больших и больших\b=\1сё бОльших и бОльших=gI
s=\b(в)се больших усилий\b=\1сё бОльших усилий=gI
s=\b(в)се большую и большую\b=\1сё бОльшую и бОльшую=gI
s=\b(в)се большую независимость\b=\1сё бОльшую независимость=gI
s=\b(в)се большую поддержку\b=\1сё бОльшую поддержку=gI
s=\b(в)се большую популярность\b=\1сё бОльшую популярность=gI
s=\b(в)се большую тяжесть\b=\1сё бОльшую тяжесть=gI
s=\b(в)се большую уникальность\b=\1сё бОльшую уникальность=gI
s=\b(в)се большую часть неба\b=\1сё большую часть неба=gI
s=\b(в)се брат,\b=\1сё брат,=gI
s=\b(в)се брат\.\b=\1сё брат\.=gI
s=\b(в)се бренди\.\b=\1сё бренди\.=gI
s=\b(в)се бродили по\b=\1сё бродили по=gI
s=\b(в)се бросил и побежал\b=\1сё бросил и побежал=gI
s=\b(в)се бросила\.\b=\1сё бросила\.=gI
s=\b(в)се брошу и побегу\b=\1сё брошу и побегУ=gI
s=\b(в)се будем, только давай\b=\1сё будем, только давай=gI
s=\b(в)се будет в ажуре\b=\1сё будет в ажуре=gI
s=\b(в)се будет готово\b=\1сё будет готово=gI
s=\b(в)се будет зависеть\b=\1сё будет зависеть=gI
s=\b(в)се будет сделано\b=\1сё будет сделано=gI
s=\b(в)се будет хорошо\b=\1сё будет хорошо=gI
s=\b(в)се будешь играть\b=\1сё будешь играть=gI
s=\b(в)се будто выглажено\b=\1сё будто выглажено=gI
s=\b(в)се будто заледенело\b=\1сё будто заледенело=gI
s=\b(в)се будто специально лезло\b=\1сё будто специально лезло=gI
s=\b(в)се буквально замерло\b=\1сё буквально замерло=gI
s=\b(в)се бухло общее\b=\1сё бухло общее=gI
s=\b(в)се бы вам\b=\1сё бы вам=gI
s=\b(в)се бы вмиг изменилось\b=\1сё бы вмиг изменилось=gI
s=\b(в)се бы вскрылось\b=\1сё бы вскрылось=gI
s=\b(в)се бы вышло\b=\1сё бы вышло=gI
s=\b(в)се бы заранее расчистили\b=\1сё бы заранее расчистили=gI
s=\b(в)се бы им мордовать\b=\1сё бы им мордовать=gI
s=\b(в)се бы ладно\b=\1сё бы ладно=gI
s=\b(в)се бы на амфетамины показывало\b=\1сё бы на амфетамины показывало=gI
s=\b(в)се бы ничего\b=\1сё бы ничего=gI
s=\b(в)се бы обошлось\b=\1сё бы обошлось=gI
s=\b(в)се бы ограничилось\b=\1сё бы ограничилось=gI
s=\b(в)се бы пропало\b=\1сё бы пропало=gI
s=\b(в)се бы распродали давно\b=\1сё бы распродали давно=gI
s=\b(в)се бы стало\b=\1сё бы стало=gI
s=\b(в)се бы съел\b=\1сё бы съел=gI
s=\b(в)се бы хорошо\b=\1сё бы хорошо=gI
s=\b(в)се была иллюзия\b=\1сё была иллюзия=gI
s=\b(в)се была теория\b=\1сё была теория=gI
s=\b(в)се была фигня\b=\1сё была фигня=gI
s=\b(в)се было бы\b=\1сё было бы=gI
s=\b(в)се было проще\b=\1сё было проще=gI
s=\b(в)се было хорошего\b=\1сё было хорошего=gI
s=\b(в)се было ясно\b=\1сё было ясно=gI
s=\b(в)се былое однообразие\b=\1сё былое однообразие=gI
s=\b(в)се быстрее и быстрее\b=\1сё быстрее и быстрее=gI
s=\b(в)се быстрее и горячее\b=\1сё быстрее и горячЕе=gI
s=\b(в)се быстрей и быстрей\b=\1сё быстрей и быстрей=gI
s=\b(в)се быстрей\.\b=\1сё быстрей\.=gI
s=\b(в)се быстренько улажу\b=\1сё быстренько улажу=gI
s=\b(в)се быстро заживает\b=\1сё быстро заживает=gI
s=\b(в)се быстро зарастает\b=\1сё быстро зарастает=gI
s=\b(в)се быстро и нахально\b=\1сё быстро и нахально=gI
s=\b(в)се быстро и просто\b=\1сё быстро и просто=gI
s=\b(в)се быстро и тихо\b=\1сё быстро и тихо=gI
s=\b(в)се быстро не получится\b=\1сё быстро не получится=gI
s=\b(в)се быстро прошло\b=\1сё быстро прошло=gI
s=\b(в)се быстро успокаивается\b=\1сё быстро успокаивается=gI
s=\b(в)се быстро,\b=\1сё быстро,=gI
s=\b(в)се быть плохо\b=\1сё быть плохо=gI
s=\b(в)се в ажуре\b=\1сё в ажуре=gI
s=\b(в)се в бездну\b=\1сё в бездну=gI
s=\b(в)се в бл[её]сточках\b=\1сё в блёсточках=gI
s=\b(в)се в большом беспорядке\b=\1сё в большом беспорядке=gI
s=\b(в)се в большую и большую\b=\1сё в бОльшую и бОльшую=gI
s=\b(в)се в бумагах есть\b=\1сё в бумагах есть=gI
s=\b(в)се в бюджет ид[её]т\b=\1сё в бюджет идёт=gI
s=\b(в)се в вашей власти\b=\1сё в вашей власти=gI
s=\b(в)се в ваших руках\b=\1сё в ваших руках=gI
s=\b(в)се в ваших\b=\1сё в ваших=gI
s=\b(в)се в военторге\b=\1сё в военторге=gI
s=\b(в)се в воле\b=\1сё в вОле=gI
s=\b(в)се в глотку стекает\b=\1сё в глотку стекает=gI
s=\b(в)се в голове перепуталось\b=\1сё в голове перепуталось=gI
s=\b(в)се в голове\b=\1сё в голове=gI
s=\b(в)се в городе было\b=\1сё в городе было=gI
s=\b(в)се в грязи утонет\.\b=\1сё в грязИ утонет\.=gI
s=\b(в)се в два слова\b=\1сё в два слОва=gI
s=\b(в)се в детство\b=\1сё в детство=gI
s=\b(в)се в докладной\b=\1сё в докладной=gI
s=\b(в)се в доме перерыла\b=\1сё в доме перерыла=gI
s=\b(в)се в домике было\b=\1сё в домике было=gI
s=\b(в)се в душе пусто\b=\1сё в душЕ пусто=gI
s=\b(в)се в его руках\.\b=\1сё в его руках\.=gI
s=\b(в)се в его руке\b=\1сё в его руке=gI
s=\b(в)се в [её]лочку\.\b=\1сё в ёлочку\.=gI
s=\b(в)се в жизни было\b=\1сё в жизни было=gI
s=\b(в)се в жизни вста[её]т\b=\1сё в жизни встаёт=gI
s=\b(в)се в жизни плохо\b=\1сё в жизни плохо=gI
s=\b(в)се в жизни получается\b=\1сё в жизни получается=gI
s=\b(в)се в жизни складывалось\b=\1сё в жизни складывалось=gI
s=\b(в)се в жизни устраивает\b=\1сё в жизни устраивает=gI
s=\b(в)се в законе было\b=\1сё в законе было=gI
s=\b(в)се в запустении\b=\1сё в запустении=gI
s=\b(в)се в итоге оказывалось\b=\1сё в итоге оказывалось=gI
s=\b(в)се в кайф\b=\1сё в кайф=gI
s=\b(в)се в какие то странные\b=\1сё в какие то странные=gI
s=\b(в)се в какие тоъ странные\b=\1сё в какие тоъ странные=gI
s=\b(в)се в карман\b=\1сё в карман=gI
s=\b(в)се в картинках\b=\1сё в картинках=gI
s=\b(в)се в клочья\b=\1сё в клочья=gI
s=\b(в)се в клубах оставишь\b=\1сё в клубах оставишь=gI
s=\b(в)се в комнате заходило\b=\1сё в комнате заходило=gI
s=\b(в)се в конечном итоге\b=\1сё в конечном итоге=gI
s=\b(в)се в конечном сч[её]те прид[её]т\b=\1сё в конечном счёте придёт=gI
s=\b(в)се в конце концов может\b=\1сё в конце концов может=gI
s=\b(в)се в корне изменилось\b=\1сё в корне изменилось=gI
s=\b(в)се в кратчайший\b=\1сё в кратчайший=gI
s=\b(в)се в кредит отпускаю\b=\1сё в кредит отпускаю=gI
s=\b(в)се в лицо высказывал\b=\1сё в лицо высказывал=gI
s=\b(в)се в лучшем виде\b=\1сё в лучшем виде=gI
s=\b(в)се в магазинах прода[её]тся\b=\1сё в магазинах продаётся=gI
s=\b(в)се в мельчайших\b=\1сё в мельчайших=gI
s=\b(в)се в мире было\b=\1сё в мире было=gI
s=\b(в)се в мире неизменно\b=\1сё в мире неизменно=gI
s=\b(в)се в мире оказалось\b=\1сё в мире оказалось=gI
s=\b(в)се в мире относительно\b=\1сё в мире относительно=gI
s=\b(в)се в мире ощущает\b=\1сё в мире ощущает=gI
s=\b(в)се в мире связано\b=\1сё в мире связано=gI
s=\b(в)се в мире теч[её]т\b=\1сё в мире течёт=gI
s=\b(в)се в надежде\b=\1сё в надежде=gI
s=\b(в)се в нашей судьбе\b=\1сё в нашей судьбе=gI
s=\b(в)се в ней понятно\b=\1сё в ней понятно=gI
s=\b(в)се в ней разглядеть\b=\1сё в ней разглядеть=gI
s=\b(в)се в н[её]м было\b=\1сё в нем было=gI
s=\b(в)се в н[её]м есть\b=\1сё в нём есть=gI
s=\b(в)се в н[её]м изменилось\b=\1сё в нем изменилось=gI
s=\b(в)се в н[её]м неверно\b=\1сё в нем неверно=gI
s=\b(в)се в н[её]м теперь\b=\1сё в нем теперь=gI
s=\b(в)се в непромокаемый\b=\1сё в непромокаемый=gI
s=\b(в)се в новинку\b=\1сё в новинку=gI
s=\b(в)се в норме\b=\1сё в норме=gI
s=\b(в)се в обратном смысле\b=\1сё в обратном смысле=gI
s=\b(в)се в общих чертах знал\b=\1сё в общих чертах знал=gI
s=\b(в)се в огарках\b=\1сё в огарках=gI
s=\b(в)се в огне\b=\1сё в огне=gI
s=\b(в)се в один рюкзак\b=\1сё в один рюкзак=gI
s=\b(в)се в одном рюкзаке тащу\b=\1сё в одном рюкзаке тащу=gI
s=\b(в)се в окно поглядывал\b=\1сё в окно поглядывал=gI
s=\b(в)се в опломбированных\b=\1сё в опломбированных=gI
s=\b(в)се в памяти\b=\1сё в памяти=gI
s=\b(в)се в парилке излагал\b=\1сё в парилке излагал=gI
s=\b(в)се в переди\b=\1сё в переди=gI
s=\b(в)се в переработку\b=\1сё в переработку=gI
s=\b(в)се в полном порядке\b=\1сё в полном порядке=gI
s=\b(в)се в помойку,\b=\1сё в помойку,=gI
s=\b(в)се в порядке\b=\1сё в порядке=gI
s=\b(в)се в порядок\b=\1сё в порядок=gI
s=\b(в)се в последний момент\b=\1сё в последний момент=gI
s=\b(в)се в пределах\b=\1сё в пределах=gI
s=\b(в)се в прилагаемом\b=\1сё в прилагаемом=gI
s=\b(в)се в принципе понятно\b=\1сё в принципе понятно=gI
s=\b(в)се в природе\b=\1сё в природе=gI
s=\b(в)се в прошлом\b=\1сё в прошлом=gI
s=\b(в)се в радость\b=\1сё в радость=gI
s=\b(в)се в разговоре\b=\1сё в разговоре=gI
s=\b(в)се в рамках обычного\b=\1сё в рамках обычного=gI
s=\b(в)се в рамках правил\b=\1сё в рамках правил=gI
s=\b(в)се в рамках реальности\b=\1сё в рамках реальности=gI
s=\b(в)се в рот попад[её]т\b=\1сё в рот попадёт=gI
s=\b(в)се в руках\b=\1сё в руках=gI
s=\b(в)се в руке\b=\1сё в руке=gI
s=\b(в)се в самол[её]те было\b=\1сё в самолёте было=gI
s=\b(в)се в самую\b=\1сё в самую=gI
s=\b(в)се в сво[её]\b=\1сё в своё=gI
s=\b(в)се в свои руки\b=\1сё в свои руки=gI
s=\b(в)се в свою лодку отволок\b=\1сё в свою лодку отволок=gI
s=\b(в)се в себе\b=\1сё в себе=gI
s=\b(в)се в секрете\b=\1сё в секрете=gI
s=\b(в)се в силе\b=\1сё в силе=gI
s=\b(в)се в снегу,\b=\1сё в снегУ,=gI
s=\b(в)се в совокупности тянуло\b=\1сё в совокупности тянуло=gI
s=\b(в)се в соответствии\b=\1сё в соответствии=gI
s=\b(в)се в стили\b=\1сё в стили=gI
s=\b(в)се в сторону от\b=\1сё в сторону от=gI
s=\b(в)се в сумку\b=\1сё в сумку=gI
s=\b(в)се в тайне\b=\1сё в тайне=gI
s=\b(в)се в такой же связке\b=\1сё в такой же связке=gI
s=\b(в)се в таком духе\b=\1сё в таком духе=gI
s=\b(в)се в таком роде\b=\1сё в таком роде=gI
s=\b(в)се в твоих\b=\1сё в твоих=gI
s=\b(в)се в те же\b=\1сё в те же=gI
s=\b(в)се в тебе перевернуло\b=\1сё в тебе перевернуло=gI
s=\b(в)се в тех же\b=\1сё в тех же=gI
s=\b(в)се в того же\b=\1сё в того же=gI
s=\b(в)се в той же\b=\1сё в той же=gI
s=\b(в)се в толк\b=\1сё в толк=gI
s=\b(в)се в том же\b=\1сё в том же=gI
s=\b(в)се в тот же\b=\1сё в тот же=gI
s=\b(в)се в точности\b=\1сё в точности=gI
s=\b(в)се в три дэ моделирует\b=\1сё в три дэ моделирует=gI
s=\b(в)се в ту же коробку\b=\1сё в ту же коробку=gI
s=\b(в)се в ту же\b=\1сё в ту же=gI
s=\b(в)се в упадок пришло\b=\1сё в упадок пришло=gI
s=\b(в)се в фунтах,\b=\1сё в фунтах,=gI
s=\b(в)се в хлам,\b=\1сё в хлам,=gI
s=\b(в)се в цвет\.\b=\1сё в цвет\.=gI
s=\b(в)се в цвет\b=\1сё в цвет=gI
s=\b(в)се в целости будет\b=\1сё в целости будет=gI
s=\b(в)се в церкви оставил\b=\1сё в церкви оставил=gI
s=\b(в)се в ч[её]рном свете видишь\b=\1сё в чёрном свете видишь=gI
s=\b(в)се в чистоте\b=\1сё в чистоте=gI
s=\b(в)се в шариках\b=\1сё в шариках=gI
s=\b(в)се в шкаф\b=\1сё в шкаф=gI
s=\b(в)се в штатном\b=\1сё в штатном=gI
s=\b(в)се в шутку\b=\1сё в шутку=gI
s=\b(в)се в это мире готовилось\b=\1сё в это мире готовилось=gI
s=\b(в)се в этой жизни\b=\1сё в этой жизни=gI
s=\b(в)се в этой канаве окажется\b=\1сё в этой канаве окажется=gI
s=\b(в)се в этой комнате было\b=\1сё в этой комнате было=gI
s=\b(в)се в этом мире\b=\1сё в этом мире=gI
s=\b(в)се в ящике\b=\1сё в ящике=gI
s=\b(в)се вам будет\b=\1сё вам будет=gI
s=\b(в)се вам дадим\b=\1сё вам дадим=gI
s=\b(в)се вам двоим\b=\1сё вам двоим=gI
s=\b(в)се вам достанется\b=\1сё вам достанется=gI
s=\b(в)се вам объяснить\b=\1сё вам объяснить=gI
s=\b(в)се вам объясню\b=\1сё вам объясню=gI
s=\b(в)се вам рассказал\b=\1сё вам рассказал=gI
s=\b(в)се ваша подслушка\b=\1сё ваша подслушка=gI
s=\b(в)се ваше ближайшее\b=\1сё ваше ближайшее=gI
s=\b(в)се вверх дном\b=\1сё вверх дном=gI
s=\b(в)се вверх и вверх\b=\1сё вверх и вверх=gI
s=\b(в)се вдоль и\b=\1сё вдоль и=gI
s=\b(в)се вдруг всплыло\b=\1сё вдруг всплыло=gI
s=\b(в)се вдруг пришло\b=\1сё вдруг пришло=gI
s=\b(в)се вдруг прояснилось\b=\1сё вдруг прояснилось=gI
s=\b(в)се вдруг стало\b=\1сё вдруг стало=gI
s=\b(в)се ведь было\b=\1сё ведь было=gI
s=\b(в)се ведь верно,\b=\1сё ведь верно,=gI
s=\b(в)се ведь действительно могло\b=\1сё ведь действительно могло=gI
s=\b(в)се ведь до смешного\b=\1сё ведь до смешного=gI
s=\b(в)се ведь зависит\b=\1сё ведь зависит=gI
s=\b(в)се ведь и вправду\b=\1сё ведь и вправду=gI
s=\b(в)се ведь и впрямь было\b=\1сё ведь и впрямь было=gI
s=\b(в)се ведь лежит\b=\1сё ведь лежит=gI
s=\b(в)се ведь может\b=\1сё ведь может=gI
s=\b(в)се ведь не забер[её]те\b=\1сё ведь не заберёте=gI
s=\b(в)се ведь обошлось\b=\1сё ведь обошлось=gI
s=\b(в)се ведь так просто\b=\1сё ведь так просто=gI
s=\b(в)се ведь точно как\b=\1сё ведь точно как=gI
s=\b(в)се ведь уже закончилось\b=\1сё ведь уже закончилось=gI
s=\b(в)се ведь хорошо кончилось\b=\1сё ведь хорошо кончилось=gI
s=\b(в)се везде вижу\b=\1сё везде вижу=gI
s=\b(в)се везде плохо\b=\1сё везде плохо=gI
s=\b(в)се великолепно,\b=\1сё великолепно,=gI
s=\b(в)се великолепно\.\b=\1сё великолепно\.=gI
s=\b(в)се верно, - подумал\b=\1сё верно, - подумал=gI
s=\b(в)се верно\.\b=\1сё верно\.=gI
s=\b(в)се вернули\.\b=\1сё вернули\.=gI
s=\b(в)се вертит\.\b=\1сё вертит\.=gI
s=\b(в)се верхом ездит\b=\1сё вЕрхом ездит=gI
s=\b(в)се веселье и кончилось\b=\1сё веселье и кончилось=gI
s=\b(в)се весьма однозначно\b=\1сё весьма однозначно=gI
s=\b(в)се ветер уносит\b=\1сё ветер уносит=gI
s=\b(в)се взглядом умудр[её]нного\b=\1сё взглядом умудрённого=gI
s=\b(в)се вздор\.\b=\1сё вздор\.=gI
s=\b(в)се взл[её]тно посадочное поле\b=\1сё взлётно посадочное поле=gI
s=\b(в)се видели, все знают\b=\1сё видели, всё знают=gI
s=\b(в)се виднее и виднее\b=\1сё виднее и виднее=gI
s=\b(в)се вино выпьет\b=\1сё вино выпьет=gI
s=\b(в)се вино не выпил\b=\1сё вино не выпил=gI
s=\b(в)се винтик к винтику\b=\1сё винтик к винтику=gI
s=\b(в)се влияет,\b=\1сё влияет=gI
s=\b(в)се вместе - все равно стреляет\b=\1сё вместе - всё равно стреляет=gI
s=\b(в)се вместе - вс[её] равно стреляет\b=\1сё вместе - всё равно стреляет=gI
s=\b(в)се вместе весит\b=\1сё вместе весит=gI
s=\b(в)се вместе ещ[её] и связать\b=\1сё вместе ещё и связать=gI
s=\b(в)се вместе запульсировало\b=\1сё вместе запульсировало=gI
s=\b(в)се внезапно потеряло\b=\1сё внезапно потеряло=gI
s=\b(в)се вниз и вниз\b=\1сё вниз и вниз=gI
s=\b(в)се внизу было\b=\1сё внизу было=gI
s=\b(в)се внимание их\b=\1сё внимание их=gI
s=\b(в)се внимание, устремив\b=\1сё внимание, устремив=gI
s=\b(в)се внимательно прочитав\b=\1сё внимательно прочитав=gI
s=\b(в)се внутри кор[её]жило\b=\1сё внутри корёжило=gI
s=\b(в)се внутри оборвалось\b=\1сё внутри оборвалось=gI
s=\b(в)се внутри у не[её]\b=\1сё внутри у неё=gI
s=\b(в)се внутри человека\b=\1сё внутри человека=gI
s=\b(в)се во мне\b=\1сё во мне=gI
s=\b(в)се во сне было\b=\1сё во сне было=gI
s=\b(в)се вовсе не так готично\b=\1сё вовсе не так готично=gI
s=\b(в)се вовсе не так страшно\b=\1сё вовсе не так страшно=gI
s=\b(в)се водительское место забрызгано\b=\1сё водительское место забрызгано=gI
s=\b(в)се возместят,\b=\1сё возместят,=gI
s=\b(в)се возьмите,\b=\1сё возьмите,=gI
s=\b(в)се вокруг бурлит\b=\1сё вокруг бурлит=gI
s=\b(в)се вокруг было\b=\1сё вокруг было=gI
s=\b(в)се вокруг быстро менялось\b=\1сё вокруг быстро менялось=gI
s=\b(в)се вокруг в щепки\b=\1сё вокруг в щепки=gI
s=\b(в)се вокруг видим\.\b=\1сё вокруг видим\.=gI
s=\b(в)се вокруг внезапно изменилось\b=\1сё вокруг внезапно изменилось=gI
s=\b(в)се вокруг вроде и незнакомое\b=\1сё вокруг вроде и незнакомое=gI
s=\b(в)се вокруг выглядело\b=\1сё вокруг выглядело=gI
s=\b(в)се вокруг ещ[её] казалось\b=\1сё вокруг ещё казалось=gI
s=\b(в)се вокруг забрызгала\b=\1сё вокруг забрызгала=gI
s=\b(в)се вокруг заволокло\b=\1сё вокруг заволокло=gI
s=\b(в)се вокруг закрыто\b=\1сё вокруг закрыто=gI
s=\b(в)се вокруг замерло\b=\1сё вокруг замерло=gI
s=\b(в)се вокруг заполнилось\b=\1сё вокруг заполнилось=gI
s=\b(в)се вокруг засверкало\b=\1сё вокруг засверкало=gI
s=\b(в)се вокруг засияло\b=\1сё вокруг засияло=gI
s=\b(в)се вокруг застыло\b=\1сё вокруг застыло=gI
s=\b(в)се вокруг излучает\b=\1сё вокруг излучает=gI
s=\b(в)се вокруг им принадлежит\b=\1сё вокруг им принадлежит=gI
s=\b(в)се вокруг кажется\b=\1сё вокруг кажется=gI
s=\b(в)се вокруг казалось\b=\1сё вокруг казалось=gI
s=\b(в)се вокруг кровью\b=\1сё вокруг кровью=gI
s=\b(в)се вокруг мелькало\b=\1сё вокруг мелькало=gI
s=\b(в)се вокруг меня будто\b=\1сё вокруг меня будто=gI
s=\b(в)се вокруг настолько реальное\b=\1сё вокруг настолько реальное=gI
s=\b(в)се вокруг начало\b=\1сё вокруг нАчало=gI
s=\b(в)се вокруг не перевернут\b=\1сё вокруг не перевернУт=gI
s=\b(в)се вокруг него стало\b=\1сё вокруг него стало=gI
s=\b(в)се вокруг облазили\b=\1сё вокруг облазили=gI
s=\b(в)се вокруг обыскали\b=\1сё вокруг обыскали=gI
s=\b(в)се вокруг окрасилось\b=\1сё вокруг окрасилось=gI
s=\b(в)се вокруг очень медленное\b=\1сё вокруг очень медленное=gI
s=\b(в)се вокруг пахло\b=\1сё вокруг пахло=gI
s=\b(в)се вокруг пляжа крутится\b=\1сё вокруг пляжа крутится=gI
s=\b(в)се вокруг полнилось\b=\1сё вокруг полнилось=gI
s=\b(в)се вокруг померкло\b=\1сё вокруг померкло=gI
s=\b(в)се вокруг пораст[её]т\b=\1сё вокруг порастёт=gI
s=\b(в)се вокруг порублено\b=\1сё вокруг порублено=gI
s=\b(в)се вокруг посерело\b=\1сё вокруг посерело=gI
s=\b(в)се вокруг потемнело\b=\1сё вокруг потемнело=gI
s=\b(в)се вокруг потонуло\b=\1сё вокруг потонуло=gI
s=\b(в)се вокруг привычное\b=\1сё вокруг привычное=gI
s=\b(в)се вокруг провалилось\b=\1сё вокруг провалилось=gI
s=\b(в)се вокруг прошарили\b=\1сё вокруг прошарили=gI
s=\b(в)се вокруг рушилось\b=\1сё вокруг рушилось=gI
s=\b(в)се вокруг сво[её]\b=\1сё вокруг своё=gI
s=\b(в)се вокруг себя\b=\1сё вокруг себя=gI
s=\b(в)се вокруг смешалось\b=\1сё вокруг смешалось=gI
s=\b(в)се вокруг совершенно потемнело\b=\1сё вокруг совершенно потемнело=gI
s=\b(в)се вокруг совсем даже не его\b=\1сё вокруг совсем даже не его=gI
s=\b(в)се вокруг стало\b=\1сё вокруг стало=gI
s=\b(в)се вокруг станет\b=\1сё вокруг станет=gI
s=\b(в)се вокруг такое\b=\1сё вокруг такое=gI
s=\b(в)се вокруг усыпано\b=\1сё вокруг усыпано=gI
s=\b(в)се вокруг холма казалось\b=\1сё вокруг холма казалось=gI
s=\b(в)се вокруг\.\b=\1сё вокруг\.=gI
s=\b(в)се волшебство исчезнет\b=\1сё волшебство исчезнет=gI
s=\b(в)се вообще не про вас\b=\1сё вообще не про вас=gI
s=\b(в)се вообще происходит\b=\1сё вообще происходит=gI
s=\b(в)се вооружение с\b=\1сё вооружение с=gI
s=\b(в)се вооружение, что\b=\1сё вооружение, что=gI
s=\b(в)се вопрос меня\b=\1сё вопрос меня=gI
s=\b(в)се воспримет всерь[её]з\b=\1сё воспримет всерьёз=gI
s=\b(в)се воспринимаете с\b=\1сё воспринимаете с=gI
s=\b(в)се вот вот\b=\1сё вот вот=gI
s=\b(в)се вот это предвидеть\b=\1сё вот это предвидеть=gI
s=\b(в)се впер[её]д и впер[её]д\b=\1сё вперёд и вперёд=gI
s=\b(в)се впереди,\b=\1сё впереди,=gI
s=\b(в)се вперемешку валялось\b=\1сё вперемешку валялось=gI
s=\b(в)се вполне аккуратно\.\b=\1сё вполне аккуратно\.=gI
s=\b(в)се вполне мирно\.\b=\1сё вполне мирно\.=gI
s=\b(в)се вполне объяснимо\b=\1сё вполне объяснимо=gI
s=\b(в)се вполне осуществимо\b=\1сё вполне осуществимо=gI
s=\b(в)се вполне прилично\.\b=\1сё вполне прилично\.=gI
s=\b(в)се вполне пристойно\b=\1сё вполне пристойно=gI
s=\b(в)се вполне сопоставимо\b=\1сё вполне сопоставимо=gI
s=\b(в)се вполне терпимо\b=\1сё вполне терпимо=gI
s=\b(в)се вполне функционально\b=\1сё вполне функционально=gI
s=\b(в)се вполне ясно\b=\1сё вполне ясно=gI
s=\b(в)се впритирку\.\b=\1сё впритирку\.=gI
s=\b(в)се времени не\b=\1сё времени не=gI
s=\b(в)се времени никак\b=\1сё времени никак=gI
s=\b(в)се временно,\b=\1сё временно,=gI
s=\b(в)се время будут\b=\1сё время будут=gI
s=\b(в)се время возникали\b=\1сё время возникали=gI
s=\b(в)се время держаться\b=\1сё время держаться=gI
s=\b(в)се время едут\b=\1сё время едут=gI
s=\b(в)се время их\b=\1сё время их=gI
s=\b(в)се время надо\b=\1сё время надо=gI
s=\b(в)се время оглядывались\b=\1сё время оглядывались=gI
s=\b(в)се время около\b=\1сё время около=gI
s=\b(в)се время перемещались\b=\1сё время перемещались=gI
s=\b(в)се время плакала\b=\1сё время плакала=gI
s=\b(в)се время показа\b=\1сё время показа=gI
s=\b(в)се время прятаться\b=\1сё время прятаться=gI
s=\b(в)се время пути\b=\1сё время пути=gI
s=\b(в)се время пытаются\b=\1сё время пытаются=gI
s=\b(в)се время сопровождают\b=\1сё время сопровождают=gI
s=\b(в)се время что то\b=\1сё время что то=gI
s=\b(в)се время что тоъ\b=\1сё время что тоъ=gI
s=\b(в)се вроде бы в порядке\b=\1сё вроде бы в порядке=gI
s=\b(в)се вроде бы как по\b=\1сё вроде бы как по=gI
s=\b(в)се вроде бы нормально\b=\1сё вроде бы нормально=gI
s=\b(в)се вроде бы сработало\b=\1сё вроде бы сработало=gI
s=\b(в)се вроде бы сходится\b=\1сё вроде бы сходится=gI
s=\b(в)се вроде бы хорошо\b=\1сё вроде бы хорошо=gI
s=\b(в)се вроде верно\b=\1сё вроде верно=gI
s=\b(в)се вроде есть\b=\1сё вроде есть=gI
s=\b(в)се вроде ид[её]т\b=\1сё вроде идёт=gI
s=\b(в)се вроде как было\b=\1сё вроде как было=gI
s=\b(в)се вроде как обычно\b=\1сё вроде как обычно=gI
s=\b(в)се вроде нормально,\b=\1сё вроде нормально,=gI
s=\b(в)се вроде спокойно\b=\1сё вроде спокойно=gI
s=\b(в)се вроде стоит\b=\1сё вроде стоит=gI
s=\b(в)се вроде сходится\b=\1сё вроде схОдится=gI
s=\b(в)се вроде сходиться\b=\1сё вроде схОдится=gI
s=\b(в)се вроде тихо\b=\1сё вроде тихо=gI
s=\b(в)се вроде хорошо\b=\1сё вроде хорошо=gI
s=\b(в)се вроде ясно\b=\1сё вроде ясно=gI
s=\b(в)се все бер[её]м\b=\1сё всё берём=gI
s=\b(в)се все вот это предвидеть\b=\1сё всё вот это предвидеть=gI
s=\b(в)се все записать\b=\1сё всё записать=gI
s=\b(в)се все и\b=\1сё все и=gI
s=\b(в)се все объясню\b=\1сё всё объясню=gI
s=\b(В)се вс[её] объясню\b=Всё всё объясню=gI
s=\b(в)се все понимают\b=все всё понимают=gI
s=\b(в)се все про всех\b=все всё про всех=gI
s=\b(в)се все слышали\b=все всё слышали=gI
s=\b(в)се все уже\b=все всё уже=gI
s=\b(в)се все это предвидеть\b=\1сё всё это предвидеть=gI
s=\b(в)се все, возвращаюсь\b=\1сё всё, возвращаюсь=gI
s=\b(в)с[её] все, возвращаюсь\b=\1сё всё, возвращаюсь=gI
s=\b(в)се все, голуба\b=\1сё всё, голуба=gI
s=\b(в)се все, парни\b=\1сё всё, парни=gI
s=\b(в)се все, тихо,\b=\1сё всё, тихо,=gI
s=\b(в)се всегда было\b=\1сё всегда было=gI
s=\b(в)се всегда очень сложно\b=\1сё всегда очень сложно=gI
s=\b(в)се всегда происходит\b=\1сё всегда происходит=gI
s=\b(в)се всегда просто\b=\1сё всегда просто=gI
s=\b(в)се всегда слишком\b=\1сё всегда слишком=gI
s=\b(в)се всегда упирается\b=\1сё всегда упирается=gI
s=\b(в)се всегда уточняю\b=\1сё всегда уточняю=gI
s=\b(в)се всегда хорошо не бывает\b=\1сё всегда хорошо не бывает=gI
s=\b(в)се всем ясно\b=\1сё всем ясно=gI
s=\b(в)се вскоре уладится\b=\1сё вскоре уладится=gI
s=\b(в)се вскрывать можно\b=\1сё вскрывать можно=gI
s=\b(в)се входит в стоимость\b=\1сё входит в стоимость=gI
s=\b(в)се вчера объехали\b=\1сё вчера объехали=gI
s=\b(в)се вчера прив[её]з\b=\1сё вчера привёз=gI
s=\b(в)се вы вр[её]те\b=\1сё вы врёте=gI
s=\b(в)се вы правильно\b=\1сё вы правильно=gI
s=\b(в)се вы тут сделали\b=\1сё вы тут сделали=gI
s=\b(в)се выволокли на\b=\1сё выволокли на=gI
s=\b(в)се выгребли\.\b=\1сё выгребли\.=gI
s=\b(в)се выжгли подчистую\b=\1сё выжгли подчистую=gI
s=\b(в)се вынесли\.\b=\1сё вынесли\.=gI
s=\b(в)се выслушайте,\b=\1сё выслушайте,=gI
s=\b(в)се выслушать,\b=\1сё выслушать,=gI
s=\b(в)се выше и выше\b=\1сё выше и выше=gI
s=\b(в)се выяснить самой\b=\1сё выяснить самОй=gI
s=\b(в)се гаже и гаже\b=\1сё гаже и гаже=gI
s=\b(в)се гаи скупила\b=\1сё ГАИ скупила=gI
s=\b(в)се геометрически правильно\b=\1сё геометрически правильно=gI
s=\b(в)се гладко получается\b=\1сё гладко получается=gI
s=\b(в)се гладко\.\b=\1сё гладко\.=gI
s=\b(в)се глазки опускала\b=\1сё глАзки опускала=gI
s=\b(в)се глубже погружался\b=\1сё глубже погружался=gI
s=\b(в)се говорили и говорили\b=\1сё говорили и говорили=gI
s=\b(в)се гораздо проще\b=\1сё гораздо проще=gI
s=\b(в)се гораздо серь[её]знее\b=\1сё гораздо серьёзнее=gI
s=\b(в)се гораздо серь[её]зней\b=\1сё гораздо серьёзней=gI
s=\b(в)се гораздо сложнее\b=\1сё гораздо сложнее=gI
s=\b(в)се гораздо сложней\b=\1сё гораздо сложней=gI
s=\b(в)се городу польза\b=\1сё городу польза=gI
s=\b(в)се горючее,\b=\1сё горючее,=gI
s=\b(в)се готов объяснить\b=\1сё готов объяснить=gI
s=\b(в)се да не все\b=\1сё да не всё=gI
s=\b(в)се давил и давил\b=\1сё давил и давил=gI
s=\b(в)се давно в металлолом\b=\1сё давно в металлолом=gI
s=\b(в)се давно ветерком сдуло\b=\1сё давно ветерком сдуло=gI
s=\b(в)се давно вывезли\b=\1сё давно вывезли=gI
s=\b(в)се давно заледенело\b=\1сё давно заледенело=gI
s=\b(в)се давно занесено\b=\1сё давно занесено=gI
s=\b(в)се давно и прочно засыпано\b=\1сё давно и прочно засыпано=gI
s=\b(в)се давно кончилось\b=\1сё давно кончилось=gI
s=\b(в)се давно обдумал\b=\1сё давно обдумал=gI
s=\b(в)се давно припасено\b=\1сё давно припасено=gI
s=\b(в)се давно разведано\b=\1сё давно разведано=gI
s=\b(в)се давно разж[её]вано\b=\1сё давно разжёвано=gI
s=\b(в)се давно решил\b=\1сё давно решил=gI
s=\b(в)се давным давно знакомо\b=\1сё давным давно знакомо=gI
s=\b(в)се давным давно прошло\b=\1сё давным давно прошло=gI
s=\b(в)се дальше и дальше\b=\1сё дальше и дальше=gI
s=\b(в)се дальше от\b=\1сё дальше от=gI
s=\b(в)се дальше уходит\b=\1сё дальше уходит=gI
s=\b(в)се дальше, дальше\b=\1сё дальше, дальше=gI
s=\b(в)се действительно просто\b=\1сё действительно просто=gI
s=\b(в)се делаем правильно\b=\1сё делаем правильно=gI
s=\b(в)се делаем с\b=\1сё делаем с=gI
s=\b(в)се делают вовремя\b=\1сё делают вовремя=gI
s=\b(в)се делают фабричные\b=\1сё делают фабричные=gI
s=\b(в)се держали в тайне\b=\1сё держали в тайне=gI
s=\b(в)се держать в голове\b=\1сё держать в голове=gI
s=\b(в)се держать в себе\b=\1сё держать в себе=gI
s=\b(в)се дерьмо в\b=\1сё дерьмо в=gI
s=\b(в)се дерьмо\.\b=\1сё дерьмо\.=gI
s=\b(в)се детально очень\b=\1сё детально очень=gI
s=\b(в)се детские сказки\b=\1сё детские сказки=gI
s=\b(в)се детское,\b=\1сё детское,=gI
s=\b(в)се дешевле,\b=\1сё дешевле,=gI
s=\b(в)се для вашего комфорта\b=\1сё для вашего комфорта=gI
s=\b(в)се для него изменилось\b=\1сё для него изменилось=gI
s=\b(в)се для него перемешалось\b=\1сё для него перемешалось=gI
s=\b(в)се для него утратило\b=\1сё для него утратило=gI
s=\b(в)се для победы\b=\1сё для победы=gI
s=\b(в)се для страны\b=\1сё для странЫ=gI
s=\b(в)се для тебя просто\b=\1сё для тебя просто=gI
s=\b(в)се для того\b=\1сё для того=gI
s=\b(в)се для утоления\b=\1сё для утоления=gI
s=\b(в)се для человечества\b=\1сё для человечества=gI
s=\b(в)се для школы\b=\1сё для школы=gI
s=\b(в)се днище танка\b=\1сё днище танка=gI
s=\b(в)се дно вокруг\b=\1сё дно вокруг=gI
s=\b(в)се до винтика\b=\1сё до винтика=gI
s=\b(в)се до войны вывезли\b=\1сё до войны вывезли=gI
s=\b(в)се до времени\b=\1сё до времени=gI
s=\b(в)се до капли\b=\1сё до капли=gI
s=\b(в)се до конца не определено\b=\1сё до конца не определено=gI
s=\b(в)се до конца так и не определено\b=\1сё до конца так и не определено=gI
s=\b(в)се до конца\b=\1сё до конца=gI
s=\b(в)се до крошки\b=\1сё до крошки=gI
s=\b(в)се до лампочки\b=\1сё до лампочки=gI
s=\b(в)се до мелочей\b=\1сё до мелочей=gI
s=\b(в)се до мельчайших\b=\1сё до мельчайших=gI
s=\b(в)се до отвращения\b=\1сё до отвращения=gI
s=\b(в)се до последнего вспоминай\b=\1сё до последнего вспоминай=gI
s=\b(в)се до суха\b=\1сё досуха=gI
s=\b(в)се до ужаса банально\b=\1сё до ужаса банально=gI
s=\b(в)се до фонаря\b=\1сё до фонаря=gI
s=\b(в)се до чего\b=\1сё до чего=gI
s=\b(в)се добротней и\b=\1сё добротней и=gI
s=\b(в)се добывать самостоятельно\b=\1сё добывать самостоятельно=gI
s=\b(в)се довольно интересно\b=\1сё довольно интересно=gI
s=\b(в)се довольно медленно доходит\b=\1сё довольно медленно доходит=gI
s=\b(в)се довольно медленно\b=\1сё довольно медленно=gI
s=\b(в)се должно закончиться\b=\1сё должно закончиться=gI
s=\b(в)се должно получиться\b=\1сё должно получиться=gI
s=\b(в)се должно служить цели\b=\1сё должно служить цели=gI
s=\b(в)се должно состояться\b=\1сё должно состояться=gI
s=\b(в)се дома нет\b=\1сё дома нет=gI
s=\b(в)се дома нету\b=\1сё дома нету=gI
s=\b(в)се дорогами возить\b=\1сё дорогами возить=gI
s=\b(в)се дорого,\b=\1сё дорого,=gI
s=\b(в)се дорого\.\b=\1сё дорого\.=gI
s=\b(в)се досконально,\b=\1сё досконально,=gI
s=\b(в)се доставим обратно\b=\1сё доставим обратно=gI
s=\b(в)се достаточно просто\b=\1сё достаточно просто=gI
s=\b(в)се достаточно скромно,\b=\1сё достаточно скромно,=gI
s=\b(в)се достаточно сложно\b=\1сё достаточно сложно=gI
s=\b(в)се друг другу все рассказывают\b=\1сё друг другу все рассказывают=gI
s=\b(в)се думаем,\b=\1сё думаем,=gI
s=\b(в)се дурачишься\?\b=\1сё дурачишься\?=gI
s=\b(в)се дышать будет\b=\1сё дышать будет=gI
s=\b(в)се его будущее\b=\1сё его будущее=gI
s=\b(в)се его внимание\b=\1сё его внимание=gI
s=\b(в)се его воля\b=\1сё его воля=gI
s=\b(в)се его время\b=\1сё его время=gI
s=\b(в)се его глазами\b=\1сё его глазами=gI
s=\b(в)се его горе\b=\1сё его гОре=gI
s=\b(в)се его грузное\b=\1сё его грузное=gI
s=\b(в)се его детство\b=\1сё его детство=gI
s=\b(в)се его естество\b=\1сё его естество=gI
s=\b(в)се его золото\b=\1сё его золото=gI
s=\b(в)се его идиотский\b=\1сё его идиотский=gI
s=\b(в)се его имущество\b=\1сё его имущество=gI
s=\b(в)се его лицо осветило\b=\1сё его лицо осветило=gI
s=\b(в)се его лицо превратилось\b=\1сё его лицо превратилось=gI
s=\b(в)се его мастерство\b=\1сё его мастерство=gI
s=\b(в)се его мужество\b=\1сё его мужество=gI
s=\b(в)се его окружение\b=\1сё его окружение=gI
s=\b(в)се его подразделение\b=\1сё его подразделение=gI
s=\b(в)се его прежнее\b=\1сё его прежнее=gI
s=\b(в)се его радужное\b=\1сё его радужное=gI
s=\b(в)се его самурайство\b=\1сё его самурайство=gI
s=\b(в)се его содержимое\b=\1сё его содержимое=gI
s=\b(в)се его существо\b=\1сё его существо=gI
s=\b(в)се его существование\b=\1сё его существование=gI
s=\b(в)се его тело\b=\1сё его тело=gI
s=\b(в)се его туловище\b=\1сё его туловище=gI
s=\b(в)се е[её] внимание\b=\1сё её внимание=gI
s=\b(в)се е[её] волшебство\b=\1сё её волшебство=gI
s=\b(в)се е[её] время\b=\1сё её время=gI
s=\b(в)се е[её] лицо\b=\1сё её лицо=gI
s=\b(в)се е[её] население\b=\1сё её население=gI
s=\b(в)се е[её] нормально не повязать\b=\1сё её нормально не повязать=gI
s=\b(в)се е[её] сознание\b=\1сё её сознание=gI
s=\b(в)се е[её] существо\b=\1сё её существо=gI
s=\b(в)се е[её] тело\b=\1сё её тело=gI
s=\b(в)се е[её] умение\b=\1сё её умение=gI
s=\b(в)се ей было\b=\1сё ей было=gI
s=\b(в)се ей выложил\b=\1сё ей выложил=gI
s=\b(в)се ей едино\b=\1сё ей едино=gI
s=\b(в)се ей нипоч[её]м\b=\1сё ей нипочём=gI
s=\b(в)се ей нравилось\b=\1сё ей нравилось=gI
s=\b(в)се ей разжуй\b=\1сё ей разжуй=gI
s=\b(в)се еле дышит\b=\1сё еле дышит=gI
s=\b(в)се ели и ели\b=\1сё ели и ели=gI
s=\b(в)се ему было\b=\1сё ему было=gI
s=\b(в)се ему дорого\b=\1сё ему дорого=gI
s=\b(в)се ему здесь знакомо\b=\1сё ему здесь знакомо=gI
s=\b(в)се ему изложил\b=\1сё ему изложил=gI
s=\b(в)се ему кажется\b=\1сё ему кажется=gI
s=\b(в)се ему нейм[её]тся\b=\1сё ему неймётся=gI
s=\b(в)се ему нравилось\b=\1сё ему нравилось=gI
s=\b(в)се ему обустроить\b=\1сё ему обустроить=gI
s=\b(в)се ему разом осточертело\b=\1сё ему разом осточертело=gI
s=\b(в)се ему трын\b=\1сё ему трын=gI
s=\b(в)се если я правильно\b=\1сё если я правильно=gI
s=\b(в)се ещ[её] актуален\b=\1сё ещё актуален=gI
s=\b(в)се ещ[её] бледный\b=\1сё ещё бледный=gI
s=\b(в)се ещ[её] богата\b=\1сё ещё богата=gI
s=\b(в)се ещ[её] бормоча\b=\1сё ещё бормоча=gI
s=\b(в)се ещ[её] будет\b=\1сё ещё будет=gI
s=\b(в)се ещ[её] был\b=\1сё ещё был=gI
s=\b(в)се ещ[её] была\b=\1сё ещё была=gI
s=\b(в)се ещ[её] было\b=\1сё ещё было=gI
s=\b(в)се ещ[её] в\b=\1сё ещё в=gI
s=\b(в)се ещ[её] ведутся\b=\1сё ещё ведутся=gI
s=\b(в)се ещ[её] веселей\b=\1сё ещё веселей=gI
s=\b(в)се ещ[её] висели\b=\1сё ещё висели=gI
s=\b(в)се ещ[её] витал\b=\1сё ещё витал=gI
s=\b(в)се ещ[её] возвращались\b=\1сё ещё возвращались=gI
s=\b(в)се ещ[её] восстанавливают\b=\1сё ещё восстанавливают=gI
s=\b(в)се ещ[её] впереди\b=\1сё ещё впереди=gI
s=\b(в)се ещ[её] высоко\b=\1сё ещё высокО=gI
s=\b(в)се ещ[её] двигаюсь\b=\1сё ещё двигаюсь=gI
s=\b(в)се ещ[её] действует\b=\1сё ещё действует=gI
s=\b(в)се ещ[её] д[её]ргалась\b=\1сё ещё дёргалась=gI
s=\b(в)се ещ[её] держа\b=\1сё ещё держа=gI
s=\b(в)се ещ[её] держал\b=\1сё ещё держал=gI
s=\b(в)се ещ[её] держала\b=\1сё ещё держала=gI
s=\b(в)се ещ[её] держась\b=\1сё ещё держась=gI
s=\b(в)се ещ[её] дремала\b=\1сё ещё дремала=gI
s=\b(в)се ещ[её] думая\b=\1сё ещё думая=gI
s=\b(в)се ещ[её] есть\b=\1сё ещё есть=gI
s=\b(в)се ещ[её] ждал\b=\1сё ещё ждал=gI
s=\b(в)се ещ[её] жив\b=\1сё ещё жив=gI
s=\b(в)се ещ[её] жива\b=\1сё ещё жива=gI
s=\b(в)се ещ[её] жив[её]т\b=\1сё ещё живёт=gI
s=\b(в)се ещ[её] живую\b=\1сё ещё живую=gI
s=\b(в)се ещ[её] жил\b=\1сё ещё жил=gI
s=\b(в)се ещ[её] забирала\b=\1сё ещё забирала=gI
s=\b(в)се ещ[её] зажаты\b=\1сё ещё зажаты=gI
s=\b(в)се ещ[её] здесь\b=\1сё ещё здесь=gI
s=\b(в)се ещ[её] и впереди\b=\1сё ещё и впереди=gI
s=\b(в)се ещ[её] игра\.\b=\1сё ещё игра\.=gI
s=\b(в)се ещ[её] избегая\b=\1сё ещё избегая=gI
s=\b(в)се ещ[её] имеет\b=\1сё ещё имеет=gI
s=\b(в)се ещ[её] кажется\b=\1сё ещё кажется=gI
s=\b(в)се ещ[её] крича\b=\1сё ещё крича=gI
s=\b(в)се ещ[её] л[её]жа\b=\1сё ещё лёжа=gI
s=\b(в)се ещ[её] маячили\b=\1сё ещё маячили=gI
s=\b(в)се ещ[её] могу\b=\1сё ещё могу=gI
s=\b(в)се ещ[её] могут\b=\1сё ещё могут=gI
s=\b(в)се ещ[её] может\b=\1сё ещё может=gI
s=\b(в)се ещ[её] молчал\b=\1сё ещё молчал=gI
s=\b(в)се ещ[её] на груди\b=\1сё ещё на грудИ=gI
s=\b(в)се ещ[её] на ходу\b=\1сё ещё на ходУ=gI
s=\b(в)се ещ[её] на\b=\1сё ещё на=gI
s=\b(в)се ещ[её] надутой\b=\1сё ещё надутой=gI
s=\b(в)се ещ[её] находился\b=\1сё ещё находился=gI
s=\b(в)се ещ[её] находящихся\b=\1сё ещё находящихся=gI
s=\b(в)се ещ[её] не было\b=\1сё ещё не было=gI
s=\b(в)се ещ[её] не верил\b=\1сё ещё не верил=gI
s=\b(в)се ещ[её] не мог\b=\1сё ещё не мог=gI
s=\b(в)се ещ[её] не найденные\b=\1сё ещё не найденные=gI
s=\b(в)се ещ[её] не наступал\b=\1сё ещё не наступал=gI
s=\b(в)се ещ[её] не понимая\b=\1сё ещё не понимая=gI
s=\b(в)се ещ[её] не рассеиваются\b=\1сё ещё не рассеиваются=gI
s=\b(в)се ещ[её] не сходят\b=\1сё ещё не сходят=gI
s=\b(в)се ещ[её] не успеваю\b=\1сё ещё не успеваю=gI
s=\b(в)се ещ[её] не являлис\b=\1сё ещё не являлис=gI
s=\b(в)се ещ[её] недоверчиво\b=\1сё ещё недоверчиво=gI
s=\b(в)се ещ[её] недоумевая\b=\1сё ещё недоумевая=gI
s=\b(в)се ещ[её] неосознанно\b=\1сё ещё неосознанно=gI
s=\b(в)се ещ[её] неподвижному\b=\1сё ещё неподвижному=gI
s=\b(в)се ещ[её] никак\b=\1сё ещё никак=gI
s=\b(в)се ещ[её] ночь\b=\1сё ещё ночь=gI
s=\b(в)се ещ[её] обиженная\b=\1сё ещё обиженная=gI
s=\b(в)се ещ[её] обладает\b=\1сё ещё обладает=gI
s=\b(в)се ещ[её] оставались\b=\1сё ещё оставались=gI
s=\b(в)се ещ[её] оставался\b=\1сё ещё оставался=gI
s=\b(в)се ещ[её] ошеломл[её]нного\b=\1сё ещё ошеломлённого=gI
s=\b(в)се ещ[её] падают\b=\1сё ещё падают=gI
s=\b(в)се ещ[её] переполненного\b=\1сё ещё переполненного=gI
s=\b(в)се ещ[её] плыло\b=\1сё ещё плыло=gI
s=\b(в)се ещ[её] плясали\b=\1сё ещё плясали=gI
s=\b(в)се ещ[её] полный\b=\1сё ещё полный=gI
s=\b(в)се ещ[её] потребляют\b=\1сё ещё потребляют=gI
s=\b(в)се ещ[её] преследуя\b=\1сё ещё преследуя=gI
s=\b(в)се ещ[её] прижимаясь\b=\1сё ещё прижимаясь=gI
s=\b(в)се ещ[её] продолжал\b=\1сё ещё продолжал=gI
s=\b(в)се ещ[её] пытался\b=\1сё ещё пытался=gI
s=\b(в)се ещ[её] пытаясь\b=\1сё ещё пытаясь=gI
s=\b(в)се ещ[её] работающих\b=\1сё ещё работающих=gI
s=\b(в)се ещ[её] рыдала\b=\1сё ещё рыдала=gI
s=\b(в)се ещ[её] с\b=\1сё ещё с=gI
s=\b(в)се ещ[её] сжимал\b=\1сё ещё сжимал=gI
s=\b(в)се ещ[её] сжимающего\b=\1сё ещё сжимающего=gI
s=\b(в)се ещ[её] сидела\b=\1сё ещё сидела=gI
s=\b(в)се ещ[её] сильней\b=\1сё ещё сильней=gI
s=\b(в)се ещ[её] слишком велика\b=\1сё ещё слишком велика=gI
s=\b(в)се ещ[её] слышны\b=\1сё ещё слышны=gI
s=\b(в)се ещ[её] сомневаетесь\b=\1сё ещё сомневаетесь=gI
s=\b(в)се ещ[её] сомневаясь\b=\1сё ещё сомневаясь=gI
s=\b(в)се ещ[её] сохранившиеся\b=\1сё ещё сохранившиеся=gI
s=\b(в)се ещ[её] спит\b=\1сё ещё спит=gI
s=\b(в)се ещ[её] способны\b=\1сё ещё способны=gI
s=\b(в)се ещ[её] стоишь\b=\1сё ещё стоИшь=gI
s=\b(в)се ещ[её] стонал\b=\1сё ещё стонал=gI
s=\b(в)се ещ[её] стоя\b=\1сё ещё стоя=gI
s=\b(в)се ещ[её] стоявшему\b=\1сё ещё стоявшему=gI
s=\b(в)се ещ[её] стояла\b=\1сё ещё стояла=gI
s=\b(в)се ещ[её] стоящий\b=\1сё ещё стоЯщий=gI
s=\b(в)се ещ[её] существует\b=\1сё ещё существует=gI
s=\b(в)се ещ[её] у\b=\1сё ещё у=gI
s=\b(в)се ещ[её] удивляясь\b=\1сё ещё удивляясь=gI
s=\b(в)се ещ[её] улыбаясь\b=\1сё ещё улыбаясь=gI
s=\b(в)се ещ[её] хотел\b=\1сё ещё хотел=gI
s=\b(в)се ещ[её] хочешь\b=\1сё ещё хочешь=gI
s=\b(в)се ещ[её] числились\b=\1сё ещё числились=gI
s=\b(в)се ещ[её] шатаються\b=\1сё ещё шатаються=gI
s=\b(в)се ещ[её] я\b=\1сё ещё я=gI
s=\b(в)се ж полегче\b=\1сё ж полегче=gI
s=\b(в)се ж сходите\b=\1сё ж сходИте=gI
s=\b(в)се ж таки\b=\1сё ж таки=gI
s=\b(в)се жарче и жарче\b=\1сё жарче и жарче=gI
s=\b(в)се жгли вручную\b=\1сё жгли вручную=gI
s=\b(в)се жд[её]т и жд[её]т\b=\1сё ждёт и ждёт=gI
s=\b(в)се же в чем\b=\1сё же в чем=gI
s=\b(в)се же взял\b=\1сё же взял=gI
s=\b(в)се же все\b=\1сё же все=gI
s=\b(в)се же вы здесь новое лицо\b=\1сё же вы здесь новое лицо=gI
s=\b(в)се же гиены\b=\1сё же гиены=gI
s=\b(в)се же делать то будем\b=\1сё же делать то будем=gI
s=\b(в)се же делать тоъ будем\b=\1сё же делать тоъ будем=gI
s=\b(в)се же засиделись\b=\1сё же засиделись=gI
s=\b(в)се же заставил\b=\1сё же заставил=gI
s=\b(в)се же засыпали\b=\1сё же засЫпали=gI
s=\b(в)се же зевать\b=\1сё же зевать=gI
s=\b(в)се же из своей руки\b=\1сё же из своей руки=gI
s=\b(в)се же лучше\b=\1сё же лучше=gI
s=\b(в)се же мешало\b=\1сё же мешало=gI
s=\b(в)се же могут быть\b=\1сё же могут быть=gI
s=\b(в)се же мы опять\b=\1сё же мы опять=gI
s=\b(в)се же натовский\b=\1сё же натовский=gI
s=\b(в)се же не было\b=\1сё же не было=gI
s=\b(в)се же не возвращаться\b=\1сё же не возвращаться=gI
s=\b(в)се же не выдержал\b=\1сё же не выдержал=gI
s=\b(в)се же не надо\b=\1сё же не надо=gI
s=\b(в)се же не такие\b=\1сё же не такие=gI
s=\b(в)се же немало\b=\1сё же немало=gI
s=\b(в)се же неслучайные\b=\1сё же неслучайные=gI
s=\b(в)се же номер\b=\1сё же номер=gI
s=\b(в)се же он решил\b=\1сё же он решил=gI
s=\b(в)се же они\b=\1сё же они=gI
s=\b(в)се же оставались\b=\1сё же оставались=gI
s=\b(в)се же остались\b=\1сё же остались=gI
s=\b(в)се же осторожности\b=\1сё же осторожности=gI
s=\b(в)се же попытаться\b=\1сё же попытаться=gI
s=\b(в)се же последовал\b=\1сё же последовал=gI
s=\b(в)се же потерпеть\b=\1сё же потерпеть=gI
s=\b(в)се же прин[её]с\b=\1сё же принёс=gI
s=\b(в)се же прогуляться\b=\1сё же прогуляться=gI
s=\b(в)се же с еды\b=\1сё же с еды=gI
s=\b(в)се же сам\b=\1сё же сам=gI
s=\b(в)се же сказал\b=\1сё же сказал=gI
s=\b(в)се же сломалась\b=\1сё же сломалась=gI
s=\b(в)се же старался\b=\1сё же старался=gI
s=\b(в)се же стоит\b=\1сё же стОит=gI
s=\b(в)се же такие\b=\1сё же такие=gI
s=\b(в)се же шестьдесят\b=\1сё же шестьдесят=gI
s=\b(в)се же я свами\b=\1сё же я с вами=gI
s=\b(в)се же я\b=\1сё же я=gI
s=\b(в)се же явыехал\b=\1сё же явыехал=gI
s=\b(в)се же!\b=\1сё же!=gI
s=\b(в)се же, вероятно\b=\1сё же, вероятно=gI
s=\b(в)се ж[её]стко закреплено\b=\1сё жёстко закреплено=gI
s=\b(в)се живо расскажет\b=\1сё живо расскажет=gI
s=\b(в)се живое в\b=\1сё живое в=gI
s=\b(в)се за деньгами гонишься\b=\1сё за деньгами гонишься=gI
s=\b(в)се за меня сделала\b=\1сё за меня сделала=gI
s=\b(в)се за мной гоняешься\b=\1сё за мной гоняешься=gI
s=\b(в)се за мой сч[её]т\b=\1сё за мой счёт=gI
s=\b(в)се за обе\b=\1сё за обе=gI
s=\b(в)се за оплату\b=\1сё за оплату=gI
s=\b(в)се за пиисят\b=\1сё за пиисят=gI
s=\b(в)се за полдня\b=\1сё за пол дня=gI
s=\b(в)се за собой\b=\1сё за собой=gI
s=\b(в)се за сч[её]т\b=\1сё за счёт=gI
s=\b(в)се за тебя делать должен\b=\1сё за тебя делать должен=gI
s=\b(в)се за тем же\b=\1сё за тем же=gI
s=\b(в)се за чистое\b=\1сё за чистое=gI
s=\b(в)се за чистую монету\b=\1сё за чистую монету=gI
s=\b(в)се за это говорит\b=\1сё за это говорит=gI
s=\b(в)се забер[её]те\.\b=\1сё заберёте\.=gI
s=\b(в)се забираю\.\b=\1сё забираю\.=gI
s=\b(в)се забухать собираемся\b=\1сё забухать собираемся=gI
s=\b(в)с[её] забыл\. Вернее, не все\b=\1сё забыл\. вернее, не всё=gI
s=\b(в)се зависит от\b=\1сё зависит от=gI
s=\b(в)се заводился и заводился\b=\1сё заводился и заводился=gI
s=\b(в)се завтра и завтра\b=\1сё завтра и завтра=gI
s=\b(в)се завтра перебираемся\b=\1сё завтра перебираемся=gI
s=\b(в)се завтра сказать\b=\1сё завтра сказать=gI
s=\b(в)се завтра,\b=\1сё завтра,=gI
s=\b(в)се завтра\.\b=\1сё завтра\.=gI
s=\b(в)се заглушили выстрелы\b=\1сё заглушили выстрелы=gI
s=\b(в)се задавят вокруг\.\b=\1сё задавят вокруг\.=gI
s=\b(в)се закончали на этом\b=\1сё закончали на этом=gI
s=\b(в)се заочно,\b=\1сё заочно,=gI
s=\b(в)се записывает\.\b=\1сё записывает\.=gI
s=\b(в)се запредельно дорого\b=\1сё запредельно дорого=gI
s=\b(в)се зараз и истопчете\b=\1сё зараз и истопчете=gI
s=\b(в)се заранее подстроено\b=\1сё заранее подстроено=gI
s=\b(в)се заранее прикинуть\b=\1сё заранее прикинуть=gI
s=\b(в)се заслонила горечь\b=\1сё заслонила горечь=gI
s=\b(в)се заср[её]т\.\b=\1сё засрёт\.=gI
s=\b(в)се зацепится,\b=\1сё зацепится,=gI
s=\b(в)се звенят и звенят\b=\1сё звенят и звенят=gI
s=\b(в)се здесь было\b=\1сё здесь было=gI
s=\b(в)се здесь делалось\b=\1сё здесь делалось=gI
s=\b(в)се здесь для не[её] было\b=\1сё здесь для неё было=gI
s=\b(в)се здесь должно\b=\1сё здесь должно=gI
s=\b(в)се здесь дышало\b=\1сё здесь дышало=gI
s=\b(в)се здесь казалось\b=\1сё здесь казалось=gI
s=\b(в)се здесь как то не так\b=\1сё здесь как то не так=gI
s=\b(в)се здесь как тоъ не так\b=\1сё здесь как тоъ не так=gI
s=\b(в)се здесь маленькое\b=\1сё здесь маленькое=gI
s=\b(в)се здесь мрачно\b=\1сё здесь мрачно=gI
s=\b(в)се здесь налажу\b=\1сё здесь налажу=gI
s=\b(в)се здесь написано\b=\1сё здесь написано=gI
s=\b(в)се здесь напоминало\b=\1сё здесь напоминало=gI
s=\b(в)се здесь настолько странно\b=\1сё здесь настолько странно=gI
s=\b(в)се здесь необычно\b=\1сё здесь необычно=gI
s=\b(в)се здесь непривычное\b=\1сё здесь непривычное=gI
s=\b(в)се здесь нравится\b=\1сё здесь нравится=gI
s=\b(в)се здесь осмотрю\b=\1сё здесь осмотрю=gI
s=\b(в)се здесь по кирпичику\b=\1сё здесь по кирпичику=gI
s=\b(в)се здесь пожечь\b=\1сё здесь пожечь=gI
s=\b(в)се здесь происходит\b=\1сё здесь происходит=gI
s=\b(в)се здесь происходящее\b=\1сё здесь происходящее=gI
s=\b(в)се здесь просто\b=\1сё здесь просто=gI
s=\b(в)се здесь проч[её]сывали\.\b=\1сё здесь прочёсывали\.=gI
s=\b(в)се здесь работает\b=\1сё здесь работает=gI
s=\b(в)се здесь сказанное\b=\1сё здесь сказанное=gI
s=\b(в)се здесь слегка порушить\b=\1сё здесь слегка порушить=gI
s=\b(в)се здесь спалят\b=\1сё здесь спалят=gI
s=\b(в)се здесь так\b=\1сё здесь так=gI
s=\b(в)се здесь узнаешь\b=\1сё здесь узнАешь=gI
s=\b(в)се здесь устроено\b=\1сё здесь устроено=gI
s=\b(в)се здорово было\b=\1сё здОрово было=gI
s=\b(в)се зерно,\b=\1сё зерно,=gI
s=\b(в)се злее и злее\b=\1сё злее и злее=gI
s=\b(в)се знаем\.\b=\1сё знаем\.=gI
s=\b(в)се значительно хуже,\b=\1сё значительно хуже,=gI
s=\b(в)се значительно хуже\.\b=\1сё значительно хуже\.=gI
s=\b(в)се значительно хуже\b=\1сё значительно хуже=gI
s=\b(в)се и без\b=\1сё и без=gI
s=\b(в)се и бросил\b=\1сё и бросил=gI
s=\b(в)се и будет\b=\1сё и будет=gI
s=\b(в)се и было\b=\1сё и было=gI
s=\b(в)се и в[её]з\.\b=\1сё и вёз\.=gI
s=\b(в)се и впрямь было\b=\1сё и впрямь было=gI
s=\b(в)се и впрямь кончилось\b=\1сё и впрямь кончилось=gI
s=\b(в)се и впрямь прошло\b=\1сё и впрямь прошло=gI
s=\b(в)се и всегда\b=\1сё и всегда=gI
s=\b(в)се и всем\b=\1сё и всем=gI
s=\b(в)се и всех\b=\1сё и всех=gI
s=\b(в)се и вся\b=\1сё и вся=gI
s=\b(в)се и выложил\b=\1сё и выложил=gI
s=\b(в)се и выявит\b=\1сё и выявит=gI
s=\b(в)се и выяснилось\b=\1сё и выяснилось=gI
s=\b(в)се и говорю\b=\1сё и говорю=gI
s=\b(в)се и даже больше\b=\1сё и даже больше=gI
s=\b(в)се и даже старые болячки\b=\1сё и даже старые болячки=gI
s=\b(в)се и делается\b=\1сё и делается=gI
s=\b(в)се и дело\b=\1сё и дело=gI
s=\b(в)се и должно\b=\1сё и должно=gI
s=\b(в)се и дошло\b=\1сё и дошло=gI
s=\b(в)се и забывается\b=\1сё и забывается=gI
s=\b(в)се и зависит\b=\1сё и зависит=gI
s=\b(в)се и заканчивается\b=\1сё и заканчивается=gI
s=\b(в)се и заканчивалось\b=\1сё и заканчивалось=gI
s=\b(в)се и закончилось\b=\1сё и закончилось=gI
s=\b(в)се и закончится\b=\1сё и закончится=gI
s=\b(в)се и закрутилось\b=\1сё и закрутилось=gI
s=\b(в)се и замяли\b=\1сё и замяли=gI
s=\b(в)се и засыпали\b=\1сё и засЫпали=gI
s=\b(в)се и затевалось\b=\1сё и затевалось=gI
s=\b(в)се и затеял\b=\1сё и затеял=gI
s=\b(в)се и кончилось\b=\1сё и кончилось=gI
s=\b(в)се и кончится\b=\1сё и кончится=gI
s=\b(в)се и наворочено\b=\1сё и наворочено=gI
s=\b(в)се и началось\b=\1сё и началось=gI
s=\b(в)се и начиналось\b=\1сё и начиналось=gI
s=\b(в)се и начн[её]тся\b=\1сё и начнётся=gI
s=\b(в)се и не пахнет\b=\1сё и не пахнет=gI
s=\b(в)се и объяснилось\b=\1сё и объяснилось=gI
s=\b(в)се и объясним\b=\1сё и объясним=gI
s=\b(в)се и объяснит\b=\1сё и объяснит=gI
s=\b(в)се и объяснишь\b=\1сё и объяснишь=gI
s=\b(в)се и ограничивалось\b=\1сё и ограничивалось=gI
s=\b(в)се и ограничилось\b=\1сё и ограничилось=gI
s=\b(в)се и ограничится\b=\1сё и ограничится=gI
s=\b(в)се и осталось\b=\1сё и осталось=gI
s=\b(в)се и отдал\b=\1сё и отдал=gI
s=\b(в)се и отходило\b=\1сё и отходило=gI
s=\b(в)се и пересчитать\b=\1сё и пересчитать=gI
s=\b(в)се и плохо\.\b=\1сё и плохо\.=gI
s=\b(в)се и поведала\b=\1сё и поведала=gI
s=\b(в)се и погрузим\b=\1сё и погрузим=gI
s=\b(в)се и подстроил\b=\1сё и подстроил=gI
s=\b(в)се и поинтересовался\b=\1сё и поинтересовался=gI
s=\b(в)се и помню\b=\1сё и помню=gI
s=\b(в)се и понял\b=\1сё и понял=gI
s=\b(в)се и посмотрите\b=\1сё и посмОтрите=gI
s=\b(в)се и пошло\b=\1сё и пошло=gI
s=\b(в)се и приволок\b=\1сё и приволок=gI
s=\b(в)се и придумал\b=\1сё и придумал=gI
s=\b(в)се и про все\b=\1сё и про всё=gI
s=\b(в)се и про всех\b=\1сё и про всех=gI
s=\b(в)се и пройд[её]т\b=\1сё и пройдёт=gI
s=\b(в)се и произойд[её]т\b=\1сё и произойдёт=gI
s=\b(в)се и произошло\b=\1сё и произошло=gI
s=\b(в)се и происходит\b=\1сё и происходит=gI
s=\b(в)се и развалилось\b=\1сё и развалилось=gI
s=\b(в)се и рассказывать\b=\1сё и рассказывать=gI
s=\b(в)се и расхл[её]бывает\b=\1сё и расхлёбывает=gI
s=\b(в)се и решим\b=\1сё и решим=gI
s=\b(в)се и решится\b=\1сё и решится=gI
s=\b(в)се и с подробностями\b=\1сё и с подробностями=gI
s=\b(в)се и сам увидел\b=\1сё и сам увидел=gI
s=\b(в)се и случилось\b=\1сё и случилось=gI
s=\b(в)се и спросят!\b=\1сё и спросят!=gI
s=\b(в)се и спустится\b=\1сё и спустится=gI
s=\b(в)се и сразу\.\b=\1сё и сразу\.=gI
s=\b(в)се и стало на свои места\b=\1сё и стало на свои местА=gI
s=\b(в)се и страшно\b=\1сё и страшно=gI
s=\b(в)се и так было\b=\1сё и так было=gI
s=\b(в)се и так обойд[её]тся\b=\1сё и так обойдётся=gI
s=\b(в)се и так очевидно\b=\1сё и так очевидно=gI
s=\b(в)се и так понятно\b=\1сё и так понятно=gI
s=\b(в)се и так стало\b=\1сё и так стало=gI
s=\b(в)се и так ясно\b=\1сё и так ясно=gI
s=\b(в)се и узнаем\b=\1сё и узнАем=gI
s=\b(в)се и узнаете\b=\1сё и узнАете=gI
s=\b(в)се и узнал\b=\1сё и узнал=gI
s=\b(в)се и узнала\b=\1сё и узнала=gI
s=\b(в)се и указано\b=\1сё и указано=gI
s=\b(в)се и уладили\b=\1сё и уладили=gI
s=\b(в)се и упад[её]т\b=\1сё и упадёт=gI
s=\b(в)се и установило\b=\1сё и установило=gI
s=\b(в)се и устроено\b=\1сё и устроено=gI
s=\b(в)се и устроим\b=\1сё и устроим=gI
s=\b(в)се ид[её]т к тому\b=\1сё идёт к томУ=gI
s=\b(в)се из всех\b=\1сё из всех=gI
s=\b(в)се из головы\b=\1сё из головЫ=gI
s=\b(в)се из дерева\b=\1сё из дерева=gI
s=\b(в)се из железа\b=\1сё из железа=gI
s=\b(в)се из за меня\b=\1сё из за меня=gI
s=\b(в)се из за огромного\b=\1сё из за огромного=gI
s=\b(В)се из за тебя!\b=\1сё из за тебя!=gI
s=\b(В)се из за тебя,\b=\1сё из за тебя,=gI
s=\b(в)се из за тех же\b=\1сё из за тех же=gI
s=\b(в)се из за того, что\b=\1сё из за того, что=gI
s=\b(в)се из за того\b=\1сё из за того=gI
s=\b(в)се из за\b=\1сё из за=gI
s=\b(в)се из него вытрясем\b=\1сё из него вытрясем=gI
s=\b(в)се из него вытрясти\b=\1сё из него вытрясти=gI
s=\b(в)се из него не вывезут\b=\1сё из него не вывезут=gI
s=\b(в)се из него приходилось\b=\1сё из него приходилось=gI
s=\b(в)се из не[её] вылетело\b=\1сё из неё вылетело=gI
s=\b(в)се из не[её] вытрясти\b=\1сё из неё вытрясти=gI
s=\b(в)се из области\b=\1сё из области=gI
s=\b(в)се из пал[её]вого\b=\1сё из палёвого=gI
s=\b(в)се из реш[её]тчатого\b=\1сё из решётчатого=gI
s=\b(в)се из рук\b=\1сё из рук=gI
s=\b(в)се из сарая девается\b=\1сё из сарая девается=gI
s=\b(в)се из стекла\b=\1сё из стекла=gI
s=\b(в)се из тех же набитых\b=\1сё из тех же набитых=gI
s=\b(в)се из тех же\b=\1сё из тех же=gI
s=\b(в)се из товара\.\b=\1сё из товара\.=gI
s=\b(в)се из того же\b=\1сё из того же=gI
s=\b(в)се из того, что\b=\1сё из того, что=gI
s=\b(в)се из торфа\.\b=\1сё из торфа\.=gI
s=\b(в)се изгваздали\.\b=\1сё изгваздали\.=gI
s=\b(в)се изодрать в клочки\b=\1сё изодрать в клочки=gI
s=\b(в)се или всерь[её]з\b=\1сё или всерьёз=gI
s=\b(в)се или даже чуть больше\b=\1сё или даже чуть больше=gI
s=\b(в)се или ничего\b=\1сё или ничего=gI
s=\b(в)се им мало\b=\1сё им мало=gI
s=\b(в)се им нипоч[её]м\b=\1сё им нипочём=gI
s=\b(в)се им рассказал\b=\1сё им рассказал=gI
s=\b(в)се им рассказать\b=\1сё им рассказать=gI
s=\b(в)се именно к тому и ид[её]т\b=\1сё именно к тому и идёт=gI
s=\b(в)се именно так и есть\b=\1сё именно так и есть=gI
s=\b(в)се именно так\b=\1сё именно так=gI
s=\b(в)се ими и кишит\b=\1сё ими и кишит=gI
s=\b(в)се интуитивно схватывается\b=\1сё интуитивно схватывается=gI
s=\b(в)се ирина,\b=\1сё Ирина,=gI
s=\b(в)се ириша\.\b=\1сё Ириша\.=gI
s=\b(в)се искал себе\b=\1сё искал себе=gI
s=\b(в)се исками отсудили\b=\1сё исками отсудили=gI
s=\b(в)се их анекдоты\b=\1сё их анекдоты=gI
s=\b(в)се их внимание\b=\1сё их внимание=gI
s=\b(в)се их войско\b=\1сё их войско=gI
s=\b(в)се их оборудование\b=\1сё их оборудование=gI
s=\b(в)се их племя\b=\1сё их племя=gI
s=\b(в)се их связывавшее\b=\1сё их связывавшее=gI
s=\b(в)се их снаряжение\b=\1сё их снаряжение=gI
s=\b(в)се к доброму человеку попал\b=\1сё к доброму человеку попал=gI
s=\b(в)се к дьяволу\.\b=\1сё к дьяволу\.=gI
s=\b(в)се к лицу\b=\1сё к лицу=gI
s=\b(в)се к лучшему\b=\1сё к лучшему=gI
s=\b(в)се к рукам\b=\1сё к рукам=gI
s=\b(в)се к сарнам рвался\b=\1сё к Сарнам рвался=gI
s=\b(в)се к тебе верн[её]тся\b=\1сё к тебе вернётся=gI
s=\b(в)се к тем же\b=\1сё к тем же=gI
s=\b(в)се к тому\b=\1сё к тому=gI
s=\b(в)се к чему\b=\1сё к чему=gI
s=\b(в)се к ч[её]ртовой матери\?\b=\1сё к чёртовой матери\?=gI
s=\b(в)се к черту полетело\b=\1сё к чёрту полетело=gI
s=\b(в)се к этому и ид[её]т\b=\1сё к этому и идёт=gI
s=\b(в)се казне прибыток\b=\1сё казне прибыток=gI
s=\b(в)се как будто пут[её]м\b=\1сё как будто путём=gI
s=\b(в)се как было\b=\1сё как было=gI
s=\b(в)се как в прежние\b=\1сё как в прежние=gI
s=\b(в)се как в прошлый\b=\1сё как в прошлый=gI
s=\b(в)се как в тумане\b=\1сё как в тумане=gI
s=\b(в)се как в\b=\1сё как в=gI
s=\b(в)се как везде,\b=\1сё как везде,=gI
s=\b(в)се как везде\.\b=\1сё как везде\.=gI
s=\b(в)се как во сне\b=\1сё как во сне=gI
s=\b(в)се как всегда\b=\1сё как всегда=gI
s=\b(в)се как вчера было\b=\1сё как вчера было=gI
s=\b(в)се как вы просили\b=\1сё как вы просили=gI
s=\b(в)се как дежурный\b=\1сё как дежурный=gI
s=\b(в)се как договорились\.\b=\1сё как договорились\.=gI
s=\b(в)се как должное\b=\1сё как должное=gI
s=\b(в)се как дома,\b=\1сё как дОма,=gI
s=\b(в)се как дома\b=\1сё как дОма=gI
s=\b(в)се как есть\b=\1сё как есть=gI
s=\b(в)се как заведено\b=\1сё как заведено=gI
s=\b(в)се как здесь\.\b=\1сё как здесь\.=gI
s=\b(в)се как и ожидалось\b=\1сё как и ожидалось=gI
s=\b(в)се как и описали\b=\1сё как и описали=gI
s=\b(в)се как и планировали\b=\1сё как и планировали=gI
s=\b(в)се как и положено\b=\1сё как и положено=gI
s=\b(в)се как и предполагалось\b=\1сё как и предполагалось=gI
s=\b(в)се как и раньше,\b=\1сё как и раньше,=gI
s=\b(в)се как когда то\b=\1сё как когда то=gI
s=\b(в)се как на духу\b=\1сё как на духу=gI
s=\b(в)се как на ладони\b=\1сё как на ладони=gI
s=\b(в)се как на\b=\1сё как на=gI
s=\b(в)се как надо\b=\1сё как надо=gI
s=\b(в)се как нельзя лучше складывалось\b=\1сё как нельзя лучше складывалось=gI
s=\b(в)се как нельзя\b=\1сё как нельзя=gI
s=\b(в)се как нибудь обойд[её]тся\b=\1сё как нибудь обойдётся=gI
s=\b(в)се как нибудь\b=\1сё как нибудь=gI
s=\b(в)се как нужно ид[её]т\b=\1сё как нужно идёт=gI
s=\b(в)се как об стенку\b=\1сё как об стенку=gI
s=\b(в)се как об стену\b=\1сё как об стену=gI
s=\b(в)се как обещал\b=\1сё как обещал=gI
s=\b(в)се как обычно\b=\1сё как обычно=gI
s=\b(в)се как по маслу\b=\1сё как по маслу=gI
s=\b(в)се как по учебнику\b=\1сё как по учебнику=gI
s=\b(в)се как полагается\b=\1сё как полагается=gI
s=\b(в)се как положенно\b=\1сё как положенно=gI
s=\b(в)се как положено\b=\1сё как положено=gI
s=\b(в)се как пошло\b=\1сё как пошлО=gI
s=\b(в)се как прежде\b=\1сё как прежде=gI
s=\b(в)се как при жизни\b=\1сё как при жизни=gI
s=\b(в)се как просто было\b=\1сё как просто было=gI
s=\b(в)се как раз выходило\b=\1сё как раз выходило=gI
s=\b(в)се как раз наоборот\b=\1сё как раз наоборот=gI
s=\b(в)се как раз очень логично\b=\1сё как раз очень логично=gI
s=\b(в)се как раз таки очень логично\b=\1сё как раз таки очень логично=gI
s=\b(в)се как раз только\b=\1сё как раз только=gI
s=\b(в)се как раньше\b=\1сё как раньше=gI
s=\b(в)се как рукой\b=\1сё как рукой=gI
s=\b(в)се как с гуся вода\b=\1сё как с гУся водА=gI
s=\b(в)се как следует обдумать\b=\1сё как следует обдумать=gI
s=\b(в)се как то в\b=\1сё как то в=gI
s=\b(в)се как то девяностые\b=\1сё как то девяностые=gI
s=\b(в)се как то значительно\b=\1сё как то значительно=gI
s=\b(в)се как то меняться\b=\1сё как то меняться=gI
s=\b(в)се как то не получалось\b=\1сё как то не получалось=gI
s=\b(в)се как то не\b=\1сё как то не=gI
s=\b(в)се как то недосуг\b=\1сё как то недосуг=gI
s=\b(в)се как то непут[её]во\b=\1сё как то непутёво=gI
s=\b(в)се как то образуется\b=\1сё как то образуется=gI
s=\b(в)се как то по другому\b=\1сё как то по другому=gI
s=\b(в)се как то руки не доходят\b=\1сё как то рУки не доходят=gI
s=\b(в)се как то само\b=\1сё как то само=gI
s=\b(в)се как то странно покачивается\b=\1сё как то странно покачивается=gI
s=\b(в)се как то уж\b=\1сё как то уж=gI
s=\b(в)се как то чересчур гладко\b=\1сё как то чересчур гладко=gI
s=\b(в)се как тогда,\b=\1сё как тогда,=gI
s=\b(в)се как тот\b=\1сё как тот=gI
s=\b(в)се как тоъ в\b=\1сё как тоъ в=gI
s=\b(в)се как тоъ девяностые\b=\1сё как тоъ девяностые=gI
s=\b(в)се как тоъ значительно\b=\1сё как тоъ значительно=gI
s=\b(в)се как тоъ меняться\b=\1сё как тоъ меняться=gI
s=\b(в)се как тоъ не получалось\b=\1сё как тоъ не получалось=gI
s=\b(в)се как тоъ не\b=\1сё как тоъ не=gI
s=\b(в)се как тоъ недосуг\b=\1сё как тоъ недосуг=gI
s=\b(в)се как тоъ непут[её]во\b=\1сё как тоъ непутёво=gI
s=\b(в)се как тоъ образуется\b=\1сё как тоъ образуется=gI
s=\b(в)се как тоъ по другому\b=\1сё как тоъ по другому=gI
s=\b(в)се как тоъ руки не доходят\b=\1сё как тоъ рУки не доходят=gI
s=\b(в)се как тоъ само\b=\1сё как тоъ само=gI
s=\b(в)се как тоъ странно покачивается\b=\1сё как тоъ странно покачивается=gI
s=\b(в)се как тоъ уж\b=\1сё как тоъ уж=gI
s=\b(в)се как тоъ чересчур гладко\b=\1сё как тоъ чересчур гладко=gI
s=\b(в)се как ты и хотел\b=\1сё как ты и хотел=gI
s=\b(в)се как у всех\b=\1сё как у всех=gI
s=\b(в)се как у людей\b=\1сё как у людей=gI
s=\b(в)се как у нас\b=\1сё как у нас=gI
s=\b(в)се как у\b=\1сё как у=gI
s=\b(в)се как условились\.\b=\1сё как условились\.=gI
s=\b(в)се как учили,\b=\1сё как учили,=gI
s=\b(в)се как я говорил\b=\1сё как я говорил=gI
s=\b(в)се как я и тогда\b=\1сё как я и тогда=gI
s=\b(в)се какая то польза\b=\1сё какая то польза=gI
s=\b(в)се какая тоъ польза\b=\1сё какая тоъ польза=gI
s=\b(в)се какие то байки\b=\1сё какие то байки=gI
s=\b(в)се какие то пустяки\b=\1сё какие то пустяки=gI
s=\b(в)се какие тоъ байки\b=\1сё какие тоъ байки=gI
s=\b(в)се какие тоъ пустяки\b=\1сё какие тоъ пустяки=gI
s=\b(в)се какое то\b=\1сё какое то=gI
s=\b(в)се какое тоъ\b=\1сё какое тоъ=gI
s=\b(в)се камерами просматривается\b=\1сё камерами просматривается=gI
s=\b(в)се капитально забетонировано\b=\1сё капитально забетонировано=gI
s=\b(в)се караулил е[её]\b=\1сё караулил её=gI
s=\b(в)се качал головой\b=\1сё качал головой=gI
s=\b(в)се кверху дном\b=\1сё кверху дном=gI
s=\b(в)се клады искал\b=\1сё клады искал=gI
s=\b(в)се книжки,\b=\1сё книжки,=gI
s=\b(в)се когда нибудь делается\b=\1сё когда нибудь делается=gI
s=\b(в)се когда нибудь заканчивается\b=\1сё когда нибудь заканчивается=gI
s=\b(в)се когда нибудь кончается\b=\1сё когда нибудь кончается=gI
s=\b(в)се когда нибудь происходит\b=\1сё когда нибудь происходит=gI
s=\b(в)се когда нибудь случается\b=\1сё когда нибудь случается=gI
s=\b(в)се когда то кончается\b=\1сё когда то кончается=gI
s=\b(в)се когда то случается\b=\1сё когда то случается=gI
s=\b(в)се когда то\b=\1сё когда то=gI
s=\b(в)се когда тоъ кончается\b=\1сё когда тоъ кончается=gI
s=\b(в)се когда тоъ случается\b=\1сё когда тоъ случается=gI
s=\b(в)се когда тоъ\b=\1сё когда тоъ=gI
s=\b(в)се кого нибудь зачистить\b=\1сё кого нибудь зачистить=gI
s=\b(в)се козни дьявола\b=\1сё козни дьявола=gI
s=\b(в)се компактно,\b=\1сё компактно,=gI
s=\b(в)се коротко и ясно\b=\1сё коротко и ясно=gI
s=\b(в)се коротко объяснить\b=\1сё коротко объяснить=gI
s=\b(в)се коту под хвост\b=\1сё коту под хвост=gI
s=\b(в)се крайне больших\b=\1сё крайне больших=gI
s=\b(в)се крайне запутано\b=\1сё крайне запутано=gI
s=\b(в)се красивее вокруг\b=\1сё красивее вокруг=gI
s=\b(в)се красиво вычертил\b=\1сё красиво вычертил=gI
s=\b(в)се красиво и нарядно\b=\1сё красиво и нарядно=gI
s=\b(в)се красиво и солидно\b=\1сё красиво и солидно=gI
s=\b(в)се красиво!\b=\1сё красиво!=gI
s=\b(в)се кровь сочилась\b=\1сё кровь сочилась=gI
s=\b(в)се кровью забрызгано\b=\1сё кровью забрызгано=gI
s=\b(в)се кроме губ\b=\1сё кроме губ=gI
s=\b(в)се кругом было\b=\1сё кругОм было=gI
s=\b(в)се кругом кустарником\b=\1сё кругОм кустарником=gI
s=\b(в)се кругом свели, кроме\b=\1сё кругОм свели, кроме=gI
s=\b(в)се крутилась и крутилась\b=\1сё крутилась и крутилась=gI
s=\b(в)се крутился метрах\b=\1сё крутился метрах=gI
s=\b(в)се куда как просто\b=\1сё куда как просто=gI
s=\b(в)се куда как\b=\1сё куда как=gI
s=\b(в)се куда лучше\.\b=\1сё куда лучше\.=gI
s=\b(в)се куда прозаичнее\b=\1сё куда прозаичнее=gI
s=\b(в)се куда проще\b=\1сё куда проще=gI
s=\b(в)се куда серь[её]знее\b=\1сё куда серьёзнее=gI
s=\b(в)се куда то засасывает\b=\1сё куда то засасывает=gI
s=\b(в)се куда то не туда\b=\1сё куда то не туда=gI
s=\b(в)се куда то поплыло\b=\1сё куда то поплыло=gI
s=\b(в)се куда тоъ засасывает\b=\1сё куда тоъ засасывает=gI
s=\b(в)се куда тоъ не туда\b=\1сё куда тоъ не туда=gI
s=\b(в)се куда тоъ поплыло\b=\1сё куда тоъ поплыло=gI
s=\b(в)се куда хуже\b=\1сё куда хуже=gI
s=\b(в)се лавэ спустишь\b=\1сё лавэ спустишь=gI
s=\b(в)се легко перебарывали\b=\1сё легко перебарывали=gI
s=\b(в)се лечение от\b=\1сё лечение от=gI
s=\b(в)се лечение пойд[её]т\b=\1сё лечение пойдёт=gI
s=\b(в)се лечит\.\b=\1сё лечит\.=gI
s=\b(в)се ли в ней\b=\1сё ли в ней=gI
s=\b(в)се ли в порядке\b=\1сё ли в порядке=gI
s=\b(в)се ли ваше\b=\1сё ли ваше=gI
s=\b(в)се ли взял\b=\1сё ли взял=gI
s=\b(в)се ли взяли\b=\1сё ли взяли=gI
s=\b(в)се ли готово\b=\1сё ли готово=gI
s=\b(в)се ли на месте\b=\1сё ли на месте=gI
s=\b(в)се ли нормально у нас\b=\1сё ли нормально у нас=gI
s=\b(в)се ли он\b=\1сё ли он=gI
s=\b(в)се ли они забрали\b=\1сё ли они забрали=gI
s=\b(в)се ли ровно\b=\1сё ли ровно=gI
s=\b(в)се ли снаряжение\b=\1сё ли снаряжение=gI
s=\b(В)с[её] ли согласны\b=Все ли согласны=gI
s=\b(в)се ли там\b=\1сё ли там=gI
s=\b(в)се ли тебе\b=\1сё ли тебе=gI
s=\b(в)се ли у вас в\b=\1сё ли у вас в=gI
s=\b(в)се ли у не[её] в\b=\1сё ли у неё в=gI
s=\b(в)се ли у них\b=\1сё ли у них=gI
s=\b(в)се ли у этих людей\b=\1сё ли у этих людей=gI
s=\b(в)се ли у этих\b=\1сё ли у этих=gI
s=\b(в)се ли чисто,\b=\1сё ли чисто,=gI
s=\b(в)се либо в\b=\1сё либо в=gI
s=\b(в)се лице земли\b=\1сё лице землИ=gI
s=\b(в)се лицо земли\b=\1сё лицо землИ=gI
s=\b(в)се лично,\b=\1сё лично,=gI
s=\b(в)се лишь ради\b=\1сё лишь ради=gI
s=\b(в)се лучше чем потери\b=\1сё лучше чем потери=gI
s=\b(в)се людьми кишит\b=\1сё людьми кишит=gI
s=\b(в)се людям рассказать\b=\1сё людям рассказать=gI
s=\b(в)се лясы точит\b=\1сё лясы точит=gI
s=\b(в)се максимально компактно связывали\b=\1сё максимально компактно связывали=gI
s=\b(в)се матери расскажу\b=\1сё матери расскажу=gI
s=\b(в)се машинально\.\b=\1сё машинально\.=gI
s=\b(в)се машинами вывозят\b=\1сё машинами вывозят=gI
s=\b(в)се мгновенно\.\b=\1сё мгновенно\.=gI
s=\b(в)се медленней и медленней\b=\1сё медленней и медленней=gI
s=\b(в)се между нами\b=\1сё между нами=gI
s=\b(в)се меньше и меньше\b=\1сё меньше и меньше=gI
s=\b(в)се меньше и\b=\1сё меньше и=gI
s=\b(в)се меняем,\b=\1сё меняем,=gI
s=\b(в)се миллион раз изучено\b=\1сё миллион раз изучено=gI
s=\b(в)се мимо глядит\b=\1сё мимо глядит=gI
s=\b(в)се мимо\.\b=\1сё мимо\.=gI
s=\b(в)се мирно и чинно\b=\1сё мирно и чинно=gI
s=\b(в)се мирно начиналось\b=\1сё мирно начиналось=gI
s=\b(в)се мне говорил\b=\1сё мне говорил=gI
s=\b(в)се мне доложите\b=\1сё мне долОжите=gI
s=\b(в)се мне испортили\b=\1сё мне испортили=gI
s=\b(в)се мне казалось\b=\1сё мне казалось=gI
s=\b(в)се мне нипоч[её]м\?\b=\1сё мне нипочём\?=gI
s=\b(в)се мне позволительно\b=\1сё мне позволительно=gI
s=\b(в)се мне разобъяснил\b=\1сё мне разобъяснил=gI
s=\b(в)се мне расскажешь\b=\1сё мне расскажешь=gI
s=\b(в)се мне рассказал\b=\1сё мне рассказал=gI
s=\b(в)се мне рассказать\b=\1сё мне рассказать=gI
s=\b(в)се мне сказали\b=\1сё мне сказали=gI
s=\b(в)се мне стало ясно\b=\1сё мне стало ясно=gI
s=\b(в)се мне там понравилось\b=\1сё мне там понравилось=gI
s=\b(в)се мог предвидеть\b=\1сё мог предвидеть=gI
s=\b(в)се мог!\b=\1сё мог!=gI
s=\b(в)се могло измениться\b=\1сё могло изменИться=gI
s=\b(в)се могло испортиться\b=\1сё могло испортиться=gI
s=\b(в)се могут наши\b=\1сё могут наши=gI
s=\b(в)се могучее тело\b=\1сё могучее тело=gI
s=\b(в)се может быть\b=\1сё может быть=gI
s=\b(в)се может измениться\b=\1сё может изменИться=gI
s=\b(в)се может начаться\b=\1сё может начаться=gI
s=\b(в)се может резко\b=\1сё может резко=gI
s=\b(в)се молниеносно происходит\b=\1сё молниеносно происходит=gI
s=\b(в)се молчит\.\b=\1сё молчит\.=gI
s=\b(в)се море\.\b=\1сё море\.=gI
s=\b(в)се морем\.\b=\1сё морем\.=gI
s=\b(в)се мыть и\b=\1сё мыть и=gI
s=\b(в)се на автомате происходит\b=\1сё на автомате происходит=gI
s=\b(в)се на авторитетах\b=\1сё на авторитетах=gI
s=\b(в)се на бегу, все скорее\b=\1сё на бегУ, всё скорее=gI
s=\b(в)се на бегу,\b=\1сё на бегу,=gI
s=\b(в)се на бумаге\b=\1сё на бумаге=gI
s=\b(в)се на ветер\b=\1сё на ветер=gI
s=\b(в)се на виду\b=\1сё на видУ=gI
s=\b(в)се на глазах\b=\1сё на глазах=gI
s=\b(в)се на горбу прид[её]тся\b=\1сё на горбу придётся=gI
s=\b(в)се на двух языках\b=\1сё на двух языках=gI
s=\b(в)се на деньги меряешь\b=\1сё на деньги меряешь=gI
s=\b(в)се на договорной\b=\1сё на договорной=gI
s=\b(в)се на дорогу выглядывает\b=\1сё на дорогу выглядывает=gI
s=\b(в)се на его жену,\b=\1сё на его жену,=gI
s=\b(в)се на завтра\b=\1сё на завтра=gI
s=\b(в)се на земле вышло\b=\1сё на Земле вышло=gI
s=\b(в)се на кулаках развести\b=\1сё на кулаках развести=gI
s=\b(в)се на ламе было хорошо\b=\1сё на Ламе было хорошо=gI
s=\b(в)се на лету\b=\1сё на летУ=gI
s=\b(в)се на лице\b=\1сё на лице=gI
s=\b(в)се на мази\b=\1сё на мазИ=gI
s=\b(в)се на меня спихнуть\b=\1сё на меня спихнуть=gI
s=\b(в)се на месте!\b=\1сё на месте!=gI
s=\b(в)се на место\b=\1сё на место=gI
s=\b(в)се на морде\b=\1сё на морде=gI
s=\b(в)се на него косилась\b=\1сё на него косилась=gI
s=\b(в)се на нуле\b=\1сё на нуле=gI
s=\b(в)се на основе\b=\1сё на основе=gI
s=\b(в)се на острове утихомиривается\b=\1сё на острове утихомиривается=gI
s=\b(в)се на память знаешь\b=\1сё на память знаешь=gI
s=\b(в)се на поверхности\b=\1сё на поверхности=gI
s=\b(в)се на полу\.\b=\1сё на полу\.=gI
s=\b(в)се на последний день\b=\1сё на последний день=gI
s=\b(в)се на почву\b=\1сё на почву=gI
s=\b(в)се на революционном чуть[её]\b=\1сё на революционном чутьё=gI
s=\b(в)се на самом деле было\b=\1сё на самом деле было=gI
s=\b(в)се на самом деле\b=\1сё на самом деле=gI
s=\b(в)се на самот[её]к\b=\1сё на самотёк=gI
s=\b(в)се на свете забудете\b=\1сё на свете забудете=gI
s=\b(в)се на свете забыла\b=\1сё на свете забыла=gI
s=\b(в)се на свете можно\b=\1сё на свете можно=gI
s=\b(в)се на свете укротили\b=\1сё на свете укротили=gI
s=\b(в)се на свете\.\b=\1сё на свете\.=gI
s=\b(в)се на свете\b=\1сё на свете=gI
s=\b(в)се на сво[её]м пути\b=\1сё на своём пути=gI
s=\b(в)се на сво[её]м\b=\1сё на своём=gI
s=\b(в)се на свои места\b=\1сё на свои места=gI
s=\b(в)се на своих\b=\1сё на своих=gI
s=\b(в)се на себе переть\b=\1сё на себе переть=gI
s=\b(в)се на себе\b=\1сё на себе=gI
s=\b(в)се на себя\b=\1сё на себя=gI
s=\b(в)се на сегодня,\b=\1сё на сегодня,=gI
s=\b(в)се на складах\b=\1сё на складах=gI
s=\b(в)се на случайное\b=\1сё на случайное=gI
s=\b(в)се на столе сожрал\b=\1сё на столе сожрал=gI
s=\b(в)се на столько серь[её]зно\b=\1сё на столько серьёзно=gI
s=\b(в)се на столько\b=\1сё на столько=gI
s=\b(в)се на таких, как я\b=\1сё на таких, как я=gI
s=\b(в)се на те же деньги\b=\1сё на те же деньги=gI
s=\b(в)се на тебя ложится\b=\1сё на тебя ложится=gI
s=\b(в)се на то же\b=\1сё на то же=gI
s=\b(в)се на той же\b=\1сё на той же=gI
s=\b(в)се на толпу глядел\b=\1сё на толпу глядел=gI
s=\b(в)се на том же лифте\b=\1сё на том же лифте=gI
s=\b(в)се на том же\b=\1сё на том же=gI
s=\b(в)се на уши\b=\1сё на уши=gI
s=\b(в)се на фотоэлементах\b=\1сё на фотоэлементах=gI
s=\b(в)се на чистоту\b=\1сё на чистоту=gI
s=\b(в)се на что то\b=\1сё на что то=gI
s=\b(в)се на что тоъ\b=\1сё на что тоъ=gI
s=\b(в)се на это смахивает\b=\1сё на это смахивает=gI
s=\b(в)се набивал и набивал\b=\1сё набивал и набивал=gI
s=\b(в)се наверняка по дружбе\b=\1сё наверняка по дружбе=gI
s=\b(в)се наверху смолкло\b=\1сё наверху смолкло=gI
s=\b(в)се нагишом норовишь\b=\1сё нагишом норовишь=gI
s=\b(в)се наглухо перегорожено\b=\1сё наглухо перегорожено=gI
s=\b(в)се над тем же\b=\1сё над тем же=gI
s=\b(в)се над[её]жно присыпано\b=\1сё надёжно присыпано=gI
s=\b(в)се надо относить на\b=\1сё надо относить на=gI
s=\b(в)се наивысшего качества\b=\1сё наивысшего качества=gI
s=\b(в)се наконец закончилось\b=\1сё наконец закончилось=gI
s=\b(в)се наконец то прошло\b=\1сё наконец то прошло=gI
s=\b(в)се наконец тоъ прошло\b=\1сё наконец тоъ прошло=gI
s=\b(в)се нам вывалил\b=\1сё нам вывалил=gI
s=\b(в)се нам известное\b=\1сё нам известное=gI
s=\b(в)се нам объяснить\.\b=\1сё нам объяснить\.=gI
s=\b(в)се нам по плечу\b=\1сё нам по плечу=gI
s=\b(в)се нам поменьше\b=\1сё нам поменьше=gI
s=\b(в)се нам расскажут\b=\1сё нам расскажут=gI
s=\b(в)се нам сами\b=\1сё нам сами=gI
s=\b(в)се нами контролируется\b=\1сё нами контролируется=gI
s=\b(в)се намного страшней\b=\1сё намного страшней=gI
s=\b(в)се напрочь забудет\b=\1сё напрочь забудет=gI
s=\b(в)се напрямик\.\b=\1сё напрямик\.=gI
s=\b(в)се наряды меняет\b=\1сё наряды меняет=gI
s=\b(в)се насквозь видать\b=\1сё насквозь видать=gI
s=\b(в)се насквозь знакомое\b=\1сё насквозь знакомое=gI
s=\b(в)се насквозь продувалось\b=\1сё насквозь продувалось=gI
s=\b(в)се насквозь промокнет\b=\1сё насквозь промокнет=gI
s=\b(в)се настойчивее зовут\b=\1сё настойчивее зовут=gI
s=\b(в)се настойчивее и настойчивее\b=\1сё настойчивее и настойчивее=gI
s=\b(в)се настойчивей\.\b=\1сё настойчивей\.=gI
s=\b(в)се наудачу\.\b=\1сё наудачу\.=gI
s=\b(в)се научился делать\b=\1сё научился делать=gI
s=\b(в)се нахрен\.\b=\1сё нахрен\.=gI
s=\b(в)се начало налаживаться\b=\1сё нАчало налаживаться=gI
s=\b(в)се начинаем сначала\b=\1сё начинаем сначала=gI
s=\b(в)се начинал сначала\b=\1сё начинал сначала=gI
s=\b(в)се начинать с начала\b=\1сё начинать с начала=gI
s=\b(в)се начн[её]м заново\b=\1сё начнём заново=gI
s=\b(в)се наша работа\b=\1сё наша работа=gI
s=\b(в)се наше оружие\b=\1сё наше оружие=gI
s=\b(в)се наше предприятие\b=\1сё наше предприятие=gI
s=\b(в)се не беда\b=\1сё не беда=gI
s=\b(в)се не бросил\b=\1сё не бросил=gI
s=\b(в)се не будет\b=\1сё не будет=gI
s=\b(в)се не было\b=\1сё не было=gI
s=\b(в)се не важно\b=\1сё не важно=gI
s=\b(в)се не верил\b=\1сё не верил=gI
s=\b(в)се не верит\b=\1сё не верит=gI
s=\b(в)се не верите мне\b=\1сё не верите мне=gI
s=\b(в)се не верится\b=\1сё не верится=gI
s=\b(в)се не взаправду\b=\1сё не взаправду=gI
s=\b(в)се не вовремя\.\b=\1сё не вовремя\.=gI
s=\b(в)се не возвращался\b=\1сё не возвращался=gI
s=\b(в)се не возвращаются\b=\1сё не возвращаются=gI
s=\b(в)се не все\b=\1сё не всё=gI
s=\b(в)се не всерь[её]з и все мимол[её]тно\b=\1сё не всерьёз и всё мимолётно=gI
s=\b(в)се не всерь[её]з\b=\1сё не всерьёз=gI
s=\b(в)се не выведутся\b=\1сё не выведутся=gI
s=\b(в)се не вывезем\b=\1сё не вывезем=gI
s=\b(в)се не выезжали\.\b=\1сё не выезжали\.=gI
s=\b(в)се не выходил\b=\1сё не выходил=gI
s=\b(в)се не выходила\b=\1сё не выходила=gI
s=\b(в)се не главное\b=\1сё не главное=gI
s=\b(в)се не давал\b=\1сё не давал=gI
s=\b(в)се не двудулка\b=\1сё не двудулка=gI
s=\b(в)се не делать\b=\1сё не делать=gI
s=\b(в)се не до них было\b=\1сё не до них было=gI
s=\b(в)се не доходила\b=\1сё не доходила=gI
s=\b(в)се не желал\b=\1сё не желал=gI
s=\b(в)се не забудут,\b=\1сё не забудут,=gI
s=\b(в)се не закончится\b=\1сё не закончится=gI
s=\b(в)се не заходил\b=\1сё не заходил=gI
s=\b(в)се не звучали\b=\1сё не звучали=gI
s=\b(в)се не ид[её]т\b=\1сё не идёт=gI
s=\b(в)се не ид[её]шь\b=\1сё не идёшь=gI
s=\b(в)се не идущей\b=\1сё не идущей=gI
s=\b(в)се не избавлюсь\b=\1сё не избавлюсь=gI
s=\b(в)се не испортил\b=\1сё не испортил=gI
s=\b(в)се не как у\b=\1сё не как у=gI
s=\b(в)се не камера\b=\1сё не камера=gI
s=\b(в)се не кончается\b=\1сё не кончается=gI
s=\b(в)се не кончалась\b=\1сё не кончалась=gI
s=\b(в)се не кончался\b=\1сё не кончался=gI
s=\b(в)се не кончится\b=\1сё не кончится=gI
s=\b(в)се не ладится\b=\1сё не ладится=gI
s=\b(в)се не менялся\b=\1сё не менялся=gI
s=\b(в)се не мог определить\b=\1сё не мог определить=gI
s=\b(в)се не мог понять\b=\1сё не мог понять=gI
s=\b(в)се не мог прийти\b=\1сё не мог прийти=gI
s=\b(в)се не мог решиться\b=\1сё не мог решиться=gI
s=\b(в)се не мог\b=\1сё не мог=gI
s=\b(в)се не могла успокоиться\b=\1сё не могла успокоиться=gI
s=\b(в)се не могла\b=\1сё не могла=gI
s=\b(в)се не может успокоиться\b=\1сё не может успокоиться=gI
s=\b(в)се не надо\b=\1сё не надо=gI
s=\b(в)се не надоест\b=\1сё не надоест=gI
s=\b(в)се не наедине с собой\b=\1сё не наедине с собой=gI
s=\b(в)се не напрасно\b=\1сё не напрасно=gI
s=\b(в)се не ново\b=\1сё не ново=gI
s=\b(в)се не нравится\b=\1сё не нравится=gI
s=\b(в)се не о том,\b=\1сё не о том,=gI
s=\b(в)се не образуется\b=\1сё не образуется=gI
s=\b(в)се не отводил,\b=\1сё не отводил,=gI
s=\b(в)се не отводила\b=\1сё не отводила=gI
s=\b(в)се не отпускал\b=\1сё не отпускал=gI
s=\b(в)се не отрывая взгляд\b=\1сё не отрывая взгляд=gI
s=\b(в)се не отстаю\b=\1сё не отстаю=gI
s=\b(в)се не очень\.\b=\1сё не очень\.=gI
s=\b(в)се не падает\b=\1сё не падает=gI
s=\b(в)се не падала\b=\1сё не падала=gI
s=\b(в)се не первой\b=\1сё не первой=gI
s=\b(в)се не пересмотрит\b=\1сё не пересмотрит=gI
s=\b(в)се не переста[её]т\b=\1сё не перестаёт=gI
s=\b(в)се не пешком\b=\1сё не пешком=gI
s=\b(в)се не по делу\b=\1сё не по делу=gI
s=\b(в)се не поднималось\b=\1сё не поднималось=gI
s=\b(в)се не пойм[её]шь\b=\1сё не поймёшь=gI
s=\b(в)се не пойму\b=\1сё не пойму=gI
s=\b(в)се не показывалась\b=\1сё не показывалась=gI
s=\b(в)се не показывалось\b=\1сё не показывалось=gI
s=\b(в)се не получалось\b=\1сё не получалось=gI
s=\b(в)се не попадался\b=\1сё не попадался=gI
s=\b(в)се не попортил\b=\1сё не попортил=gI
s=\b(в)се не появлялись\.\b=\1сё не появлялись\.=gI
s=\b(в)се не появлялся\b=\1сё не появлялся=gI
s=\b(в)се не предусмотришь\b=\1сё не предусмотришь=gI
s=\b(в)се не привыкну\b=\1сё не привыкну=gI
s=\b(в)се не приходил\b=\1сё не приходил=gI
s=\b(в)се не проверим\b=\1сё не проверим=gI
s=\b(в)се не просто так, а\b=\1сё не просто так, а=gI
s=\b(в)се не прояснится\b=\1сё не прояснится=gI
s=\b(в)се не разнес[её]т\b=\1сё не разнесёт=gI
s=\b(в)се не расскажешь\b=\1сё не расскажешь=gI
s=\b(в)се не рассказал\b=\1сё не рассказал=gI
s=\b(в)се не рассос[её]тся\b=\1сё не рассосётся=gI
s=\b(в)се не рвалась\b=\1сё не рвалась=gI
s=\b(в)се не решался\b=\1сё не решался=gI
s=\b(в)се не решилось\b=\1сё не решилось=gI
s=\b(в)се не рухнуло\b=\1сё не рухнуло=gI
s=\b(в)се не садилось\b=\1сё не садилось=gI
s=\b(в)се не свершится\b=\1сё не свершится=gI
s=\b(в)се не сводил\b=\1сё не сводил=gI
s=\b(в)се не свои ноги\b=\1сё не свои нОги=gI
s=\b(в)се не скажет\b=\1сё не скажет=gI
s=\b(в)се не слава богу\b=\1сё не слава богу=gI
s=\b(в)се не случайно\b=\1сё не случайно=gI
s=\b(в)се не совсем так\b=\1сё не совсем так=gI
s=\b(в)се не сожж[её]т\b=\1сё не сожжёт=gI
s=\b(в)се не сожрали\b=\1сё не сожрали=gI
s=\b(в)се не спешила\b=\1сё не спешила=gI
s=\b(в)се не столь быстро ид[её]т\b=\1сё не столь быстро идёт=gI
s=\b(в)се не столь трагичным\b=\1сё не столь трагичным=gI
s=\b(в)се не стрелял\b=\1сё не стрелял=gI
s=\b(в)се не съедим,\b=\1сё не съедим,=gI
s=\b(в)се не так внезапно\b=\1сё не так внезапно=gI
s=\b(в)се не так плохо\b=\1сё не так плохо=gI
s=\b(в)се не так просто\b=\1сё не так просто=gI
s=\b(в)се не так страшно\b=\1сё не так страшно=gI
s=\b(в)се не так то просто\b=\1сё не так то просто=gI
s=\b(в)се не так тоъ просто\b=\1сё не так тоъ просто=gI
s=\b(в)се не так\b=\1сё не так=gI
s=\b(в)се не такое\b=\1сё не такое=gI
s=\b(в)се не то\b=\1сё не то=gI
s=\b(в)се не только отменного\b=\1сё не только отменного=gI
s=\b(в)се не убавляется\b=\1сё не убавляется=gI
s=\b(в)се не убывает\b=\1сё не убывает=gI
s=\b(в)се не удавалось\b=\1сё не удавалось=gI
s=\b(в)се не уезжал\b=\1сё не уезжал=gI
s=\b(в)се не узнаю\b=\1сё не узнАю=gI
s=\b(в)се не умолкали\b=\1сё не умолкали=gI
s=\b(в)се не унести\b=\1сё не унести=gI
s=\b(в)се не уплету\b=\1сё не уплету=gI
s=\b(в)се не успокоится\b=\1сё не успокоится=gI
s=\b(в)се не успокоятся\.\b=\1сё не успокоятся\.=gI
s=\b(в)се не установим\b=\1сё не установим=gI
s=\b(в)се не утряс[её]тся\b=\1сё не утрясётся=gI
s=\b(в)се не уходил\b=\1сё не уходил=gI
s=\b(в)се не ш[её]л\b=\1сё не шёл=gI
s=\b(в)се не шла\b=\1сё не шла=gI
s=\b(в)се неаккуратно,\b=\1сё неаккуратно,=gI
s=\b(в)се незнакомое,\b=\1сё незнакомое,=gI
s=\b(в)се неизменно возвращается\b=\1сё неизменно возвращается=gI
s=\b(в)се неимоверно дорого\.\b=\1сё неимоверно дорого\.=gI
s=\b(в)се немедленно\.\b=\1сё немедленно\.=gI
s=\b(в)се немного изменилось\b=\1сё немного изменилось=gI
s=\b(в)се немного чужое\b=\1сё немного чужое=gI
s=\b(в)се немцам урон\b=\1сё немцам урон=gI
s=\b(в)се необходимое\.\b=\1сё необходимое\.=gI
s=\b(в)се неплохо прода[её]тся\b=\1сё неплохо продаётся=gI
s=\b(в)се неплохо сложится\b=\1сё неплохо сложится=gI
s=\b(в)се непременно будет\b=\1сё непременно будет=gI
s=\b(в)се непривычно было\b=\1сё непривычно было=gI
s=\b(в)се непривычно\.\b=\1сё непривычно\.=gI
s=\b(в)се непут[её]во рвал\b=\1сё непутёво рвал=gI
s=\b(в)се несколько по другому\b=\1сё несколько по другому=gI
s=\b(в)се неслись и неслись\b=\1сё неслись и неслись=gI
s=\b(в)се неуловимо изменилось\b=\1сё неуловимо изменилось=gI
s=\b(в)се ни закончилось\b=\1сё ни закончилось=gI
s=\b(в)се ни как\b=\1сё ни как=gI
s=\b(в)се ни поч[её]м\b=\1сё ни почём=gI
s=\b(в)се ниже и ниже\b=\1сё ниже и ниже=gI
s=\b(в)се никак не мог\b=\1сё никак не мог=gI
s=\b(в)се никак не могли\b=\1сё никак не могли=gI
s=\b(в)се никак не могу\b=\1сё никак не могу=gI
s=\b(в)се никак не могут\b=\1сё никак не могут=gI
s=\b(в)се никак не пойму\b=\1сё никак не пойму=gI
s=\b(в)се никому не покорились\b=\1сё никому не покорились=gI
s=\b(в)се новенькое,\b=\1сё новенькое,=gI
s=\b(в)се новую и новую\b=\1сё новую и новую=gI
s=\b(в)се новые и новые камни\b=\1сё новые и новые камни=gI
s=\b(в)се новые и новые\b=\1сё новые и новые=gI
s=\b(в)се новые формы\b=\1сё новые формы=gI
s=\b(в)се новых и\b=\1сё новых и=gI
s=\b(в)се нормально получилось\b=\1сё нормально получилось=gI
s=\b(в)се норовят подойти поближе\b=\1сё норовят подойти поближе=gI
s=\b(в)се носить на\b=\1сё носить на=gI
s=\b(в)се о вас думал\b=\1сё о вас думал=gI
s=\b(в)се о других узнать\b=\1сё о других узнать=gI
s=\b(в)се о кей\b=\1сё окей=gI
s=\b(в)се о нас,\b=\1сё о нас,=gI
s=\b(в)се о ней рассказать\b=\1сё о ней рассказать=gI
s=\b(в)се о роботах\b=\1сё о роботах=gI
s=\b(в)се о сво[её]м задании\b=\1сё о своём задании=gI
s=\b(в)се о себе\b=\1сё о себе=gI
s=\b(в)се о тебе рассказать\b=\1сё о тебе рассказать=gI
s=\b(в)се о том\b=\1сё о том=gI
s=\b(в)се о чем\b=\1сё о чём=gI
s=\b(в)се об их\b=\1сё об их=gI
s=\b(в)се об одном и том\b=\1сё об одном и том=gI
s=\b(в)се об основных\b=\1сё об основных=gI
s=\b(в)се обижаетесь, что\b=\1сё обижаетесь, что=gI
s=\b(в)се обман,\b=\1сё обман,=gI
s=\b(в)се обман\.\b=\1сё обман\.=gI
s=\b(в)се обо всем\.\b=\1сё обо всём\.=gI
s=\b(в)се обо всех\b=\1сё обо всех=gI
s=\b(в)се обо мне вам расскажет\b=\1сё обо мне вам расскажет=gI
s=\b(в)се обо мне\b=\1сё обо мне=gI
s=\b(в)се обратно,\b=\1сё обратно,=gI
s=\b(в)се обрушили\.\b=\1сё обрушили\.=gI
s=\b(в)се обсудив,\b=\1сё обсудив,=gI
s=\b(в)се обыскали,\b=\1сё обыскали,=gI
s=\b(в)се обычно выходит\b=\1сё обычно выходит=gI
s=\b(в)се обычно,\b=\1сё обычно,=gI
s=\b(в)се одни лишь\b=\1сё одни лишь=gI
s=\b(в)се одно закончатся\b=\1сё одно закончатся=gI
s=\b(в)се одно и то же\b=\1сё одно и то же=gI
s=\b(в)се одно не жить\b=\1сё одно не жить=gI
s=\b(в)се одно толку\b=\1сё одно тОлку=gI
s=\b(в)се одновременно\.\b=\1сё одновременно\.=gI
s=\b(в)се озеро внезапно\b=\1сё озеро внезапно=gI
s=\b(в)се оказывается просто\b=\1сё оказывается просто=gI
s=\b(в)се окончательно встало\b=\1сё окончательно встало=gI
s=\b(в)се окончательно определилось\b=\1сё окончательно определилось=gI
s=\b(в)се окончательно прояснилось\b=\1сё окончательно прояснилось=gI
s=\b(в)се окончательно\.\b=\1сё окончательно\.=gI
s=\b(в)се она не\b=\1сё она не=gI
s=\b(в)се она позволит\b=\1сё она позволит=gI
s=\b(в)се они замечают\.\b=\1сё они замечают\.=gI
s=\b(в)се оно едино\b=\1сё оно едино=gI
s=\b(в)се определяет царица\b=\1сё определяет Царица=gI
s=\b(в)се определяют деньги\b=\1сё определяют деньги=gI
s=\b(в)се опять поплыло\b=\1сё опять поплыло=gI
s=\b(в)се опять свелось\b=\1сё опять свелось=gI
s=\b(в)се опять таки зависит\b=\1сё опять таки зависит=gI
s=\b(в)се оружие на месте\b=\1сё оружие на месте=gI
s=\b(в)се оставшееся мужество\b=\1сё оставшееся мужество=gI
s=\b(в)се от бога\b=\1сё от Бога=gI
s=\b(в)се от колечек\b=\1сё от колечек=gI
s=\b(в)се от количества\b=\1сё от количества=gI
s=\b(в)се от меня зависящее\b=\1сё от меня зависящее=gI
s=\b(в)се от накопившейся\b=\1сё от накопившейся=gI
s=\b(в)се от нас зависящее\b=\1сё от нас зависящее=gI
s=\b(в)се от него зависящее\b=\1сё от него зависящее=gI
s=\b(в)се от него узнаем!\b=\1сё от него узнаем!=gI
s=\b(в)се от не[её] зависящее\b=\1сё от неё зависящее=gI
s=\b(в)се от нервов\b=\1сё от нервов=gI
s=\b(в)се от них зависящее\b=\1сё от них зависящее=gI
s=\b(в)се от того,\b=\1сё от того,=gI
s=\b(в)се от хороших\b=\1сё от хороших=gI
s=\b(в)се от человека зависело\b=\1сё от человека зависело=gI
s=\b(в)се отбой\.\b=\1сё отбой\.=gI
s=\b(в)се отдавали за\b=\1сё отдавали за=gI
s=\b(в)се отда[её]т какойто\b=\1сё отдаёт какойто=gI
s=\b(в)се отлично видно\b=\1сё отлично видно=gI
s=\b(в)се отлично знает\b=\1сё отлично знает=gI
s=\b(в)се отлично знал\b=\1сё отлично знал=gI
s=\b(в)се отлично,\b=\1сё отлично,=gI
s=\b(в)се отлично\.\b=\1сё отлично\.=gI
s=\b(в)се относительно до\b=\1сё относительно до=gI
s=\b(в)се отрабатываем сегодня\b=\1сё отрабатываем сегодня=gI
s=\b(в)се отрицали,\b=\1сё отрицали,=gI
s=\b(в)се оттуда радостно вынесет\b=\1сё оттуда радостно вынесет=gI
s=\b(в)се отч[её]тливее виднелись\b=\1сё отчётливее виднелись=gI
s=\b(в)се отч[её]тливее слышалась\b=\1сё отчётливее слышалась=gI
s=\b(в)се охотно рассказывал\b=\1сё охотно рассказывал=gI
s=\b(в)се очень аккуратно\b=\1сё очень аккуратно=gI
s=\b(в)се очень банально\b=\1сё очень банально=gI
s=\b(в)се очень вкусно\b=\1сё очень вкусно=gI
s=\b(в)се очень вкусное\b=\1сё очень вкусное=gI
s=\b(в)се очень возбуждало\b=\1сё очень возбуждало=gI
s=\b(в)се очень даже ухожено\b=\1сё очень даже ухожено=gI
s=\b(в)се очень дорого\b=\1сё очень дорого=gI
s=\b(в)се очень запутанно\b=\1сё очень запутанно=gI
s=\b(в)се очень и очень сложно\b=\1сё очень и очень сложно=gI
s=\b(в)се очень изменчиво\b=\1сё очень изменчиво=gI
s=\b(в)се очень интересно\b=\1сё очень интересно=gI
s=\b(в)се очень красиво\b=\1сё очень красиво=gI
s=\b(в)се очень логично\b=\1сё очень логично=gI
s=\b(в)се очень не просто\b=\1сё очень не просто=gI
s=\b(в)се очень непонятно\b=\1сё очень непонятно=gI
s=\b(в)се очень непросто\b=\1сё очень непросто=gI
s=\b(в)се очень очень разумно\b=\1сё очень очень разумно=gI
s=\b(В)се очень плохо,\b=\1сё очень плохо,=gI
s=\b(в)се очень плохо\.\b=\1сё очень плохо\.=gI
s=\b(в)се очень подробно\b=\1сё очень подробно=gI
s=\b(в)се очень политизировано\b=\1сё очень политизировано=gI
s=\b(в)се очень походило\b=\1сё очень походило=gI
s=\b(в)се очень правильно\b=\1сё очень правильно=gI
s=\b(в)се очень просто\b=\1сё очень просто=gI
s=\b(в)се очень секретно\b=\1сё очень секретно=gI
s=\b(в)се очень серь[её]зно\b=\1сё очень серьёзно=gI
s=\b(в)се очень сильно потемнело\b=\1сё очень сильно потемнело=gI
s=\b(в)се очень скрытно и секретно\b=\1сё очень скрытно и секретно=gI
s=\b(в)се очень сладкое\b=\1сё очень сладкое=gI
s=\b(в)се очень сложно\.\b=\1сё очень сложно\.=gI
s=\b(в)се очень старое\b=\1сё очень старое=gI
s=\b(в)се очень торжественно\b=\1сё очень торжественно=gI
s=\b(в)се очень точно\b=\1сё очень точно=gI
s=\b(в)се очень удачно\b=\1сё очень удачно=gI
s=\b(в)се очень уютно\b=\1сё очень уютно=gI
s=\b(в)се очень хорошо\b=\1сё очень хорошо=gI
s=\b(в)се очень человеческое\b=\1сё очень человеческое=gI
s=\b(в)се очень ч[её]тко помнит\b=\1сё очень чётко помнит=gI
s=\b(в)се очко развальцует\b=\1сё очко развальцует=gI
s=\b(в)се падали и падали\b=\1сё падали и падали=gI
s=\b(в)се парни, пойд[её]м\b=\1сё парни, пойдём=gI
s=\b(в)се парням объяснял\b=\1сё парням объяснял=gI
s=\b(в)се первым узнаю\b=\1сё первым узнаю=gI
s=\b(в)се перевернули\.\b=\1сё перевернули\.=gI
s=\b(в)се перед выходом сда[её]тся\b=\1сё перед выходом сдаётся=gI
s=\b(в)се передали мне\b=\1сё передали мне=gI
s=\b(в)се перекопали,\b=\1сё перекопали,=gI
s=\b(в)се пересказал\.\b=\1сё пересказал\.=gI
s=\b(в)се пернатое население\b=\1сё пернатое население=gI
s=\b(в)се пешком пройти\b=\1сё пешком пройти=gI
s=\b(в)се пишешь,\b=\1сё пишешь,=gI
s=\b(в)се пишите,\b=\1сё пишите,=gI
s=\b(в)се плавно перетекало\b=\1сё плавно перетекало=gI
s=\b(в)се планирую сделать\b=\1сё планирую сделать=gI
s=\b(в)се плечо у не[её]\b=\1сё плечо у неё=gI
s=\b(в)се плодились и плодились\b=\1сё плодились и плодились=gI
s=\b(в)се плоско\.\b=\1сё плоско\.=gI
s=\b(в)се по английски\b=\1сё по английски=gI
s=\b(в)се по барабану\b=\1сё по барабану=gI
s=\b(в)се по большей\b=\1сё по большей=gI
s=\b(в)се по графам\b=\1сё по графАм=gI
s=\b(в)се по делу\b=\1сё по делу=gI
s=\b(в)се по другому выглядит\b=\1сё по другому выглядит=gI
s=\b(в)се по другому,\b=\1сё по другому,=gI
s=\b(в)се по другому\.\b=\1сё по другому\.=gI
s=\b(в)се по другому\b=\1сё по другому=gI
s=\b(в)се по дружески\b=\1сё по дружески=gI
s=\b(В)с[её] по его примеру\b=Все по его примеру=gI
s=\b(в)се по закону\b=\1сё по закону=gI
s=\b(в)се по интеллигентному\b=\1сё по интеллигентному=gI
s=\b(в)се по карманам распихают\b=\1сё по карманам распихают=gI
s=\b(в)се по крышам да чердакам\b=\1сё по крышам да чердакам=gI
s=\b(в)се по настоящему\b=\1сё по настоящему=gI
s=\b(в)се по обычаям\b=\1сё по обычаям=gI
s=\b(в)се по отдельности\b=\1сё по отдельности=gI
s=\b(в)се по плану\b=\1сё по плану=gI
s=\b(в)се по плечу\b=\1сё по плечу=gI
s=\b(в)се по полочкам\b=\1сё по полочкам=gI
s=\b(в)се по порядку\b=\1сё по порядку=gI
s=\b(в)се по правде\b=\1сё по правде=gI
s=\b(в)се по правилам\b=\1сё по правилам=gI
s=\b(в)се по прежнему\b=\1сё по прежнему=gI
s=\b(в)се по собственной\b=\1сё по собственной=gI
s=\b(в)се по совести\b=\1сё по совести=gI
s=\b(в)се по советски\.\b=\1сё по советски\.=gI
s=\b(в)се по спартански,\b=\1сё по спартански,=gI
s=\b(в)се по старому\b=\1сё по старому=gI
s=\b(в)се по твоему\b=\1сё по твоему=gI
s=\b(в)се по тому же\b=\1сё по тому же=gI
s=\b(в)се по фигу\b=\1сё по фигу=gI
s=\b(в)се по хрен\b=\1сё похрен=gI
s=\b(в)се по хрену\b=\1сё похрену=gI
s=\b(в)се по человечески\b=\1сё по человечески=gI
s=\b(в)се по честному\.\b=\1сё по честному\.=gI
s=\b(в)се по честному\b=\1сё по честному=gI
s=\b(в)се повесили на меня\b=\1сё повесили на меня=gI
s=\b(в)се повесят на меня\b=\1сё повесят на меня=gI
s=\b(в)се поворачивала голову\b=\1сё поворачивала голову=gI
s=\b(в)се под контролем\b=\1сё под контролем=gI
s=\b(в)се под охрану\b=\1сё под охрану=gI
s=\b(в)се под рукой\b=\1сё под рукой=gI
s=\b(в)се под себя\b=\1сё под себя=gI
s=\b(в)се под тот же\b=\1сё под тот же=gI
s=\b(в)се подберу, пригодится\b=\1сё подберу, пригодится=gI
s=\b(в)се поделено\.\b=\1сё поделено\.=gI
s=\b(в)се подо>бное\b=\1сё подобное=gI
s=\b(в)се подогнали,\b=\1сё подогнали,=gI
s=\b(в)се подруга\.\b=\1сё подруга\.=gI
s=\b(в)се подряд в\b=\1сё подряд в=gI
s=\b(в)се подряд,\b=\1сё подряд,=gI
s=\b(в)се подряд\.\b=\1сё подряд\.=gI
s=\b(в)се поешь\?\b=\1сё поёшь\?=gI
s=\b(в)се позволяет видеть\b=\1сё позволяет видеть=gI
s=\b(в)се позой демонстрируя\b=\1сё позой демонстрируя=gI
s=\b(в)се пойм[её]те в процессе\b=\1сё поймёте в процессе=gI
s=\b(в)се пойм[её]те позже\b=\1сё поймёте позже=gI
s=\b(в)се пойм[её]те\.\b=\1сё поймёте\.=gI
s=\b(в)се пока было\b=\1сё пока было=gI
s=\b(в)се пока запутано\b=\1сё пока запутано=gI
s=\b(в)се пока хорошо\b=\1сё пока хорошо=gI
s=\b(в)се пока шло\b=\1сё пока шло=gI
s=\b(в)се пока!\b=\1сё пока!=gI
s=\b(в)се покажем и расскажем\b=\1сё покажем и расскажем=gI
s=\b(в)се показывали\.\b=\1сё показывали\.=gI
s=\b(в)се покуда\.\b=\1сё покуда\.=gI
s=\b(в)се полежит\.\b=\1сё полежит\.=gI
s=\b(в)се полезно,\b=\1сё полезно,=gI
s=\b(в)се полностью захирело\b=\1сё полностью захирело=gI
s=\b(в)се положенное\.\b=\1сё положенное\.=gI
s=\b(в)се полосатое,\b=\1сё полосатое,=gI
s=\b(в)се полосатое\.\b=\1сё полосатое\.=gI
s=\b(в)се получено,\b=\1сё получено,=gI
s=\b(в)се поначалу казалось\b=\1сё поначалу казалось=gI
s=\b(в)се понимали с\b=\1сё понимали с=gI
s=\b(в)се понимают\.\b=\1сё понимают\.=gI
s=\b(В)се поняли, шеф\b=Всё поняли, шеф=gI
s=\b(в)се поняли\.\b=\1сё поняли\.=gI
s=\b(в)се поняли\?\b=\1сё поняли\?=gI
s=\b(в)се попроще было\b=\1сё попроще было=gI
s=\b(в)се пора спать\b=\1сё пора спать=gI
s=\b(в)се поскорее закончилось\b=\1сё поскорее закончилось=gI
s=\b(в)се после той,\b=\1сё после той,=gI
s=\b(в)се посмотрите\.\b=\1сё посмОтрите\.=gI
s=\b(в)се посмотрю, все запомню\b=\1сё посмотрю, всё запомню=gI
s=\b(в)се поставила нас вои места\b=\1сё поставила нас вои местА=gI
s=\b(в)се поставили на\b=\1сё поставили на=gI
s=\b(в)се постепенно рутиной\b=\1сё постепенно рутиной=gI
s=\b(в)се постоянно все\b=все постоянно всё=gI
s=\b(в)се постоянно пребывало\b=\1сё постоянно пребывало=gI
s=\b(в)се потеплее\.\b=\1сё потеплее\.=gI
s=\b(в)се потихоньку начн[её]т\b=\1сё потихоньку начнёт=gI
s=\b(в)се потом катится\b=\1сё потом катится=gI
s=\b(в)се похоже\.\b=\1сё похоже\.=gI
s=\b(в)се почти готово\b=Всё почти готово=gI
s=\b(в)се почти кончено\b=\1сё почти кончено=gI
s=\b(в)се почти нормально,\b=\1сё почти нормально,=gI
s=\b(в)се почти понимал\b=\1сё почти понимал=gI
s=\b(в)се почти так же\b=\1сё почти так же=gI
s=\b(в)се пошло не так\b=\1сё пошлО не так=gI
s=\b(в)се правдоподобно было\.\b=\1сё правдоподобно было\.=gI
s=\b(в)се правое крыло\b=\1сё правое крыло=gI
s=\b(в)се превосходно выглядит\b=\1сё превосходно выглядит=gI
s=\b(в)се предельно ясно\b=\1сё предельно ясно=gI
s=\b(в)се представление портишь\b=\1сё представление портишь=gI
s=\b(в)се прекрасно -\b=\1сё прекрасно -=gI
s=\b(в)се прекрасно вижу\b=\1сё прекрасно вижу=gI
s=\b(в)се прекрасно знаю\b=\1сё прекрасно знаю=gI
s=\b(в)се прекрасно понимали\b=\1сё прекрасно понимали=gI
s=\b(в)се прекрасно понял\b=\1сё прекрасно понял=gI
s=\b(в)се прекрасно,\b=\1сё прекрасно,=gI
s=\b(в)се прекрасно\.\b=\1сё прекрасно\.=gI
s=\b(в)се при нас, сэр\b=\1сё при нас, сэр=gI
s=\b(в)се при ней\b=\1сё при ней=gI
s=\b(в)се при н[её]м\b=\1сё при нём=gI
s=\b(в)се при себе\b=\1сё при себе=gI
s=\b(в)се прибывали и прибывали\b=\1сё прибывали и прибывали=gI
s=\b(в)се придумает сам\b=\1сё придумает сам=gI
s=\b(в)се приключение занимает\b=\1сё приключение занимает=gI
s=\b(в)се приколы строишь\b=\1сё приколы строишь=gI
s=\b(в)се прилегающее пространство\b=\1сё прилегающее пространство=gI
s=\b(в)се принесли сюда\b=\1сё принесли сюда=gI
s=\b(в)се приняли за\b=\1сё приняли за=gI
s=\b(в)се пристреляно,\b=\1сё пристреляно,=gI
s=\b(в)се про вас написано\b=\1сё про вас написано=gI
s=\b(в)се про все\b=все про всё=gI
s=\b(в)с[её] про все\b=\1сё про всё=gI
s=\b(в)се про всех знаешь\b=\1сё про всех знаешь=gI
s=\b(в)се про всех\b=\1сё про всех=gI
s=\b(в)се про дела\b=\1сё про делА=gI
s=\b(в)се про нас знать\b=\1сё про нас знать=gI
s=\b(в)се проверяя положение\b=\1сё проверяя положение=gI
s=\b(в)се провести без\b=\1сё провести без=gI
s=\b(в)се провести скрытно\b=\1сё провести скрытно=gI
s=\b(в)се проговорили за ночь\b=\1сё проговорили за ночь=gI
s=\b(в)се просматривать\?\b=\1сё просматривать\?=gI
s=\b(в)се просматриваться будет\b=\1сё просматриваться будет=gI
s=\b(в)се простенько,\b=\1сё простенько,=gI
s=\b(в)се просто -\b=\1сё просто -=gI
s=\b(в)се просто взорвалось\b=\1сё просто взорвалось=gI
s=\b(в)се просто замечательно\b=\1сё просто замечательно=gI
s=\b(в)се просто и банально\b=\1сё просто и банально=gI
s=\b(в)се просто и доходчиво\b=\1сё просто и доходчиво=gI
s=\b(в)се просто и логично\b=\1сё просто и логично=gI
s=\b(в)се просто и\b=\1сё просто и=gI
s=\b(в)се просто обязано\b=\1сё просто обязано=gI
s=\b(в)се просто отлично\.\b=\1сё просто отлично\.=gI
s=\b(в)се просто повторяется\b=\1сё просто повторяется=gI
s=\b(в)се просто терялось\b=\1сё просто терялось=gI
s=\b(в)се просто!\b=\1сё просто!=gI
s=\b(в)се просто\.\b=\1сё просто\.=gI
s=\b(в)се просто:\b=\1сё просто:=gI
s=\b(в)се простое, как\b=\1сё простое, как=gI
s=\b(в)се просчитали и подготовили\b=\1сё просчитали и подготовили=gI
s=\b(в)се прочно и основательно\b=\1сё прочно и основательно=gI
s=\b(в)се прочно\?\b=\1сё прочно\?=gI
s=\b(в)се прошло тихо\b=\1сё прошло тихо=gI
s=\b(в)се прямо наоборот\b=\1сё прямо наоборот=gI
s=\b(в)се псу под\b=\1сё псу под=gI
s=\b(в)се равно находитесь\b=\1сё равно нахОдитесь=gI
s=\b(в)се равно узнаешь\b=\1сё равно узнАешь=gI
s=\b(в)се равно узнаю\b=\1сё равно узнАю=gI
s=\b(в)се равно узнают\b=\1сё равно узнают=gI
s=\b(в)се размышляли о том\b=\1сё размышляли о том=gI
s=\b(в)се разнесли\.\b=\1сё разнесли\.=gI
s=\b(в)се разобрали,\b=\1сё разобрали,=gI
s=\b(в)се разом отдам\b=\1сё разом отдам=gI
s=\b(в)се разом поль[её]тся\b=\1сё разом польётся=gI
s=\b(в)се разрешение выпрашивал\b=\1сё разрешение выпрашивал=gI
s=\b(в)се разрешилось бы\b=\1сё разрешилось бы=gI
s=\b(в)се разрулил\.\b=\1сё разрулил\.=gI
s=\b(в)се разузнают\.\b=\1сё разузнают\.=gI
s=\b(в)се рано или\b=\1сё рано или=gI
s=\b(в)се раньше и раньше\b=\1сё раньше и раньше=gI
s=\b(в)се раньше\.\b=\1сё раньше\.=gI
s=\b(в)се расскажем\.\b=\1сё расскажем\.=gI
s=\b(в)с[её] рассказали\? все\.\b=\1сё рассказали\? всё\.=gI
s=\b(в)се рассказали\?\b=\1сё рассказали\?=gI
s=\b(в)се рассчитали\.\b=\1сё рассчитали\.=gI
s=\b(в)се рассчитали\?\b=\1сё рассчитали\?=gI
s=\b(в)се растут и растут\b=\1сё растут и растут=gI
s=\b(в)се растущие заказы\b=\1сё растущие заказы=gI
s=\b(в)се реально,\b=\1сё реально,=gI
s=\b(в)се реально\.\b=\1сё реально\.=gI
s=\b(в)се ребятки, я\b=\1сё ребятки, я=gI
s=\b(в)се реже и реже\b=\1сё реже и реже=gI
s=\b(в)се резво занюхал\b=\1сё резво занюхал=gI
s=\b(в)се резко изменилось\b=\1сё резко изменилось=gI
s=\b(в)се резко измениться\b=\1сё резко измЕниться=gI
s=\b(в)се резко ускорилось\b=\1сё резко ускорилось=gI
s=\b(в)се результат именно\b=\1сё результат именно=gI
s=\b(в)се решали доли\b=\1сё решали доли=gI
s=\b(в)се решали кулаки\b=\1сё решали кулаки=gI
s=\b(в)се решали мгновения\b=\1сё решали мгновения=gI
s=\b(в)се решали минуты\b=\1сё решали минуты=gI
s=\b(в)се решали ноги\b=\1сё решали ноги=gI
s=\b(в)се решали секунды\b=\1сё решали секунды=gI
s=\b(в)се решают деньги\b=\1сё решают деньги=gI
s=\b(в)се решают обычные тренировки\b=\1сё решают обычные тренировки=gI
s=\b(в)се решают\.\b=\1сё решают\.=gI
s=\b(в)се решили заранее\b=\1сё решили заранее=gI
s=\b(в)се розово лиловое\b=\1сё розово лиловое=gI
s=\b(в)се руками\.\b=\1сё руками\.=gI
s=\b(в)се руки к\b=\1сё рУки к=gI
s=\b(в)се руки не доходят\b=\1сё рУки не доходят=gI
s=\b(в)се руководство компании находилось\b=\1сё руководство компании находилось=gI
s=\b(в)се с большим изумлением\b=\1сё с большим изумлением=gI
s=\b(в)се с большим удивлением\b=\1сё с большим удивлением=gI
s=\b(в)се с большими процентами\b=\1сё с большими процентами=gI
s=\b(в)се с вами ясно\b=\1сё с вами ясно=gI
s=\b(в)се с вами\b=\1сё с вами=gI
s=\b(в)се с дудочкой ходил\b=\1сё с дудочкой ходил=gI
s=\b(в)се с искупителем кончилось\b=\1сё с искупителем кончилось=gI
s=\b(в)се с кем то говорил\b=\1сё с кем то говорил=gI
s=\b(в)се с кем тоъ говорил\b=\1сё с кем тоъ говорил=gI
s=\b(в)се с мальчиком было\b=\1сё с мальчиком было=gI
s=\b(в)се с места\b=\1сё с мЕста=gI
s=\b(в)се с начала\.\b=\1сё с начала\.=gI
s=\b(в)се с начала\b=\1сё с начАла=gI
s=\b(в)се с ней было\b=\1сё с ней было=gI
s=\b(в)се с ней в порядке\b=\1сё с ней в порядке=gI
s=\b(в)се с ним происходит\b=\1сё с ним происходит=gI
s=\b(в)се с ним хорошо будет\b=\1сё с ним хорошо будет=gI
s=\b(в)се с ними произошедшее\b=\1сё с ними произошедшее=gI
s=\b(в)се с ног на голову\b=\1сё с ног на голову=gI
s=\b(в)се с нуля\b=\1сё с нуля=gI
s=\b(в)се с планшетом корячусь\b=\1сё с планшетом корячусь=gI
s=\b(в)се с полного ноля\b=\1сё с полного ноля=gI
s=\b(в)се с полу\b=\1сё с пОлу=gI
s=\b(в)се с полуслова\b=\1сё с полуслОва=gI
s=\b(в)се с пользой\b=\1сё с пользой=gI
s=\b(в)се с работой\b=\1сё с работой=gI
s=\b(в)се с рук\b=\1сё с рук=gI
s=\b(в)се с самого начала\b=\1сё с сАмого начАла=gI
s=\b(в)се с самомнением\b=\1сё с самомнением=gI
s=\b(в)се с себя\b=\1сё с себя=gI
s=\b(в)се с собой\b=\1сё с собой=gI
s=\b(в)се с таким же\b=\1сё с таким же=gI
s=\b(в)се с тем же\b=\1сё с тем же=gI
s=\b(в)се с теми же\b=\1сё с теми же=gI
s=\b(в)се с тобой будет\b=\1сё с тобой будет=gI
s=\b(в)се с тобой было\b=\1сё с тобой было=gI
s=\b(в)се с тобой плохо\b=\1сё с тобой плохо=gI
s=\b(в)се с тобой понятно\b=\1сё с тобой понятно=gI
s=\b(в)се с той же\b=\1сё с той же=gI
s=\b(в)се с той стороны тащит\b=\1сё с той сторонЫ тащит=gI
s=\b(в)се сало истаяло\b=\1сё сало истаяло=gI
s=\b(в)се сам порывался\b=\1сё сам порывался=gI
s=\b(в)се сам прекрасно\b=\1сё сам прекрасно=gI
s=\b(в)се сами видели\b=\1сё сами видели=gI
s=\b(в)се сами вспомнили\b=\1сё сами вспомнили=gI
s=\b(в)се сами до\b=\1сё сами до=gI
s=\b(в)се сами понимаете\b=\1сё сами понимаете=gI
s=\b(в)се сами!\b=\1сё сами!=gI
s=\b(в)се сами, от жадности,\b=\1сё сами, от жадности,=gI
s=\b(в)се сами…\b=\1сё сами…=gI
s=\b(в)се сами\.\b=\1сё сами\.=gI
s=\b(в)се самое совершенное\b=\1сё сАмое совершЕнное=gI
s=\b(в)се самое ценное\b=\1сё самое ценное=gI
s=\b(в)се сверкать будет\b=\1сё сверкать будет=gI
s=\b(в)се сверху затянуто\b=\1сё сверху затянуто=gI
s=\b(в)се свести к шутке\b=\1сё свести к шутке=gI
s=\b(в)се светлым светло\b=\1сё светлым светло=gI
s=\b(в)се сво[её] вокруг\b=\1сё своё вокруг=gI
s=\b(в)се сво[её] имущество\b=\1сё своё имущество=gI
s=\b(в)се сво[её] ношу\b=\1сё своё ношУ=gI
s=\b(в)се сво[её]\.\b=\1сё своё\.=gI
s=\b(в)се свой смысл\b=\1сё свой смысл=gI
s=\b(в)се своими именами\b=\1сё своими именами=gI
s=\b(в)се свою теорию\b=\1сё свою теорию=gI
s=\b(в)се сгрузили на\b=\1сё сгрузили на=gI
s=\b(в)се сдать разом\b=\1сё сдать разом=gI
s=\b(в)се сделаете ровно\b=\1сё сделаете ровно=gI
s=\b(в)се сделаешь правильно\b=\1сё сделаешь правильно=gI
s=\b(в)се сделал правильно\b=\1сё сделал правильно=gI
s=\b(в)се сделала правильно\b=\1сё сделала правильно=gI
s=\b(в)се сделали за вас\b=\1сё сделали за вас=gI
s=\b(в)се сделали\?\b=\1сё сделали\?=gI
s=\b(в)се сделают сами\b=\1сё сделают сами=gI
s=\b(в)се сделают\.\b=\1сё сделают\.=gI
s=\b(в)се сейчас будет\b=\1сё сейчас будет=gI
s=\b(в)се сейчас было\b=\1сё сейчас было=gI
s=\b(в)се сейчас глупо\b=\1сё сейчас глупо=gI
s=\b(в)се сейчас зависело\b=\1сё сейчас зависело=gI
s=\b(в)се сейчас не в сч[её]т\b=\1сё сейчас не в счёт=gI
s=\b(в)се сейчас объясню\b=\1сё сейчас объясню=gI
s=\b(в)се сейчас оказалось\b=\1сё сейчас оказалось=gI
s=\b(в)се сейчас покажу\b=\1сё сейчас покажу=gI
s=\b(в)се сейчас сказанное\b=\1сё сейчас сказанное=gI
s=\b(в)се сейчас упирается\b=\1сё сейчас упирается=gI
s=\b(в)се сейчас\.\b=\1сё сейчас\.=gI
s=\b(в)се серь[её]зней некуда\b=\1сё серьёзней некуда=gI
s=\b(в)се серь[её]зно будет\b=\1сё серьёзно будет=gI
s=\b(в)се серь[её]зно,\b=\1сё серьёзно,=gI
s=\b(в)се серь[её]зно\.\b=\1сё серьёзно\.=gI
s=\b(в)се сильно упрощено\b=\1сё сильно упрощено=gI
s=\b(в)се сказала\?\b=\1сё сказала\?=gI
s=\b(в)се сказали,\b=\1сё сказали,=gI
s=\b(в)се сказочно,\b=\1сё сказочно,=gI
s=\b(в)се складно\.\b=\1сё складно\.=gI
s=\b(в)се скоро закончится\b=\1сё скоро закончится=gI
s=\b(в)се слабее и слабее\b=\1сё слабее и слабее=gI
s=\b(в)се слава богу\b=\1сё слава богу=gI
s=\b(в)се слегка маловато\b=\1сё слегка маловато=gI
s=\b(в)се слегка поуспокоилось\b=\1сё слегка поуспокоилось=gI
s=\b(в)се слишком быстро происходило\b=\1сё слишком быстро происходило=gI
s=\b(в)се слишком просто\b=\1сё слишком просто=gI
s=\b(в)се слишком тесно связано\b=\1сё слишком тесно связано=gI
s=\b(в)се слишком хаотично\b=\1сё слишком хаотично=gI
s=\b(в)се слишком яркое\b=\1сё слишком яркое=gI
s=\b(в)се словно бы подразумевалось\b=\1сё словно бы подразумевалось=gI
s=\b(в)се словно в замедленный\b=\1сё словно в замедленный=gI
s=\b(в)се словно загорелось\b=\1сё словно загорелось=gI
s=\b(в)се словно переворачивалось\b=\1сё словно переворачивалось=gI
s=\b(в)се случая подходящего не найд[её]т\b=\1сё случая подходящего не найдёт=gI
s=\b(в)се смелее,\b=\1сё смелее,=gI
s=\b(в)се сможем изменить\b=\1сё сможем изменить=gI
s=\b(в)се смысл утратило\b=\1сё смысл утратило=gI
s=\b(в)се снабжение и\b=\1сё снабжение и=gI
s=\b(в)се снегом закидано\b=\1сё снегом закидано=gI
s=\b(в)се снегом засыпано\b=\1сё снегом засыпано=gI
s=\b(в)се снова будет\b=\1сё снова будет=gI
s=\b(в)се снова вернулось\b=\1сё снова вернулось=gI
s=\b(в)се снова затихло\b=\1сё снова затихло=gI
s=\b(в)се снова и снова\b=\1сё снова и снова=gI
s=\b(в)се снова превращается\b=\1сё снова превращается=gI
s=\b(в)се снова прид[её]тся\b=\1сё снова придётся=gI
s=\b(в)се снова сменилось\b=\1сё снова сменилось=gI
s=\b(в)се снова успокоилось\b=\1сё снова успокоилось=gI
s=\b(в)се сносили сюда\b=\1сё сносили сюда=gI
s=\b(в)се со мной хорошо\b=\1сё со мной хорошо=gI
s=\b(в)се со стола\b=\1сё со стола=gI
s=\b(в)се совершенно законно\b=\1сё совершенно законно=gI
s=\b(в)се совершенно замечательно\b=\1сё совершенно замечательно=gI
s=\b(в)се совершенно изменилось\b=\1сё совершенно изменилось=gI
s=\b(в)се совершенно точно\b=\1сё совершенно точно=gI
s=\b(в)се совершенно честно\b=\1сё совершенно честно=gI
s=\b(в)се совершенные им\b=\1сё совершённые им=gI
s=\b(в)се совсем кисло\b=\1сё совсем кисло=gI
s=\b(в)се совсем не так\b=\1сё совсем не так=gI
s=\b(в)се совсем по другому\b=\1сё совсем по другому=gI
s=\b(в)се совсем просто\b=\1сё совсем просто=gI
s=\b(в)се сожрали\?\b=\1сё сожрали\?=gI
s=\b(в)се сообщение прервано\b=\1сё сообщение прервано=gI
s=\b(В)с[её] спешили на выручку\b=Все спешили на выручку=gI
s=\b(в)се списали на\b=\1сё списали на=gI
s=\b(в)се сплошь в карманах\b=\1сё сплошь в карманах=gI
s=\b(в)се сплошь спецоперации\.\b=\1сё сплошь спецоперации\.=gI
s=\b(в)се сплошь старинных\b=\1сё сплошь старинных=gI
s=\b(в)се спорно,\b=\1сё спорно=gI
s=\b(в)се спустили на тормозах\b=\1сё спустили на тормозах=gI
s=\b(в)се сражение впереди\b=\1сё сражение впереди=gI
s=\b(в)се сразу вспомнил\b=\1сё сразу вспомнил=gI
s=\b(в)се сразу встанет\b=\1сё сразу встанет=gI
s=\b(в)се сразу же встало\b=\1сё сразу же встало=gI
s=\b(в)се сразу же разъяснил\b=\1сё сразу же разъяснил=gI
s=\b(в)се сразу заглохло\b=\1сё сразу заглохло=gI
s=\b(в)се сразу и вспоминается\b=\1сё сразу и вспоминается=gI
s=\b(в)се сразу и не вспомнить\b=\1сё сразу и не вспомнить=gI
s=\b(в)се сразу кончится\b=\1сё сразу кончится=gI
s=\b(в)се сразу купим\b=\1сё сразу купим=gI
s=\b(в)се сразу купить\b=\1сё сразу купить=gI
s=\b(в)се сразу на лад\b=\1сё сразу на лад=gI
s=\b(в)се сразу позабыл\b=\1сё сразу позабыл=gI
s=\b(в)се сразу прояснится\b=\1сё сразу прояснится=gI
s=\b(в)се сразу само\b=\1сё сразу само=gI
s=\b(в)се сразу случается\b=\1сё сразу случается=gI
s=\b(в)се сразу стало\b=\1сё сразу стало=gI
s=\b(в)се сразу становится\b=\1сё сразу становится=gI
s=\b(в)се сразу ты не вспомнишь\b=\1сё сразу ты не вспомнишь=gI
s=\b(в)се сразу,\b=\1сё сразу,=gI
s=\b(в)се сразу\.\b=\1сё сразу\.=gI
s=\b(в)се срисовали\?\b=\1сё срисовали\?=gI
s=\b(в)се стало ясно\b=\1сё стало ясно=gI
s=\b(в)се станет\b=\1сё станет=gI
s=\b(в)се старательно записал\b=\1сё старательно записал=gI
s=\b(в)се старательно,\b=\1сё старательно,=gI
s=\b(в)се старше становится\b=\1сё старше становится=gI
s=\b(в)се стас сделал\b=\1сё Стас сделал=gI
s=\b(в)се стоит очень дорого\b=\1сё стОит очень дорого=gI
s=\b(в)се стоит перед\b=\1сё стоИт перед=gI
s=\b(в)се столь уж безнад[её]жно\b=\1сё столь уж безнадёжно=gI
s=\b(в)се стоп\.\b=\1сё стоп\.=gI
s=\b(в)се сугудаевое богатство водится\b=\1сё сугудаевое богатство водится=gI
s=\b(в)се суета су[её]т\b=\1сё суета суёт=gI
s=\b(в)се сходу спихнуть\b=\1сё сходу спихнуть=gI
s=\b(в)се считай что\b=\1сё считай что=gI
s=\b(в)се съели и ещ[её] потребовали\b=\1сё съели и ещё потребовали=gI
s=\b(в)се съели,\b=\1сё съели,=gI
s=\b(в)се сынки,\b=\1сё сынки,=gI
s=\b(в)се сыпь,\b=\1сё сыпь,=gI
s=\b(в)се сырое вокруг\b=\1сё сырое вокруг=gI
s=\b(в)се та же\b=\1сё та же=gI
s=\b(в)се тайное станет\b=\1сё тайное станет=gI
s=\b(в)се так - слова\b=\1сё так - словА=gI
s=\b(в)се так аккуратно\.\b=\1сё так аккуратно\.=gI
s=\b(в)се так безнад[её]жно\b=\1сё так безнадёжно=gI
s=\b(в)се так дико\b=\1сё так дико=gI
s=\b(в)се так же молча шагали\b=\1сё так же молча шагали=gI
s=\b(в)се так же само!\b=\1сё так же сАмо!=gI
s=\b(в)се так же само,\b=\1сё так же сАмо,=gI
s=\b(в)се так же само\.\b=\1сё так же сАмо\.=gI
s=\b(в)се так же само\?\b=\1сё так же сАмо\?=gI
s=\b(в)се так же сверкали\b=\1сё так же сверкали=gI
s=\b(в)се так же стояла\b=\1сё так же стояла=gI
s=\b(в)се так живо,\b=\1сё так живо,=gI
s=\b(в)се так живо\.\b=\1сё так живо\.=gI
s=\b(в)се так запутается\b=\1сё так запутается=gI
s=\b(в)се так запуталось\b=\1сё так запуталось=gI
s=\b(в)се так запутано\b=\1сё так запутано=gI
s=\b(в)се так запущено\b=\1сё так запущено=gI
s=\b(в)се так здорово\b=\1сё так здОрово=gI
s=\b(в)се так и будет\b=\1сё так и будет=gI
s=\b(в)се так и было\b=\1сё так и было=gI
s=\b(в)се так и выпирало\b=\1сё так и выпирало=gI
s=\b(в)се так и вышло\b=\1сё так и вышло=gI
s=\b(в)се так и должно\b=\1сё так и должно=gI
s=\b(в)се так и есть\b=\1сё так и есть=gI
s=\b(в)се так и пишем\b=\1сё так и пишем=gI
s=\b(в)се так и пойд[её]т\b=\1сё так и пойдёт=gI
s=\b(в)се так и получилось\b=\1сё так и получилось=gI
s=\b(в)се так и случилось\b=\1сё так и случилось=gI
s=\b(в)се так и суетился\b=\1сё так и суетился=gI
s=\b(в)се так интересно\b=\1сё так интересно=gI
s=\b(в)се так круто\b=\1сё так круто=gI
s=\b(в)се так легко и просто\b=\1сё так легко и просто=gI
s=\b(в)се так легко\?\b=\1сё так легко\?=gI
s=\b(в)се так необычно\b=\1сё так необычно=gI
s=\b(в)се так обернулось\b=\1сё так обернулось=gI
s=\b(в)се так отвратительно вышло\b=\1сё так отвратительно вышло=gI
s=\b(в)се так перепуталось\b=\1сё так перепуталось=gI
s=\b(в)се так печально\b=\1сё так печально=gI
s=\b(в)се так плохо\b=\1сё так плохо=gI
s=\b(в)се так произошло\b=\1сё так произошло=gI
s=\b(в)се так просто\b=\1сё так просто=gI
s=\b(в)се так разработано\b=\1сё так разработано=gI
s=\b(в)се так серь[её]зно может\b=\1сё так серьёзно может=gI
s=\b(в)се так серь[её]зно\b=\1сё так серьёзно=gI
s=\b(в)се так сложилось\b=\1сё так сложилось=gI
s=\b(в)се так сложно\b=\1сё так сложно=gI
s=\b(в)се так страшно в\b=\1сё так страшно в=gI
s=\b(в)се так страшно,\b=\1сё так страшно,=gI
s=\b(в)се так таинственно\b=\1сё так таинственно=gI
s=\b(в)се так трагично\b=\1сё так трагично=gI
s=\b(в)се так удачно складывалось\b=\1сё так удачно складывалось=gI
s=\b(в)се так упрощать\b=\1сё так упрощать=gI
s=\b(в)се так хорошо складывается\b=\1сё так хорошо складывается=gI
s=\b(в)се так,\b=\1сё так,=gI
s=\b(в)се так\?\b=\1сё так\?=gI
s=\b(в)се такая ерунда\b=\1сё такая ерунда=gI
s=\b(в)се такая же\b=\1сё такая же=gI
s=\b(в)се также крепко\b=\1сё также крепко=gI
s=\b(в)се также натянутая\b=\1сё также натянутая=gI
s=\b(в)се также неотвратимо\b=\1сё также неотвратимо=gI
s=\b(в)се также остались\b=\1сё также остались=gI
s=\b(в)се таки будут\b=\1сё таки будут=gI
s=\b(в)се таки вернутся\b=\1сё таки вернутся=gI
s=\b(в)се таки дома\b=\1сё таки дОма=gI
s=\b(в)се таки заглянув\b=\1сё таки заглянув=gI
s=\b(в)се таки не\b=\1сё таки не=gI
s=\b(в)се таки повернул\b=\1сё таки повернул=gI
s=\b(в)се таки стоит\b=\1сё таки стОит=gI
s=\b(в)се таки это\b=\1сё таки это=gI
s=\b(в)се такие же\b=\1сё такие же=gI
s=\b(в)се таким же\b=\1сё таким же=gI
s=\b(в)се таким совершенным\b=\1сё таким совершенным=gI
s=\b(в)се такими же болезненными\b=\1сё такими же болезненными=gI
s=\b(в)се такого же хотел\b=\1сё такого же хотел=gI
s=\b(в)се такого же\b=\1сё такого же=gI
s=\b(в)се такой же\b=\1сё такой же=gI
s=\b(в)се там вдребезги\b=\1сё там вдребезги=gI
s=\b(в)се там же\b=\1сё там же=gI
s=\b(в)се там очень сложно\b=\1сё там очень сложно=gI
s=\b(в)се там переделать\b=\1сё там переделать=gI
s=\b(в)се там прибрать\b=\1сё там прибрать=gI
s=\b(в)се там разворошили\b=\1сё там разворошили=gI
s=\b(в)се там расписано\b=\1сё там расписано=gI
s=\b(в)се там у него нормально\b=\1сё там у него нормально=gI
s=\b(в)се те же деревья\b=\1сё те же деревья=gI
s=\b(в)се те же лица\b=\1сё те же лИца=gI
s=\b(в)се те же слова\b=\1сё те же словА=gI
s=\b(в)се те же\b=\1сё те же=gI
s=\b(в)се тебе будет\b=\1сё тебе будет=gI
s=\b(в)се тебе ведомо\b=\1сё тебе вЕдомо=gI
s=\b(в)се тебе известно\b=\1сё тебе известно=gI
s=\b(в)се тебе нужное\b=\1сё тебе нужное=gI
s=\b(в)се тебе объяснила\b=\1сё тебе объяснила=gI
s=\b(в)се тебе объясню\b=\1сё тебе объясню=gI
s=\b(в)се тебе подробно\b=\1сё тебе подробно=gI
s=\b(в)се тебе показал\b=\1сё тебе показал=gI
s=\b(в)се тебе припомню\b=\1сё тебе припомню=gI
s=\b(в)се тебе рассказал\b=\1сё тебе рассказал=gI
s=\b(в)се тебе рассказываю\b=\1сё тебе рассказываю=gI
s=\b(в)се тебе сделаю\b=\1сё тебе сделаю=gI
s=\b(в)се тебе скину\.\b=\1сё тебе скину\.=gI
s=\b(в)се тело были\b=\1сё тело были=gI
s=\b(в)се тело покрывали\b=\1сё тело покрывали=gI
s=\b(в)се тело тут\b=\1сё тело тут=gI
s=\b(в)се тем было\b=\1сё тем было=gI
s=\b(в)се тем же\b=\1сё тем же=gI
s=\b(в)се теми же\b=\1сё теми же=gI
s=\b(в)се темнее и темнее\b=\1сё темнее и темнее=gI
s=\b(в)се теперь в вашей\b=\1сё теперь в вашей=gI
s=\b(в)се теперь делим пополам\b=\1сё теперь делим пополам=gI
s=\b(в)се теперь едино\b=\1сё теперь едино=gI
s=\b(в)се теперь используешь\b=\1сё теперь используешь=gI
s=\b(в)се теперь можем\b=\1сё теперь можем=gI
s=\b(в)се теперь может\b=\1сё теперь может=gI
s=\b(в)се теперь накрылось\b=\1сё теперь накрылось=gI
s=\b(в)се теперь отражено\b=\1сё теперь отражено=gI
s=\b(в)се теперь понятно\b=\1сё теперь понятно=gI
s=\b(в)се теперь пут[её]м\b=\1сё теперь путём=gI
s=\b(в)се теперь хорошо\b=\1сё теперь хорошо=gI
s=\b(в)се теребил нас\b=\1сё теребил нас=gI
s=\b(в)се терзали и терзали\b=\1сё терзали и терзали=gI
s=\b(в)се теснее\.\b=\1сё теснее\.=gI
s=\b(в)се тех же\b=\1сё тех же=gI
s=\b(в)се теч[её]т,\b=\1сё течёт,=gI
s=\b(в)се тиной заросло\b=\1сё тиной заросло=gI
s=\b(в)се тип топ\b=\1сё тип топ=gI
s=\b(в)се тихо оставалось\b=\1сё тихо оставалось=gI
s=\b(в)се тихо сделать\b=\1сё тихо сделать=gI
s=\b(в)се то же жаркое\b=\1сё то же жаркОе=gI
s=\b(в)се то же\b=\1сё то же=gI
s=\b(в)се то он знает\b=\1сё то он знает=gI
s=\b(в)се то,\b=\1сё то,=gI
s=\b(в)се тобой услышанное\b=\1сё тобой услышанное=gI
s=\b(в)се тогда могло\b=\1сё тогда могло=gI
s=\b(в)се того же\b=\1сё того же=gI
s=\b(в)се тоже было\b=\1сё тоже было=gI
s=\b(в)се тоже в костры\b=\1сё тоже в костры=gI
s=\b(в)се тоже самое,\b=\1сё тоже самое,=gI
s=\b(в)се тоже тонированное\b=\1сё тоже тонированное=gI
s=\b(в)се той же ноги\b=\1сё той же ногИ=gI
s=\b(в)се той же пятой\b=\1сё той же пятой=gI
s=\b(в)се той же\b=\1сё той же=gI
s=\b(в)се толком выяснить\b=\1сё толком выяснить=gI
s=\b(в)се толком не успел\b=\1сё толком не успел=gI
s=\b(в)се толком\.\b=\1сё толком\.=gI
s=\b(в)се толку от тебя нет\b=\1сё толку от тебя нет=gI
s=\b(в)се только благодаря\b=\1сё только благодаря=gI
s=\b(в)се только в лучшую сторону\b=\1сё только в лучшую сторону=gI
s=\b(в)се только для того\b=\1сё только для того=gI
s=\b(в)се только и начинается\b=\1сё только и начинается=gI
s=\b(в)се только мускулы\b=\1сё только мускулы=gI
s=\b(в)се только напортили\b=\1сё только напортили=gI
s=\b(в)се только начинается\b=\1сё только начинается=gI
s=\b(в)се только начиналось\b=\1сё только начиналось=gI
s=\b(в)се только начн[её]тся\b=\1сё только начнётся=gI
s=\b(в)се только по\b=\1сё только по=gI
s=\b(в)се только показалось\b=\1сё только показалось=gI
s=\b(в)се только ради\b=\1сё только ради=gI
s=\b(в)се только случилось\b=\1сё только случилось=gI
s=\b(в)се только усилиться\b=\1сё только усилиться=gI
s=\b(в)се только ухудшается\b=\1сё только ухудшается=gI
s=\b(в)се только хуже\b=\1сё только хуже=gI
s=\b(в)се только что обрушилось\b=\1сё только что обрушилось=gI
s=\b(в)се только что услышанное\b=\1сё только что услышанное=gI
s=\b(в)се топливо сж[её]г\b=\1сё топливо сжёг=gI
s=\b(в)се топливо,\b=\1сё топливо,=gI
s=\b(в)се тот же\b=\1сё тот же=gI
s=\b(в)се точно будет\b=\1сё точно будет=gI
s=\b(в)се точно записано\b=\1сё точно записано=gI
s=\b(в)се точно написано\b=\1сё точно написано=gI
s=\b(в)се точно оборвалось\b=\1сё точно оборвалось=gI
s=\b(в)се точно описано\b=\1сё точно описано=gI
s=\b(в)се точно также\b=\1сё точно также=gI
s=\b(в)се точь в точь\b=\1сё точь в точь=gI
s=\b(в)се трын трава\b=\1сё трын трава=gI
s=\b(в)се ту же\b=\1сё ту же=gI
s=\b(в)се ту тпродуманно\b=\1сё ту тпродуманно=gI
s=\b(в)се туда же\b=\1сё туда же=gI
s=\b(в)се туда уйд[её]т\b=\1сё туда уйдёт=gI
s=\b(в)се туда,\b=\1сё туда,=gI
s=\b(в)се тут благостно\b=\1сё тут благостно=gI
s=\b(в)се тут было\b=\1сё тут было=gI
s=\b(в)се тут другое\b=\1сё тут другое=gI
s=\b(в)се тут же вста[её]т\b=\1сё тут же встаёт=gI
s=\b(в)се тут же исчезло\b=\1сё тут же исчезло=gI
s=\b(в)се тут же срастается\b=\1сё тут же срастается=gI
s=\b(в)се тут же стало\b=\1сё тут же стало=gI
s=\b(в)се тут запущено\b=\1сё тут запущено=gI
s=\b(в)се тут позволялось\b=\1сё тут позволялось=gI
s=\b(в)се тут происходящее\b=\1сё тут происходящее=gI
s=\b(в)се тут разнесут\b=\1сё тут разнесут=gI
s=\b(в)се тут рассмотрим\b=\1сё тут рассмотрим=gI
s=\b(в)се тут специально устроено\b=\1сё тут специально устроено=gI
s=\b(в)се тут хорошо,\b=\1сё тут хорошо,=gI
s=\b(в)се тщательно обдумать\b=\1сё тщательно обдумать=gI
s=\b(в)се ты виноват\b=\1сё ты виноват=gI
s=\b(в)се ты вр[её]шь\b=\1сё ты врёшь=gI
s=\b(в)се ты знаешь\b=\1сё ты знаешь=gI
s=\b(в)се ты можешь\b=\1сё ты можешь=gI
s=\b(в)се ты ожидал\b=\1сё ты ожидал=gI
s=\b(в)се ты помнишь\b=\1сё ты помнишь=gI
s=\b(в)се ты понимаешь\b=\1сё ты понимаешь=gI
s=\b(в)се тютелька в тютельку\b=\1сё тютелька в тютельку=gI
s=\b(в)се тянула и тянула\b=\1сё тянула и тянула=gI
s=\b(в)се у вас в сумке\b=\1сё у вас в сумке=gI
s=\b(в)се у вас да будет\b=\1сё у вас да будет=gI
s=\b(в)се у вас получилось\b=\1сё у вас получилось=gI
s=\b(в)се у вас хорошо\b=\1сё у вас хорошо=gI
s=\b(в)се у вас\b=\1сё у вас=gI
s=\b(в)се у меня внутри\b=\1сё у меня внутри=gI
s=\b(в)се у меня нормально\b=\1сё у меня нормально=gI
s=\b(в)се у меня отнимет\b=\1сё у меня отнимет=gI
s=\b(в)се у меня получилось\b=\1сё у меня получилось=gI
s=\b(в)се у меня прекрасно\b=\1сё у меня прекрасно=gI
s=\b(в)се у меня славно\b=\1сё у меня славно=gI
s=\b(в)се у нас было\b=\1сё у нас было=gI
s=\b(в)се у нас есть\b=\1сё у нас есть=gI
s=\b(в)се у нас покатилось\b=\1сё у нас покатилось=gI
s=\b(в)се у нас шло\b=\1сё у нас шло=gI
s=\b(в)се у нас\b=\1сё у нас=gI
s=\b(в)се у него есть\b=\1сё у него есть=gI
s=\b(в)се у него через\b=\1сё у него через=gI
s=\b(в)се у них было\b=\1сё у них было=gI
s=\b(в)се у них не как\b=\1сё у них не как=gI
s=\b(в)се у них не сходилось\b=\1сё у них не сходилось=gI
s=\b(в)се у них\b=\1сё у них=gI
s=\b(в)се у тебя получается\b=\1сё у тебя получается=gI
s=\b(в)се у тебя получится\b=\1сё у тебя получится=gI
s=\b(в)се увели бывшая\b=\1сё увели бывшая=gI
s=\b(в)се увели,\b=\1сё увели,=gI
s=\b(в)се увеличивают и увеличивают\b=\1сё увеличивают и увеличивают=gI
s=\b(в)се увидеть можно\b=\1сё увидеть можно=gI
s=\b(в)се уж приготовлено\b=\1сё уж приготовлено=gI
s=\b(в)се уже будет\b=\1сё уже будет=gI
s=\b(в)се уже было готово\b=\1сё уже было готово=gI
s=\b(в)се уже было\b=\1сё уже было=gI
s=\b(в)се уже в негодность\b=\1сё уже в негодность=gI
s=\b(в)се уже в порядке\b=\1сё уже в порядке=gI
s=\b(в)се уже все\b=все уже всё=gI
s=\b(в)се уже выбрано\b=\1сё уже выбрано=gI
s=\b(в)се уже выправляется\b=\1сё уже выправляется=gI
s=\b(в)се уже готово\b=\1сё уже готово=gI
s=\b(в)се уже давно все поняли\b=все уже давно всё поняли=gI
s=\b(в)се уже давно закончилось\b=\1сё ужЕ давно закончилось=gI
s=\b(в)се уже давно потеряно\b=\1сё уже давно потеряно=gI
s=\b(в)се уже для себя решил\b=\1сё уже для себя решил=gI
s=\b(в)се уже забылось\b=\1сё уже забылось=gI
s=\b(в)се уже завертелось\b=\1сё уже завертелось=gI
s=\b(в)се уже завтра на мази\b=\1сё уже завтра на мази=gI
s=\b(в)се уже зажило\b=\1сё уже зажило=gI
s=\b(в)се уже закончилось\b=\1сё уже закончилось=gI
s=\b(в)се уже заплачено\b=\1сё уже заплачено=gI
s=\b(в)се уже зарегистрировано\b=\1сё уже зарегистрировано=gI
s=\b(в)се уже заросло\b=\1сё уже заросло=gI
s=\b(в)се уже знает\b=\1сё уже знает=gI
s=\b(в)се уже знакомо\b=\1сё уже знакомо=gI
s=\b(в)се уже и уже\b=\1сё Уже и Уже=gI
s=\b(в)се уже изучено\b=\1сё уже изучено=gI
s=\b(в)се уже когда то было\b=\1сё уже когда то было=gI
s=\b(в)се уже когда тоъ было\b=\1сё уже когда тоъ было=gI
s=\b(в)се уже кончено\b=\1сё уже кончено=gI
s=\b(в)се уже кончилось\b=\1сё уже кончилось=gI
s=\b(в)се уже на мази\b=\1сё уже на мази=gI
s=\b(в)се уже на пару\.\b=\1сё уже на пару\.=gI
s=\b(в)се уже надоело\b=\1сё уже надоело=gI
s=\b(в)се уже настолько осточертело\b=\1сё уже настолько осточертело=gI
s=\b(в)се уже находится\b=\1сё уже нахОдится=gI
s=\b(в)се уже не единожды отработано\b=\1сё уже не единожды отработано=gI
s=\b(в)се уже не так радужно\b=\1сё ужЕ не так радужно=gI
s=\b(в)се уже не то\b=\1сё уже не то=gI
s=\b(в)се уже обшарили\b=\1сё уже обшарили=gI
s=\b(в)се уже ответил\b=\1сё уже ответил=gI
s=\b(в)се уже побл[её]кнет\b=\1сё уже поблёкнет=gI
s=\b(в)се уже под контролем\b=\1сё уже под контролем=gI
s=\b(в)се уже подготовил\b=\1сё уже подготовил=gI
s=\b(в)се уже позади\b=\1сё уже позади=gI
s=\b(в)се уже понял\b=\1сё уже понял=gI
s=\b(в)се уже понятно\b=\1сё уже понятно=gI
s=\b(в)се уже при\b=\1сё уже при=gI
s=\b(в)се уже приготовлено\b=\1сё уже приготовлено=gI
s=\b(в)се уже произошло\b=\1сё уже произошло=gI
s=\b(в)се уже разведала\b=\1сё уже разведала=gI
s=\b(в)се уже решено\b=\1сё уже решено=gI
s=\b(в)се уже само\b=\1сё уже само=gI
s=\b(в)се уже сделано\b=\1сё уже сделано=gI
s=\b(в)се уже случилось\b=\1сё уже случилось=gI
s=\b(в)се уже состоялось\b=\1сё уже состоялось=gI
s=\b(в)се уже устроено\b=\1сё уже устроено=gI
s=\b(в)се уже хорошо\b=\1сё уже хорошо=gI
s=\b(в)се уже,\b=\1сё уже,=gI
s=\b(в)се узнаете в\b=\1сё узнАете в=gI
s=\b(в)се узнаю по\b=\1сё узнАю по=gI
s=\b(в)се узнают\.\b=\1сё узнают\.=gI
s=\b(в)се украдкой меня рассматриваешь\b=\1сё украдкой меня рассматриваешь=gI
s=\b(в)се укрепили…\b=\1сё укрепили…=gI
s=\b(в)се укрепили\.\b=\1сё укрепили\.=gI
s=\b(в)се умели и все могли\.\b=\1сё умели и всё могли\.=gI
s=\b(в)се упрямо отрицал\b=\1сё упрямо отрицал=gI
s=\b(в)се услышите сами\b=\1сё услышите сами=gI
s=\b(в)се услышите\.\b=\1сё услышите\.=gI
s=\b(в)се успел записать\b=\1сё успел записать=gI
s=\b(в)се успело измениться\b=\1сё успело измениться=gI
s=\b(в)се успешно складывается\b=\1сё успешно складывается=gI
s=\b(в)се устроит как надо\b=\1сё устроит как надо=gI
s=\b(в)се устроят как надо\b=\1сё устроят как надо=gI
s=\b(в)се ушами прохлопал\b=\1сё ушами прохлопал=gI
s=\b(в)се ходят слухи\b=\1сё ходят слухи=gI
s=\b(в)се хорошенько обдумать\b=\1сё хорошенько обдумать=gI
s=\b(в)се хорошо будет\b=\1сё хорошо будет=gI
s=\b(в)се хорошо в сво[её]\b=\1сё хорошо в своё=gI
s=\b(в)се хорошо в\b=\1сё хорошо в=gI
s=\b(в)се хорошо вроде,\b=\1сё хорошо вроде,=gI
s=\b(в)се хорошо ид[её]т\b=\1сё хорошо идёт=gI
s=\b(в)се хорошо к\b=\1сё хорошо к=gI
s=\b(в)се хорошо обдумать\b=\1сё хорошо обдумать=gI
s=\b(в)се хорошо продумано\b=\1сё хорошо продумано=gI
s=\b(в)се хорошо с\b=\1сё хорошо с=gI
s=\b(в)се хорошо сложилось\b=\1сё хорошо сложилось=gI
s=\b(в)се хорошо!\b=\1сё хорошо!=gI
s=\b(в)се хорошо,\b=\1сё хорошо,=gI
s=\b(в)се хорошо\.\b=\1сё хорошо\.=gI
s=\b(в)се хотел спросить\b=\1сё хотел спросить=gI
s=\b(в)се хоть под лупой\b=\1сё хоть под лупой=gI
s=\b(в)се хочешь доказать\b=\1сё хочешь доказать=gI
s=\b(в)се хуже и хуже\b=\1сё хуже и хуже=gI
s=\b(в)се цветочки носил\b=\1сё цветочки носил=gI
s=\b(в)се ценное с\b=\1сё ценное с=gI
s=\b(в)се чаще попадались\b=\1сё чаще попадались=gI
s=\b(в)се чего то [её]рзает\b=\1сё чего то ёрзает=gI
s=\b(в)се чего то искала\b=\1сё чего то искала=gI
s=\b(в)се чего тоъ [её]рзает\b=\1сё чего тоъ ёрзает=gI
s=\b(в)се чего тоъ искала\b=\1сё чего тоъ искала=gI
s=\b(в)се чего хотел\b=\1сё чего хотел=gI
s=\b(в)се человеку дано\b=\1сё человеку дано=gI
s=\b(в)се чем мог\b=\1сё чем мог=gI
s=\b(в)се через жопу\b=\1сё через жопу=gI
s=\b(в)се через орден ид[её]т\b=\1сё через Орден идёт=gI
s=\b(в)се через того\b=\1сё через того=gI
s=\b(в)се ч[её]ртовы немцы\b=\1сё чёртовы немцы=gI
s=\b(в)се честно будет\b=\1сё честно будет=gI
s=\b(в)се честно!\b=\1сё честно!=gI
s=\b(в)се честно,\b=\1сё честно,=gI
s=\b(в)се честно\.\b=\1сё честно\.=gI
s=\b(в)се честно\?\b=\1сё честно\?=gI
s=\b(в)се честь по чести\b=\1сё честь по чести=gI
s=\b(в)се честь по\b=\1сё честь по=gI
s=\b(в)се ч[её]тко, приятно\b=\1сё чётко, приятно=gI
s=\b(в)се ч[её]тче и ч[её]тче\b=\1сё чётче и чётче=gI
s=\b(в)се ч[её]тче проступает\b=\1сё чётче проступает=gI
s=\b(в)се чики брики\b=\1сё чики брики=gI
s=\b(в)се чики будет\b=\1сё чики будет=gI
s=\b(в)се чики поки\b=\1сё чики поки=gI
s=\b(в)се чики,\b=\1сё чики,=gI
s=\b(в)се чин по чину\b=\1сё чин по чину=gI
s=\b(в)се чин чинар[её]м\b=\1сё чин чинарём=gI
s=\b(в)се чин чином\b=\1сё чин чином=gI
s=\b(в)се чисто было\b=\1сё чисто было=gI
s=\b(в)се чисто\.\b=\1сё чисто\.=gI
s=\b(в)се чрез него начало быть\b=\1сё чрез него нАчало быть=gI
s=\b(в)се чрезвычайно осложнилось\b=\1сё чрезвычайно осложнилось=gI
s=\b(в)се что вы видите\b=\1сё что вы видите=gI
s=\b(в)се что мы\b=\1сё что мы=gI
s=\b(в)се что найд[её]те\b=\1сё что найдёте=gI
s=\b(в)се что осталось\b=\1сё что осталось=gI
s=\b(в)се что то выспрашивал\b=\1сё что то выспрашивал=gI
s=\b(в)се что то излучает\b=\1сё что то излучает=gI
s=\b(в)се что то цепляюсь\b=\1сё что то цепляюсь=gI
s=\b(в)се что тоъ выспрашивал\b=\1сё что тоъ выспрашивал=gI
s=\b(в)се что тоъ излучает\b=\1сё что тоъ излучает=gI
s=\b(в)се что тоъ цепляюсь\b=\1сё что тоъ цепляюсь=gI
s=\b(в)се что у меня\b=\1сё что у меня=gI
s=\b(в)се что угодно\b=\1сё что угодно=gI
s=\b(в)се что хотели\b=\1сё что хотели=gI
s=\b(в)се что хотите\b=\1сё что хотите=gI
s=\b(в)се что шевелиться\b=\1сё что шевелиться=gI
s=\b(в)се чувствуют\.\b=\1сё чувствуют\.=gI
s=\b(в)се чудно обустроят\b=\1сё чудно обустроят=gI
s=\b(в)се чудо техники\b=\1сё чудо техники=gI
s=\b(в)се чуток другое\b=\1сё чуток другое=gI
s=\b(в)се чуточку иное\b=\1сё чуточку иное=gI
s=\b(в)се чуть проще\.\b=\1сё чуть проще\.=gI
s=\b(в)се чуть проще\b=\1сё чуть проще=gI
s=\b(в)се чуть успокоилось\b=\1сё чуть успокоилось=gI
s=\b(в)се чуть чуть ненастоящее\b=\1сё чуть чуть ненастоящее=gI
s=\b(в)се шапки кидал\b=\1сё шапки кидал=gI
s=\b(в)се шиворот на выворот\b=\1сё шиворот на выворот=gI
s=\b(в)се шире и шире\b=\1сё шире и шире=gI
s=\b(в)се шито крыто\b=\1сё шито крыто=gI
s=\b(в)се шли и шли\b=\1сё шли и шли=gI
s=\b(в)се штирлицы выяснят\b=\1сё штирлицы выяснят=gI
s=\b(в)се шутки шутим\b=\1сё шутки шутим=gI
s=\b(в)се щебнем засыпано\b=\1сё щебнем засыпано=gI
s=\b(в)се это - последствия\b=\1сё это - последствия=gI
s=\b(в)се это барахло\b=\1сё это барахло=gI
s=\b(в)се это бесполезно\b=\1сё это бесполезно=gI
s=\b(в)се это бралось\b=\1сё это бралось=gI
s=\b(в)се это будет\b=\1сё это будет=gI
s=\b(в)се это буквально\b=\1сё это буквально=gI
s=\b(в)се это были\b=\1сё это были=gI
s=\b(в)се это было\b=\1сё это было=gI
s=\b(в)се это быль[её]м\b=\1сё это быльём=gI
s=\b(в)се это в исходное\b=\1сё это в исходное=gI
s=\b(в)се это в\b=\1сё это в=gI
s=\b(в)се это важно\b=\1сё это важно=gI
s=\b(в)се это вполне могло произойти\b=\1сё это вполне могло произойти=gI
s=\b(в)се это вполне могло\b=\1сё это вполне могло=gI
s=\b(в)се это врань[её]\b=\1сё это враньё=gI
s=\b(в)се это время\b=\1сё это время=gI
s=\b(в)се это всерь[её]з\b=\1сё это всерьёз=gI
s=\b(в)се это выглядело\b=\1сё это выглядело=gI
s=\b(в)се это выглядит\b=\1сё это выглядит=gI
s=\b(в)се это вызвало\b=\1сё это вызвало=gI
s=\b(в)се это говорило\b=\1сё это говорило=gI
s=\b(в)се это говорит\b=\1сё это говорит=gI
s=\b(в)се это гонево\b=\1сё это гонево=gI
s=\b(в)се это громоздилось\b=\1сё это громоздилось=gI
s=\b(в)се это грязь\b=\1сё это грязь=gI
s=\b(в)се это давно известно\b=\1сё это давно известно=gI
s=\b(в)се это даже кажется\b=\1сё это даже кажется=gI
s=\b(в)се это движение\b=\1сё это движение=gI
s=\b(в)се это действительно разные\b=\1сё это действительно разные=gI
s=\b(в)се это действительно\b=\1сё это действительно=gI
s=\b(в)се это действовало\b=\1сё это действовало=gI
s=\b(в)се это делало\b=\1сё это делало=gI
s=\b(в)се это делалось\b=\1сё это делалось=gI
s=\b(в)се это детали\b=\1сё это детали=gI
s=\b(в)се это длится\b=\1сё это длится=gI
s=\b(в)се это для\b=\1сё это для=gI
s=\b(в)се это добыто\b=\1сё это добыто=gI
s=\b(в)се это доктору\b=\1сё это доктору=gI
s=\b(в)се это должно\b=\1сё это должно=gI
s=\b(в)се это ерунда\b=\1сё это ерунда=gI
s=\b(в)се это есть\b=\1сё это есть=gI
s=\b(в)се это ещ[её] должно\b=\1сё это ещё должно=gI
s=\b(в)се это жд[её]т\b=\1сё это ждёт=gI
s=\b(в)се это за\b=\1сё это за=gI
s=\b(в)се это звучало\b=\1сё это звучало=gI
s=\b(в)се это знаешь\b=\1сё это знаешь=gI
s=\b(в)се это знал\b=\1сё это знал=gI
s=\b(в)се это значит\b=\1сё это значит=gI
s=\b(в)се это знают\.\b=\1сё это знают\.=gI
s=\b(в)се это и может\b=\1сё это и может=gI
s=\b(в)се это из головы\b=\1сё это из головЫ=gI
s=\b(в)се это из за\b=\1сё это из за=gI
s=\b(в)се это изменить\b=\1сё это изменить=gI
s=\b(в)се это имеет\b=\1сё это имеет=gI
s=\b(в)се это интересно\b=\1сё это интересно=gI
s=\b(в)се это использовать\b=\1сё это использовать=gI
s=\b(в)се это кажется\b=\1сё это кажется=gI
s=\b(в)се это кончилось\b=\1сё это кончилось=gI
s=\b(в)се это кончится\b=\1сё это кончится=gI
s=\b(в)се это лишь слова\b=\1сё это лишь словА=gI
s=\b(в)се это лишь совпадения\b=\1сё это лишь совпадения=gI
s=\b(в)се это мелочи\b=\1сё это мелочи=gI
s=\b(в)се это меня\b=\1сё это меня=gI
s=\b(в)се это могло\b=\1сё это могло=gI
s=\b(в)се это может\b=\1сё это может=gI
s=\b(в)се это можно\b=\1сё это можно=gI
s=\b(в)се это мы\b=\1сё это мы=gI
s=\b(в)се это нагреть\b=\1сё это нагреть=gI
s=\b(в)се это надо\b=\1сё это надо=gI
s=\b(в)се это надоело\b=\1сё это надоело=gI
s=\b(в)се это находилось\b=\1сё это находилось=gI
s=\b(в)се это началось\b=\1сё это началось=gI
s=\b(в)се это наяву\b=\1сё это наяву=gI
s=\b(в)се это не дело\b=\1сё это не дело=gI
s=\b(в)се это не имеет\b=\1сё это не имеет=gI
s=\b(в)се это не имело\b=\1сё это не имело=gI
s=\b(в)се это не моего\b=\1сё это не моего=gI
s=\b(в)се это не нравится\b=\1сё это не нравится=gI
s=\b(в)се это не означает\b=\1сё это не означает=gI
s=\b(в)се это не просто пугало\b=\1сё это не просто пугАло=gI
s=\b(в)се это не просто\b=\1сё это не просто=gI
s=\b(в)се это не стоило\b=\1сё это не стоило=gI
s=\b(в)се это не так просто\b=\1сё это не так просто=gI
s=\b(в)се это не то\b=\1сё это не то=gI
s=\b(в)се это не удержалось\b=\1сё это не удержалось=gI
s=\b(в)се это неизбежно\b=\1сё это неизбежно=gI
s=\b(в)се это нельзя\b=\1сё это нельзя=gI
s=\b(в)се это непрерывно\b=\1сё это непрерывно=gI
s=\b(в)се это ни\b=\1сё это ни=gI
s=\b(в)се это нужно\b=\1сё это нужно=gI
s=\b(в)се это ныне\b=\1сё это ныне=gI
s=\b(в)се это оберн[её]тся\b=\1сё это обернётся=gI
s=\b(в)се это обсудим\b=\1сё это обсудим=gI
s=\b(в)се это объяснить\b=\1сё это объяснить=gI
s=\b(в)се это одним\b=\1сё это одним=gI
s=\b(в)се это окажется\b=\1сё это окажется=gI
s=\b(в)се это оказалась\b=\1сё это оказалась=gI
s=\b(в)се это оказалось\b=\1сё это оказалось=gI
s=\b(в)се это опять\b=\1сё это опять=gI
s=\b(в)се это основано\b=\1сё это основано=gI
s=\b(в)се это отгорело\b=\1сё это отгорело=gI
s=\b(в)се это отношения\b=\1сё это отношения=gI
s=\b(в)се это отрицаете\b=\1сё это отрицаете=gI
s=\b(в)се это очень мило\b=\1сё это очень мило=gI
s=\b(в)се это очень сложно\b=\1сё это очень сложно=gI
s=\b(в)се это очень тяжело\b=\1сё это очень тяжело=gI
s=\b(в)се это очень\b=\1сё это очень=gI
s=\b(в)се это пахло\b=\1сё это пахло=gI
s=\b(в)се это перешито\b=\1сё это перешито=gI
s=\b(в)се это плохо кончится\b=\1сё это плохо кончится=gI
s=\b(в)се это повторится\b=\1сё это повторится=gI
s=\b(в)се это повторялось\b=\1сё это повторялось=gI
s=\b(в)се это позади\b=\1сё это позади=gI
s=\b(в)се это покажете\b=\1сё это покажете=gI
s=\b(в)се это помешало\b=\1сё это помешало=gI
s=\b(в)се это постоянно\b=\1сё это постоянно=gI
s=\b(в)се это почувствовали\b=\1сё это почувствовали=gI
s=\b(в)се это превратится\b=\1сё это превратится=gI
s=\b(в)се это предвидеть\b=\1сё это предвидеть=gI
s=\b(в)се это прид[её]тся\b=\1сё это придётся=gI
s=\b(в)се это придумываете\b=\1сё это придумываете=gI
s=\b(в)се это прикручено\b=\1сё это прикручено=gI
s=\b(в)се это приснилось\b=\1сё это приснилось=gI
s=\b(в)се это проверил\b=\1сё это проверил=gI
s=\b(в)се это произошло\b=\1сё это произошло=gI
s=\b(в)се это происходило\b=\1сё это происходило=gI
s=\b(в)се это происходит\b=\1сё это происходит=gI
s=\b(в)се это проявления\b=\1сё это проявления=gI
s=\b(в)се это разж[её]вывать\b=\1сё это разжёвывать=gI
s=\b(в)се это разузнал\b=\1сё это разузнал=gI
s=\b(в)се это рассказываешь\b=\1сё это рассказываешь=gI
s=\b(в)се это рассказывал\b=\1сё это рассказывал=gI
s=\b(в)се это резко\b=\1сё это резко=gI
s=\b(в)се это сами\b=\1сё это сами=gI
s=\b(в)се это сантименты\b=\1сё это сантименты=gI
s=\b(в)се это связано\b=\1сё это связано=gI
s=\b(в)се это сделать\b=\1сё это сделать=gI
s=\b(в)се это себе\b=\1сё это себе=gI
s=\b(в)се это слова\b=\1сё это словА=gI
s=\b(в)се это служило\b=\1сё это служило=gI
s=\b(в)се это случилось\b=\1сё это случилось=gI
s=\b(в)се это снится\b=\1сё это снится=gI
s=\b(в)се это собрано\b=\1сё это собрано=gI
s=\b(в)се это совместимо\b=\1сё это совместимо=gI
s=\b(в)се это создавало\b=\1сё это создавало=gI
s=\b(в)се это создано\b=\1сё это создано=gI
s=\b(в)се это стало\b=\1сё это стало=gI
s=\b(в)се это становится\b=\1сё это становится=gI
s=\b(в)се это стерпеть\b=\1сё это стерпеть=gI
s=\b(в)се это стоит\b=\1сё это стОит=gI
s=\b(в)се это так\b=\1сё это так=gI
s=\b(в)се это только для\b=\1сё это только для=gI
s=\b(в)се это ужасно\b=\1сё это ужасно=gI
s=\b(в)се это уже говорилось\b=\1сё это уже говорилось=gI
s=\b(в)се это указывает\b=\1сё это указывает=gI
s=\b(в)се это усугублялось\b=\1сё это усугублялось=gI
s=\b(в)се это ушло\b=\1сё это ушло=gI
s=\b(в)се это фиксировали\b=\1сё это фиксировали=gI
s=\b(в)се это хорошо\b=\1сё это хорошо=gI
s=\b(в)се это я к тому\b=\1сё это я к тому=gI
s=\b(в)се это я смог\b=\1сё это я смог=gI
s=\b(в)се это\.\b=\1сё это\.=gI
s=\b(в)се я видел\b=\1сё я видел=gI
s=\b(в)се я виноват\b=\1сё я виноват=gI
s=\b(в)се я знаю\b=\1сё я знаю=gI
s=\b(в)се я к чему\b=\1сё я к чему=gI
s=\b(в)се я понимаю\b=\1сё я понимаю=gI
s=\b(в)се я правильно\b=\1сё я правильно=gI
s=\b(в)се я прекрасно\b=\1сё я прекрасно=gI
s=\b(в)се я уже сказал\b=\1сё я уже сказал=gI
s=\b(в)се явно прибавляло\b=\1сё явно прибавляло=gI
s=\b(в)се явно стираное\b=\1сё явно стираное=gI
s=\b(в)се ярко и отч[её]тливо\b=\1сё ярко и отчётливо=gI
s=\b(в)се ярко и светло\b=\1сё ярко и светло=gI
s=\b(в)се яснее и яснее\b=\1сё яснее и яснее=gI
s=\b(в)се ясней видел\b=\1сё ясней видел=gI
s=\b(в)се ясно слышали\b=\1сё ясно слышали=gI
s=\b(в)се! начинаю\b=\1сё! Начинаю=gI
s=\b(в)се! обнад[её]живает\b=\1сё! обнадёживает=gI
s=\b(в)се! Отказа не принимаю\b=\1сё! Отказа не принимаю=gI
s=\b(в)се! теперь\b=\1сё! Теперь=gI
s=\b(в)се, - подв[её]л\b=\1сё, - подвёл=gI
s=\b(в)се, - подумал\b=\1сё, - подумал=gI
s=\b(в)се, - широко открытые\b=\1сё, - широко открытые=gI
s=\b(в)се, overload\b=\1сё, overload=gI
s=\b(в)се, амба\b=\1сё, амба=gI
s=\b(в)се, амбец\b=\1сё, амбец=gI
s=\b(в)се, баста\b=\1сё, баста=gI
s=\b(в)се, больше\b=\1сё, больше=gI
s=\b(в)се, будь\b=\1сё, будь=gI
s=\b(в)се, бумага\b=\1сё, бумага=gI
s=\b(в)се, был\b=\1сё, был=gI
s=\b(в)се, в общем,\b=\1сё, в общем,=gI
s=\b(в)се, в общем\b=\1сё, в общем=gI
s=\b(в)се, в расч[её]те\b=\1сё, в расчёте=gI
s=\b(в)се, валите\b=\1сё, валите=gI
s=\b(в)се, вам туда\b=\1сё, вам туда=gI
s=\b(в)се, вася, дорогой,\b=\1сё, Вася, дорогОй,=gI
s=\b(в)се, веришь ли\b=\1сё, веришь ли=gI
s=\b(в)се, вечно тут\b=\1сё, вечно тут=gI
s=\b(в)се, вон нужное\b=\1сё, вон нужное=gI
s=\b(в)се, вопрос исчерпан\b=\1сё, вопрос исчерпан=gI
s=\b(в)се, вот и\b=\1сё, вот и=gI
s=\b(в)се, вот местечко\b=\1сё, вот местечко=gI
s=\b(в)се, вот\b=\1сё, вот=gI
s=\b(в)се, впер[её]д,\b=\1сё, вперёд,=gI
s=\b(в)се, время\b=\1сё, время=gI
s=\b(в)се, вр[её]т\b=\1сё, врёт=gI
s=\b(в)се, вроде бы\b=\1сё, вроде бы=gI
s=\b(в)се, вроде, было\b=\1сё, вроде, было=gI
s=\b(в)се, все я один\b=\1сё, ВСё я один=gI
s=\b(в)се, вс[её], говорю\b=\1сё, всё, говорю=gI
s=\b(в)се, все, давай\b=\1сё, всё, давай=gI
s=\b(в)се, вс[её], давай\b=\1сё, всё, давай=gI
s=\b(В)се, вс[её], я ухожу\b=Всё, всё, я ухожу=gI
s=\b(в)с[её], все…\b=\1сё, всё…=gI
s=\b(в)се, всем пока\b=\1сё, всем пока=gI
s=\b(в)се, всех разместили\b=\1сё, всех разместили=gI
s=\b(в)се, вспомнил\b=\1сё, вспомнил=gI
s=\b(в)се, встали, встали\b=\1сё, встали, встали=gI
s=\b(в)се, вымрем\.\b=\1сё, вымрем\.=gI
s=\b(в)се, выполняй\b=\1сё, выполняй=gI
s=\b(в)се, выхожу\b=\1сё, выхожу=gI
s=\b(в)се, господа\b=\1сё, господА=gI
s=\b(в)се, готов\b=\1сё, готов=gI
s=\b(в)се, готово\b=\1сё, готово=gI
s=\b(в)се, грузимся\b=\1сё, грузимся=gI
s=\b(в)се, давай к\b=\1сё, давай к=gI
s=\b(в)се, давай оставим\b=\1сё, давай оставим=gI
s=\b(в)се, давай\b=\1сё, давай=gI
s=\b(в)се, дальше\b=\1сё, дальше=gI
s=\b(в)се, дармоеды,\b=\1сё, дармоеды,=gI
s=\b(в)се, двигайте\b=\1сё, двигайте=gI
s=\b(в)се, дела\b=\1сё, делА=gI
s=\b(в)се, до нас уже\b=\1сё, до нас уже=gI
s=\b(в)се, до чего\b=\1сё, до чего=gI
s=\b(в)се, дом сгорел\b=\1сё, дом сгорел=gI
s=\b(в)се, дружок\.\b=\1сё, дружок\.=gI
s=\b(в)се, друзья мои\b=\1сё, друзья мои=gI
s=\b(в)се, думаю\b=\1сё, думаю=gI
s=\b(в)се, дыхание\b=\1сё, дыхание=gI
s=\b(в)се, дьявольский\b=\1сё, дьявольский=gI
s=\b(в)се, ему\b=\1сё, Ему=gI
s=\b(в)се, если нет никого\b=\1сё, если нет никого=gI
s=\b(в)се, ещ[её] пару дней\b=\1сё, ещё пАру дней=gI
s=\b(в)се, ещ[её] чуть чуть\b=\1сё, ещё чуть чуть=gI
s=\b(в)се, жд[её]м\.\b=\1сё, ждём\.=gI
s=\b(в)се, за что\b=\1сё, за что=gI
s=\b(в)се, за\b=\1сё, за=gI
s=\b(в)се, заканчиваем\b=\1сё, заканчиваем=gI
s=\b(в)се, закончим\b=\1сё, закончим=gI
s=\b(в)се, замер, лежу\b=\1сё, зАмер, лежу=gI
s=\b(в)се, запомнил\b=\1сё, запомнил=gI
s=\b(в)се, затихло\b=\1сё, затихло=gI
s=\b(в)се, заткнись\b=\1сё, заткнись=gI
s=\b(в)се, зима\b=\1сё, зима=gI
s=\b(в)се, значит, по плану\b=\1сё, значит, по плану=gI
s=\b(в)се, иди отсюда\b=\1сё, иди отсюда=gI
s=\b(в)се, иди\b=\1сё, иди=gI
s=\b(в)се, или ничего\b=\1сё, или ничего=gI
s=\b(в)се, к чему\b=\1сё, к чему=gI
s=\b(в)се, кажется\.\b=\1сё, кажется\.=gI
s=\b(в)се, как надо\b=\1сё, как надо=gI
s=\b(в)се, как\b=\1сё, как=gI
s=\b(в)се, капец\b=\1сё, капец=gI
s=\b(В)се, коз[её]л!\b=Всё, козёл!=gI
s=\b(в)се, коллега\b=\1сё, коллега=gI
s=\b(в)се, конец\b=\1сё, конец=gI
s=\b(в)се, кранты\b=\1сё, кранты=gI
s=\b(в)се, кроме винтовок\b=\1сё, кроме винтовок=gI
s=\b(в)се, кроме оружия\b=\1сё, кроме оружия=gI
s=\b(в)се, кроме часов\b=\1сё, кроме часов=gI
s=\b(в)се, куда делось\?\b=\1сё, куда делось\?=gI
s=\b(в)се, магазин снаряж[её]н\b=\1сё, магазин снаряжён=gI
s=\b(в)се, михаил\. все…\b=\1сё, Михаил\. всё…=gI
s=\b(в)се, мне некогда\b=\1сё, мне некогда=gI
s=\b(в)се, мною в походе добытое\b=\1сё, мною в походе добытое=gI
s=\b(в)се, мо[её] время вышло\b=\1сё, моё время вышло=gI
s=\b(в)се, можно\b=\1сё, можно=gI
s=\b(в)се, мозги\b=\1сё, мозги=gI
s=\b(в)се, молодчик\b=\1сё, молодчик=gI
s=\b(в)се, мужчины, грузитесь\b=\1сё, мужчины, грузитесь=gI
s=\b(в)се, на ветошь\b=\1сё, на ветошь=gI
s=\b(в)се, наконец - закончилось\b=\1сё, наконец - закончилось=gI
s=\b(в)се, не болит\b=\1сё, не болит=gI
s=\b(в)се, не д[её]ргайся\b=\1сё, не дёргайся=gI
s=\b(в)се, не жд[её]м,\b=\1сё, не ждём,=gI
s=\b(в)се, не могу\b=\1сё, не могу=gI
s=\b(в)се, ничего\b=\1сё, ничего=gI
s=\b(в)с[её], ну или почти все\b=\1сё, ну или почти всё=gI
s=\b(В)се, о ч[её]м мы говорили\b=Всё, о чём мы говорили=gI
s=\b(в)се, обдумала\b=\1сё, обдумала=gI
s=\b(в)се, отбегались\b=\1сё, отбегались=gI
s=\b(в)се, отбой\b=\1сё, отбой=gI
s=\b(в)се, отдыхайте все\b=\1сё, отдыхайте все=gI
s=\b(в)се, отработал\b=\1сё, отработал=gI
s=\b(в)се, отходите\b=\1сё, отходите=gI
s=\b(в)се, пакуй\b=\1сё, пакуй=gI
s=\b(в)се, парни\b=\1сё, парни=gI
s=\b(в)се, патрон\b=\1сё, патрон=gI
s=\b(в)се, пиши пропало\b=\1сё, пиши пропало=gI
s=\b(в)се, по здешним\b=\1сё, по здешним=gI
s=\b(в)се, по машинам\b=\1сё, по машинам=gI
s=\b(в)се, повторяю - вс[её]!\b=\1сё, повторяю - всё!=gI
s=\b(в)се, погнали\b=\1сё, погнали=gI
s=\b(в)се, поддерживала\b=\1сё, поддерживала=gI
s=\b(в)се, поехали\b=\1сё, поехали=gI
s=\b(в)се, пожалуй,\b=\1сё, пожалуй,=gI
s=\b(в)се, пойд[её]мте,\b=\1сё, пойдёмте,=gI
s=\b(в)се, полная\b=\1сё, полная=gI
s=\b(в)се, помер\b=\1сё, помер=gI
s=\b(в)се, помчали\b=\1сё, помчали=gI
s=\b(в)се, понеслось\b=\1сё, понеслось=gI
s=\b(в)се, понимаешь, вс[её] сегодня решается\b=\1сё, понимаешь, всё сегодня решается=gI
s=\b(в)се, попытка\b=\1сё, попытка=gI
s=\b(в)се, почти приехала\b=\1сё, почти приехала=gI
s=\b(в)се, пошли\b=\1сё, пошли=gI
s=\b(в)се, представляющее\b=\1сё, представляющее=gI
s=\b(в)се, проваливайте все\b=\1сё, проваливайте все=gI
s=\b(в)се, прогулка\b=\1сё, прогулка=gI
s=\b(в)се, происходящее\b=\1сё, происходящее=gI
s=\b(в)се, пусть так\b=\1сё, пусть так=gI
s=\b(в)се, пусть\b=\1сё, пусть=gI
s=\b(в)се, разговор\b=\1сё, разговор=gI
s=\b(в)се, разумеется, компенсируем\b=\1сё, разумеется, компенсируем=gI
s=\b(в)се, ром, помчали\b=\1сё, Ром, помчали=gI
s=\b(в)се, с головы на ноги\b=\1сё, с головЫ на нОги=gI
s=\b(в)се, с самого начала\b=\1сё, с сАмого начАла=gI
s=\b(в)се, с этим покончено\b=\1сё, с этим покончено=gI
s=\b(в)се, с этим\b=\1сё, с этим=gI
s=\b(в)се, свободен\b=\1сё, свободен=gI
s=\b(в)се, свободны\b=\1сё, свободны=gI
s=\b(в)се, сгорела\b=\1сё, сгорела=gI
s=\b(в)се, сделанное\b=\1сё, сделанное=gI
s=\b(в)се, сейчас засну\b=\1сё, сейчас засну=gI
s=\b(в)се, сейчас переодеваюсь\b=\1сё, сейчас переодеваюсь=gI
s=\b(в)се, сказанное здесь\b=\1сё, сказанное здесь=gI
s=\b(в)се, сказанное\b=\1сё, сказанное=gI
s=\b(в)се, скоро\b=\1сё, скоро=gI
s=\b(в)се, служба начн[её]тся,\b=\1сё, служба начнётся,=gI
s=\b(в)се, собираем\b=\1сё, собираем=gI
s=\b(в)се, собрались\b=\1сё, собрались=gI
s=\b(в)се, спасибо\.\b=\1сё, спасибо\.=gI
s=\b(в)се, спасибо\b=\1сё, спасибо=gI
s=\b(в)се, спи\b=\1сё, спи=gI
s=\b(в)се, способное\b=\1сё, способное=gI
s=\b(в)се, стой!\b=\1сё, стой!=gI
s=\b(в)се, тащи\b=\1сё, тащи=gI
s=\b(в)се, теперь\b=\1сё, теперь=gI
s=\b(в)се, тишина\b=\1сё, тишина=gI
s=\b(в)се, товарищи\b=\1сё, товарищи=gI
s=\b(в)се, тут,\b=\1сё, тут,=gI
s=\b(в)се, у меня дела\b=\1сё, у меня делА=gI
s=\b(в)се, уже и\b=\1сё, уже и=gI
s=\b(в)се, упарился\b=\1сё, упарился=gI
s=\b(в)се, утопили и\b=\1сё, утопили и=gI
s=\b(в)се, уш[её]л\b=\1сё, ушёл=gI
s=\b(в)се, хана!\b=\1сё, ханА!=gI
s=\b(в)се, хватит\b=\1сё, хватит=gI
s=\b(в)се, целуй маму\b=\1сё, целуй маму=gI
s=\b(в)се, чего\b=\1сё, чего=gI
s=\b(в)се, чем\b=\1сё, чем=gI
s=\b(в)се, ч[её]рный\b=\1сё, чёрный=gI
s=\b(в)се, что любим\b=\1сё, что лЮбим=gI
s=\b(в)се, что могло\b=\1сё, что могло=gI
s=\b(в)се, что оставалось\b=\1сё, что оставалось=gI
s=\b(в)се, что случилось\b=\1сё, что случилось=gI
s=\b(в)се, что я\b=\1сё, что я=gI
s=\b(в)се, что\b=\1сё, что=gI
s=\b(в)се, чтобы\b=\1сё, чтобы=gI
s=\b(в)се, шабаш,\b=\1сё, шабаш,=gI
s=\b(в)се, шагай отсюда\b=\1сё, шагай отсюда=gI
s=\b(в)се, щеня\b=\1сё, щеня=gI
s=\b(в)се, юность\b=\1сё, юность=gI
s=\b(в)се, юра\b=\1сё, юра=gI
s=\b(в)се, я больше\b=\1сё, я больше=gI
s=\b(в)се, я держу\b=\1сё, я держу=gI
s=\b(в)се, я пош[её]л\b=\1сё, я пошёл=gI
s=\b(в)се, я\b=\1сё, я=gI
s=\b(в)се\. в\b=\1сё\. В=gI
s=\b(в)се\. все,\b=\1сё\. всё,=gI
s=\b(в)с[её]\. все,\b=\1сё\. всё,=gI
s=\b(в)се\. действуйте\b=\1сё\. Действуйте=gI
s=\b(в)се\. дело\b=\1сё\. Дело=gI
s=\b(в)се\. должны справиться\b=\1сё\. должны справиться=gI
s=\b(в)се\. за дело\b=\1сё\. За дело=gI
s=\b(в)се\. задача\b=\1сё\. Задача=gI
s=\b(в)се\. и тут\b=\1сё\. И тут=gI
s=\b(в)се\. иди\b=\1сё\. Иди=gI
s=\b(в)се\. извините\b=\1сё\. Извините,=gI
s=\b(в)се\. команды\b=\1сё\. Команды=gI
s=\b(в)се\. можешь идти\b=\1сё\. Можешь идти=gI
s=\b(в)се\. молчу\b=\1сё\. молчу=gI
s=\b(в)се\. надеюсь, что все\b=\1сё\. Надеюсь, что всё=gI
s=\b(в)се\. надеюсь,\b=\1сё\. Надеюсь,=gI
s=\b(в)се\. надоело\b=\1сё\. Надоело=gI
s=\b(в)се\. некогда\.\b=\1сё\. Некогда\.=gI
s=\b(в)се\. никакого\b=\1сё\. Никакого=gI
s=\b(в)се\. ничего\b=\1сё\. Ничего=gI
s=\b(в)се\. отбой!\b=\1сё\. Отбой!=gI
s=\b(в)се\. патронов\b=\1сё\. Патронов=gI
s=\b(в)се\. поповичи!\b=\1сё\. Поповичи!=gI
s=\b(в)се\. разговор\b=\1сё\. Разговор=gI
s=\b(в)се\. решил уже\b=\1сё\. Решил уже=gI
s=\b(в)се\. солнце уже\b=\1сё\. Солнце уже=gI
s=\b(в)се\. социалка\b=\1сё\. Социалка=gI
s=\b(в)се\. теперь\b=\1сё\. Теперь=gI
s=\b(в)се\. тихо\b=\1сё\. Тихо=gI
s=\b(в)се\. хватит\b=\1сё\. хватит=gI
s=\b(в)се\. что\b=\1сё\. Что=gI
s=\b(в)се\. шлиссельбург\b=\1сё\. Шлиссельбург=gI
s=\b(в)се\. эти\b=\1сё\. Эти=gI
s=\b(в)се\. я на\b=\1сё\. Я на=gI
s=\b(в)се… в белый\b=\1сё… в белый=gI
s=\b(в)с[её]… ну или почти все\b=\1сё… ну или почти всё=gI
s=\b(в)се… слишком\b=\1сё… Слишком=gI
s=\b(в)се… соответствует\b=\1сё… соответствует=gI
s=\b(в)се: попадос\b=\1сё: попадос=gI
s=\b(в)сеж таки\b=\1сёж таки=gI
s=\b(в)сем белом\b=\1сём белом=gI
s=\b(в)сем все про\b=всем всё про=gI
s=\b(в)сем желании\b=\1сём желании=gI
s=\b(в)сем и все рассказывают\b=всем и всё рассказывают=gI
s=\b(в)сем мире\b=\1сём мире=gI
s=\b(в)сем остальном\b=\1сём остальном=gI
s=\b(в)сем таком\b=\1сём таком=gI
s=\b(в)сех и все\b=всех и всё=gI
s=\bвсплывали все новые\b=всплывали всё новые=gI
s=\bвспоминая все в\b=вспоминая всё в=gI
s=\bвспоминая все это\b=вспоминая всё это=gI
s=\bвспомнив все это\b=вспомнив всё это=gI
s=\bвспомнил все!\b=вспомнил всё!=gI
s=\bвспомнил все\.\b=вспомнил всё\.=gI
s=\bвспомнить все, что\b=вспомнить всё, что=gI
s=\bвспыхнуло одновременно все\b=вспыхнуло одновременно всё=gI
s=\bвстряхн[её]м тут все\?\b=встряхнём тут всё\?=gI
s=\bвы все верно\b=Вы всё верно=gI
s=\bвы все видели\.\b=вы всё видели\.=gI
s=\bвы все же решили\b=Вы всё же решили=gI
s=\bВы все записали\?\b=Вы всё записали\?=gI
s=\bвы все запомнили\b=вы всё запомнили=gI
s=\bвы все наобум\b=вы всё наобум=gI
s=\bвы все не заходите\b=вы всё не заходите=gI
s=\bвы все одно все знаете\b=вы всё одно всё знаете=gI
s=\bвы все пойм[её]те\b=вы всё поймёте=gI
s=\bвы все помните\?\b=вы всё помните\?=gI
s=\bвы все поняли\b=вы всё поняли=gI
s=\bвы все сказали\b=вы всё сказали=gI
s=\bвы все слышали\?\b=вы всё слышали\?=gI
s=\bвы все смотрите\b=вы всё смОтрите=gI
s=\bвы все это\b=вы всё это=gI
s=\bвы как то все\b=вы как то всё=gI
s=\bвы как тоъ все\b=вы как тоъ всё=gI
s=\bвы просрали все\b=вы просрали всё=gI
s=\bвы уже все видели\b=вы уже всё видели=gI
s=\bвыбрасывали не все\.\b=выбрасывали не всё\.=gI
s=\bвываливать все из\b=вываливать всё из=gI
s=\bвываливаю все на\b=вываливаю всё на=gI
s=\bвывалил все на\b=вывалил всё на=gI
s=\bвывезли все давно\.\b=вывезли всё давно\.=gI
s=\bвывезти все из\b=вывезти всё из=gI
s=\bвывернув все из их\b=вывернув всё из их=gI
s=\bвыглядит все бредово\b=выглядит всё бредово=gI
s=\bвыглядит все так\b=выглядит всё так=gI
s=\bвыглядит это все\b=выглядит это всё=gI
s=\bвыговорить все это\b=выговорить всё это=gI
s=\bвыделяется все подавленное\b=выделяется всё подавленное=gI
s=\bвыжать все из\b=выжать всё из=gI
s=\bвыжать из машин все,\b=выжать из машИн всё,=gI
s=\bвыжгло все на\b=выжгло всё на=gI
s=\bвыжечь все на\b=выжечь всё на=gI
s=\bвыжигает все вокруг\b=выжигает всё вокруг=gI
s=\bвыжигали мгновенно все\b=выжигали мгновенно всё=gI
s=\bвыжимаем из машин все\b=выжимаем из машин всё=gI
s=\bвыкашивая все на\b=выкашивая всё на=gI
s=\bвыкинуть все в\b=выкинуть всё в=gI
s=\bвыкинуть все из\b=выкинуть всё из=gI
s=\bвыкладывай мне все\.\b=выкладывай мне всё\.=gI
s=\bвыкладывать все с\b=выкладывать всё с=gI
s=\bвыкрутасах не все\b=выкрутасах не всё=gI
s=\bвылечила все за\b=вылечила всё за=gI
s=\bвыложил все и из\b=выложил всё и из=gI
s=\bвыложил все,\b=выложил всё,=gI
s=\bвыложил все\.\b=выложил всё\.=gI
s=\bвыложил ему все\b=выложил ему всё=gI
s=\bвыложил жене все\.\b=выложил женЕ всё\.=gI
s=\bвыложил мне все\b=выложил мне всё=gI
s=\bвыложил практически все\.\b=выложил практически всё\.=gI
s=\bвыложила все из\b=выложила всё из=gI
s=\bвыметут все,\b=выметут всё,=gI
s=\bвынесено было почти все\.\b=вынесено было почти всё\.=gI
s=\bвыносила все куда то\b=выносила всё куда то=gI
s=\bвыносила все куда тоъ\b=выносила всё куда тоъ=gI
s=\bвыносит все живое\b=вынОсит всё живое=gI
s=\bвынула все из\b=вынула всё из=gI
s=\bвыпито все\.\b=выпито всё\.=gI
s=\bвыплюнул все обратно\b=выплюнул всё обратно=gI
s=\bвыполнил все,\b=выполнил всё,=gI
s=\bвыпустил все содержимое\b=выпустил всё содержимое=gI
s=\bвыпустил все,\b=выпустил всё,=gI
s=\bвыпытаем все помаленьку\b=выпытаем всё помаленьку=gI
s=\bвыпытают все!\b=выпытают всё!=gI
s=\bвырвав все с гораздо\b=вырвав всё с гораздо=gI
s=\bвысказав все сво[её]\b=высказав всё своё=gI
s=\bвыслушала все без\b=выслушала всё без=gI
s=\bвыслушать все с самого\b=выслушать всё с сАмого=gI
s=\bвысосут все тепло\b=высосут всё тепло=gI
s=\bвытащите все с помощью\b=вытащите всё с помощью=gI
s=\bвытрясут все из\b=вытрясут всё из=gI
s=\bвытряхнул все из\b=вытряхнул всё из=gI
s=\bвытягивающая все с\b=вытягивающая всё с=gI
s=\bвытянем из него все\b=вытянем из него всё=gI
s=\bвычистил все вокруг\b=вычистил всё вокруг=gI
s=\bвышло из строя\. все\.\b=вышло из строя\. всё\.=gI
s=\bвыяснил все за\b=выяснил всё за=gI
s=\bвыяснить все до конца\b=выяснить всё до конца=gI
s=\bвыяснить все доподлинно\b=выяснить всё доподлинно=gI
s=\bвыяснить все про\b=выяснить всё про=gI
s=\bвыясню все позже\b=выясню всё позже=gI
s=\bвыяснять все о\b=выяснять всё о=gI
s=\bгангрена поразила все\b=гангрена поразила всё=gI
s=\bгде все абсолютно все\b=где всё абсолютно всё=gI
s=\bгде все даром\b=где всё даром=gI
s=\bгде все просто и знакомо\b=где всё просто и знакомо=gI
s=\bглаза все искали\b=глаза всё искали=gI
s=\bглупости это все\b=глупости это всё=gI
s=\bглушите все,\b=глушите всё,=gI
s=\bгни[её]т все очень\b=гниёт всё очень=gI
s=\bговорить все не начинал\b=говорить всё не начинал=gI
s=\bговоришь все это\b=говоришь всё это=gI
s=\bговоришь мне все это\b=говоришь мне всё это=gI
s=\bговорю это все для\b=говорю это всё для=gI
s=\bгончие все также уверенно\b=гончие всё также уверенно=gI
s=\bгорели все ярче\b=горели всё ярче=gI
s=\bгород все\.\b=город всё\.=gI
s=\bгороде все тихонько\b=городе всё тихонько=gI
s=\bгосподи! все\.\b=Господи! всё\.=gI
s=\bгости все не появлялись\b=гости всё не появлялись=gI
s=\bготов на все\b=готов на всё=gI
s=\bготовить все новые\b=готовить всё новые=gI
s=\bготовый на все\b=готовый на всё=gI
s=\bготовыми на все\b=готовыми на всё=gI
s=\bготовых на все спецназовцев\b=готовых на всё спецназовцев=gI
s=\bгромить все вокруг\b=громить всё вокруг=gI
s=\bгрязное все,\b=грязное всё,=gI
s=\bда все в порядке\b=да всё в порядке=gI
s=\bда все подберут\.\b=да всё подберут\.=gI
s=\bда все руки\b=да всё рУки=gI
s=\bда все с яхтой\b=да всё с яхтой=gI
s=\bда все ясно\b=да всё ясно=gI
s=\bда если бы ещ[её] все\b=да если бы ещё всё=gI
s=\bда пошло все нахер\b=да пОшло всё нахер=gI
s=\bда просто все,\b=да просто всё,=gI
s=\bда, все снято\b=да, всё снято=gI
s=\bдави там все!\b=Дави там всё!=gI
s=\bдавно все доказали\b=давно всё доказали=gI
s=\bдал тебе все\b=дал тебе всё=gI
s=\bдальше все как\b=дальше всё как=gI
s=\bДальше вы все знаете\b=Дальше вы всё знаете=gI
s=\bдальше мы все подготовим\.\b=дальше мы всё подготовим\.=gI
s=\bдаю вам сорок минут все\b=даю вам сорок минут всё=gI
s=\bдают за все одинаково\b=дают за всё одинаково=gI
s=\bдвоих этих все\?\b=двоих этих всё\?=gI
s=\bдевушка все ещ[её]\b=девушка всё ещё=gI
s=\bделает все - черти как\b=делает всё - черти как=gI
s=\bделается все уже\b=делается всё Уже=gI
s=\bделаешь все как\b=делаешь всё как=gI
s=\bделай все не\b=делай всё не=gI
s=\bделал все для\b=делал всё для=gI
s=\bделала все для\b=делала всё для=gI
s=\bделали все от\b=делали всё от=gI
s=\bделали все чтобы\b=делали всё чтобы=gI
s=\bделало все мимол[её]тным\b=делало всё мимолётным=gI
s=\bделать все вдумчиво\b=делать всё вдумчиво=gI
s=\bделать все для\b=делать всё для=gI
s=\bделать с ней все\b=делать с ней всё=gI
s=\bделаю все как\b=делаю всё как=gI
s=\bделаю все это\b=делаю всё это=gI
s=\bделают все на\b=делают всё на=gI
s=\bделающего все вовремя\b=делающего всё вовремя=gI
s=\bдело все в\b=дело всё в=gI
s=\bдело то все больше\b=дело то всё больше=gI
s=\bдело тоъ все больше\b=дело тоъ всё больше=gI
s=\bдемонстрируя все в деталях\b=демонстрируя всё в деталях=gI
s=\bдеревья все закрывают\b=деревья всё закрывают=gI
s=\bдержать все это\b=держать всё это=gI
s=\bдержите все под\b=держите всё под=gI
s=\bдля меня все совершенно естественно\b=для меня всё совершенно естественно=gI
s=\bдля меня все совершенно\b=для меня всё совершенно=gI
s=\bдля него все\.\b=для него всё\.=gI
s=\bдля не[её] все\.\b=для неё всё\.=gI
s=\bдля них возможно все\b=для них возможно всё=gI
s=\bдля них все\.\b=для них всё\.=gI
s=\bдля чего все это\b=для чего всё это=gI
s=\bдн[её]м все больше\b=днём всё больше=gI
s=\bдо того все попадались\b=До того всё попадались=gI
s=\bдо того, как все забыли\b=до того, как всё забыли=gI
s=\bдобиваются все большей\b=добиваются всё большей=gI
s=\bдолжна все сделать\b=должна всё сделать=gI
s=\bдолжны все выяснить\b=должны всё выяснить=gI
s=\bдоложишь все ему\b=доложишь всё ему=gI
s=\bдома все было\b=дОма всё было=gI
s=\bдома все же лучше, чем\b=дОма всё же лучше, чем=gI
s=\bдомой все полезное\b=домой всё полезное=gI
s=\bдосмотреть все до\b=досмотреть всё до=gI
s=\bдостал почти все, оставил только\b=Достал почти всё, оставил только=gI
s=\bдрогнула и все\.\b=дрогнула и всё\.=gI
s=\bдруг другу все\b=друг другу всё=gI
s=\bдурь все это\b=дурь всё это=gI
s=\bдурь это все\b=дурь это всё=gI
s=\bдух все проницает\b=дух всё проницает=gI
s=\bЕго боялись все!\b=Его боялись всё!=gI
s=\bЕго боялись все\.\b=Его боялись всё\.=gI
s=\bЕго боялись все\?\b=Его боялись всё\?=gI
s=\bего все вполне устраивает\b=его всё вполне устраивает=gI
s=\bего все ещ[её]\b=его всё ещё=gI
s=\bего все настойчивей\b=его всё настойчивей=gI
s=\bего все новыми\b=его всё новыми=gI
s=\bе[её] боялись все!\b=её боялись всё!=gI
s=\bе[её] боялись все\.\b=её боялись всё\.=gI
s=\bе[её] боялись все\?\b=её боялись всё\?=gI
s=\bе[её] все замедлялись\b=её всё замедлялись=gI
s=\bей все наследство\b=ей всё наследство=gI
s=\bей все,\b=ей всё,=gI
s=\bей все\.\b=ей всё\.=gI
s=\bей почти все\.\b=ей почти всё\.=gI
s=\bей практически все\.\b=ей практически всё\.=gI
s=\bему бы все жрать\b=ему бы всё жрать=gI
s=\bему все напрямик\b=ему всё напрямик=gI
s=\bему все\.\b=ему всё\.=gI
s=\bему почти все\.\b=ему почти всё\.=gI
s=\bему практически все\.\b=ему практически всё\.=gI
s=\bему припомнят все -\b=ему припомнят всё -=gI
s=\bесли все же рискнут\b=если всё же рискнут=gI
s=\bесли все откроется\b=если всё откроется=gI
s=\bесли все погибнет\b=если всё погибнет=gI
s=\bесли все продолжиться\b=если всё продолжиться=gI
s=\bесли все пройд[её]т\b=если всё пройдёт=gI
s=\bесли все сможешь\b=если всё сможешь=gI
s=\bесли все сошло\b=если всё сошло=gI
s=\bесли вспомнить все, то\b=если вспомнить всё, то=gI
s=\bесли не все, то очень многое\b=если не всё, то очень многое=gI
s=\bесли это все же\b=если это всё же=gI
s=\bесли это все\b=если это всё=gI
s=\bесть все это\b=есть всё это=gI
s=\bесть все!\b=есть всё!=gI
s=\bесть все, для\b=есть всё, для=gI
s=\bещ[её] все впереди\b=ещё всё впереди=gI
s=\bещ[её] не все съели\?\b=ещё не всё съели\?=gI
s=\bещ[её] не все!\b=ещё не всё!=gI
s=\bжаловался, что рубануло все\.\b=жаловался, что рубануло всё\.=gI
s=\bжгло все вокруг\b=жгло всё вокруг=gI
s=\bждать все того же\b=ждать всё того же=gI
s=\bже все без\b=же всё без=gI
s=\bжелезкой все таскают\b=железкой всё таскают=gI
s=\bжечь все налево\b=жечь всё налево=gI
s=\bза все берутся\b=за всё берутся=gI
s=\bза все буду\b=за всё буду=gI
s=\bза все будут\b=за всё будут=gI
s=\bза все в жизни\b=за всё в жизни=gI
s=\bза все в ответе\b=за всё в ответе=gI
s=\bза все в\b=за всё в=gI
s=\bза все вместе\b=за всё вместе=gI
s=\bза все время\b=за всё время=gI
s=\bза все заплатили\b=за всё заплатили=gI
s=\bза все заплатит\b=за всё заплатит=gI
s=\bза все и ответит\b=за всё и ответит=gI
s=\bза все кровью\b=за всё кровью=gI
s=\bза все надо\b=за всё надо=gI
s=\bза все нужно\b=за всё нужно=gI
s=\bза все ответите\b=за всё ответите=gI
s=\bза все отвечать\b=за всё отвечать=gI
s=\bза все отвечаю я\b=За всё отвечаю я=gI
s=\bза все охотно\b=за всё охотно=gI
s=\bза все платить\b=за всё платить=gI
s=\bза все платят\b=за всё платят=gI
s=\bза все плачу\b=за всё плачУ=gI
s=\bза все полагается\b=за всё полагается=gI
s=\bза все премия\b=за всё премия=gI
s=\bза все приходится\b=за всё приходится=gI
s=\bза все про вс[её]\b=за всё про всё=gI
s=\bза вс[её] про все\b=за всё про всё=gI
s=\bза все прошедшее\b=за всё прошедшее=gI
s=\bза все разом\b=за всё разом=gI
s=\bза все расплатились\b=за всё расплатились=gI
s=\bза все самому\b=за всё самому=gI
s=\bза все совещание\b=за всё совещание=gI
s=\bза все спасибо\b=за всё спасибо=gI
s=\bза все сполна\b=за всё сполна=gI
s=\bза все спросит\b=за всё спросит=gI
s=\bза все хвататься\b=за всё хвататься=gI
s=\bза все хорошее\b=за всё хорошее=gI
s=\bза все царствование\b=за всё царствование=gI
s=\bза все это\b=за всё это=gI
s=\bзабиралась все вверх\b=забиралась всё вверх=gI
s=\bзабирать все левее\b=забирать всё левее=gI
s=\bзаболело все опять\b=заболело всё опять=gI
s=\bзабрали все белье\b=забрали всё белье=gI
s=\bзабрать все до\b=забрать всё до=gI
s=\bзабрать все назад\b=забрать всё назад=gI
s=\bзабрызгивая все вокруг\b=забрызгивая всё вокруг=gI
s=\bзабыв про все,\b=забыв про всё,=gI
s=\bзабыв про все\.\b=забыв про всё\.=gI
s=\bзабывают все,\b=забывают всё,=gI
s=\bзабыли про все\.\b=забыли про всё\.=gI
s=\bзабыть все к ч[её]рту\b=забыть всё к чёрту=gI
s=\bзабьют все напрочь\b=забьют всё напрочь=gI
s=\bзавернула все в\b=завернула всё в=gI
s=\bзавершилось все очень\b=завершилось всё очень=gI
s=\bзавещал все городу\b=завещал всё городу=gI
s=\bзавтра все посмотрю\b=завтра всё посмотрю=gI
s=\bзаглушить все алкоголем\b=заглушить всё алкоголем=gI
s=\bзаглядывали все время\b=заглядывали всё время=gI
s=\bзагонять все на\b=загонять всё на=gI
s=\bзагрузил все в\b=загрузил всё в=gI
s=\bзагрузить все в\b=загрузить всё в=gI
s=\bзадавал ему все новые вопросы\b=задавал ему всё новые вопросы=gI
s=\bзадал все через\b=задал всё через=gI
s=\bзадолбало тут все\b=задолбало тут всё=gI
s=\bзадушил все собой\b=задушил всё собой=gI
s=\bзадымило все впереди\b=задымило всё впереди=gI
s=\bзазвенело все сразу\b=зазвенело всё сразу=gI
s=\bзакончилось все очень\b=закончилось всё очень=gI
s=\bзакончилось все плохо\b=закончилось всё плохо=gI
s=\bзакончилось все тем\b=закончилось всё тем=gI
s=\bзакончить все без\b=закончить всё без=gI
s=\bзакручивается все шоу\b=закручивается всё шоу=gI
s=\bзакрывают все вокруг\b=закрывают всё вокруг=gI
s=\bзалив все сваренным\b=залив всё сваренным=gI
s=\bзаливало все вокруг\b=заливало всё вокруг=gI
s=\bзаливало все мертвенным\b=заливало всё мертвенным=gI
s=\bзаливающего все вокруг\b=заливающего всё вокруг=gI
s=\bзаливая все вокруг\b=заливая всё вокруг=gI
s=\bзаливая все своим\b=заливая всё своим=gI
s=\bзалил бы все кровью\b=залил бы всё кровью=gI
s=\bзалила все вокруг\b=залила всё вокруг=gI
s=\bзалила все своим\b=залила всё своим=gI
s=\bзамок все же поддался\b=замОк всё же поддался=gI
s=\bзамутняется все!\b=замутняется всё!=gI
s=\bзамутняется все,\b=замутняется всё,=gI
s=\bзамутняется все\.\b=замутняется всё\.=gI
s=\bзамять все это\b=замять всё это=gI
s=\bзаносит все в\b=заносит всё в=gI
s=\bзаняло все зеркало\b=заняло всё зеркало=gI
s=\bзанято все,\b=занято всё,=gI
s=\bзанято все\.\b=занято всё\.=gI
s=\bзапив все муссом\b=запив всё муссом=gI
s=\bзаписал все в\b=записал всё в=gI
s=\bзаписывал все в\b=записывал всё в=gI
s=\bзапихал все в\b=запихал всё в=gI
s=\bзапиши все тут\b=запиши всё тут=gI
s=\bзаполнил все помещение\b=заполнил всё помещение=gI
s=\bзаполонят все подземелье\b=заполонят всё подземелье=gI
s=\bзапоминал все, где проходил\b=запоминал всё, где проходил=gI
s=\bзапомнил все до\b=запомнил всё до=gI
s=\bзапомнила далеко не все\b=запомнила далеко не всё=gI
s=\bзапомнить все расположение\b=запомнить всё расположение=gI
s=\bзапомнить все с\b=запомнить всё с=gI
s=\bзаражает все вокруг\b=заражает всё вокруг=gI
s=\bзаранее все приготовили\b=заранее всё приготовили=gI
s=\bзаранее все решили\b=заранее всё решили=gI
s=\bзарастает все вл[её]т\b=зарастает всё влёт=gI
s=\bзарисуют все до\b=зарисуют всё до=gI
s=\bзаслонил все\.\b=заслонил всё\.=gI
s=\bзаснять там все как\b=заснять там всё как=gI
s=\bзасыпано все,\b=засыпано всё,=gI
s=\bзатем все вокруг\b=затем всё вокруг=gI
s=\bзатем все тонет\b=затем всё тонет=gI
s=\bзатеявшая все это\b=затеявшая всё это=gI
s=\bзато все поняли\b=Зато всё поняли=gI
s=\bзатолкав все в\b=затолкав всё в=gI
s=\bзатопила все вокруг\b=затопила всё вокруг=gI
s=\bзатопит все вокруг\b=затопит всё вокруг=gI
s=\bзатушите все быстренько\b=затушите всё быстренько=gI
s=\bзатянула все вокруг\b=затянула всё вокруг=gI
s=\bзахлестнуло все мо[её]\b=захлестнуло всё моё=gI
s=\bзаходи, покажу все\.\b=Заходи, покажу всё\.=gI
s=\bзачем все это\b=зачем всё это=gI
s=\bзачем это все\b=зачем это всё=gI
s=\bзач[её]т ид[её]т все\b=зачёт идёт всё=gI
s=\bзвуки все нарастали\b=звуки всё нарастали=gI
s=\bзвучали все громче\b=звучали всё громче=gI
s=\bздесь все без изысков, но\b=здесь всё без изысков, но=gI
s=\bздесь все вновь\b=здесь всё вновь=gI
s=\bздесь все добровольно,\b=здесь всё добровольно,=gI
s=\bздесь все живое\b=здесь всё живое=gI
s=\bздесь все как то неприветливо\b=здесь всё как то неприветливо=gI
s=\bздесь все как тоъ неприветливо\b=здесь всё как тоъ неприветливо=gI
s=\bздесь все куда\b=здесь всё куда=gI
s=\bздесь все наоборот\b=здесь всё наоборот=gI
s=\bздесь все размеренно\.\b=здесь всё размеренно\.=gI
s=\bздесь все рядом\b=здесь всё рядом=gI
s=\bздесь за все отвечаю\b=здесь за всё отвечаю=gI
s=\bздесь прид[её]тся все закрывать\b=здесь придётся всё закрывать=gI
s=\bзнаем почти все\b=знаем почти всё=gI
s=\bзнает все до конца\b=знает всё до конца=gI
s=\bзнает она все\.\b=знает она всё\.=gI
s=\bзнает про эту машину все\.\b=знает про эту машИну всё\.=gI
s=\bзнаешь все о\b=знаешь всё о=gI
s=\bзнаешь все,\b=знаешь всё,=gI
s=\bзнаешь все\.\b=знаешь всё\.=gI
s=\bзнал все об отправке\b=знал всё об отправке=gI
s=\bзнал о н[её]м все\b=знал о нём всё=gI
s=\bзнал о них все\b=знал о них всё=gI
s=\bзнала о н[её]м все\.\b=знала о нём всё\.=gI
s=\bзнали все заранее\b=знали всё заранее=gI
s=\bзнали все о\b=знали всё о=gI
s=\bзнать все о\b=знать всё о=gI
s=\bзнать все об\b=знать всё об=gI
s=\bзнать о нас все\b=знать о нас всё=gI
s=\bзнать о н[её]м все\b=знать о нём всё=gI
s=\bзначил для меня все\b=значил для меня всё=gI
s=\bзначит все серь[её]зно\b=значит всё серьёзно=gI
s=\bзнаю все о\b=знаю всё о=gI
s=\bзнаю все про\b=знаю всё про=gI
s=\bзнаю о ней все\b=знаю о ней всё=gI
s=\bзнаю о н[её]м все\.\b=знаю о нём всё\.=gI
s=\bзнаю о н[её]м все\b=знаю о нём всё=gI
s=\bзнаю я все,\b=знаю я всё,=gI
s=\bзная все напер[её]д\b=зная всё наперёд=gI
s=\bзная все о\b=зная всё о=gI
s=\bзря это все\b=зря это всё=gI
s=\bзурабы все сделали\b=зурабы всё сделали=gI
s=\bи все - никуда от\b=и всё - никуда от=gI
s=\bи все - приплыли\.\b=и всё - приплыли\.=gI
s=\bи все - ради тех\b=и всё - ради тех=gI
s=\bи все - ты\b=и всё - ты=gI
s=\bи все более\b=и всё более=gI
s=\bи все больше\b=и всё больше=gI
s=\bи все большую\b=и всё бОльшую=gI
s=\bи все бы\b=и всё бы=gI
s=\bи все в принципе\b=и всё в принципе=gI
s=\bи все в твоих\b=и всё в твоих=gI
s=\bи все важное\b=и всё важное=gI
s=\bи все во имя\b=и всё во имя=gI
s=\bи все время\b=и всё время=gI
s=\bи все вслушивался\b=и всё вслушивался=gI
s=\bи все ещ[её]\b=и всё ещё=gI
s=\bи все же просто так\b=и всё же просто так=gI
s=\bи все же\b=И всё же=gI
s=\bи все за какой то\b=и всё за какой то=gI
s=\bи все за какой тоъ\b=и всё за какой тоъ=gI
s=\bи все заканчивают\b=и всё заканчивают=gI
s=\bи все закрывать\b=и всё закрывать=gI
s=\bи все заставляли\b=и всё заставляли=gI
s=\bи все из за\b=и всё из за=gI
s=\bи все изменившееся\b=и всё изменившееся=gI
s=\bи все им расскажут\b=и всё им расскажут=gI
s=\bи все лесом\b=и всё лесом=gI
s=\bи все мгновенно,\b=и всё мгновенно,=gI
s=\bи все меньше\b=и всё меньше=gI
s=\bи все мимол[её]тно,\b=и всё мимолётно,=gI
s=\bи все на основе\b=и всё на основе=gI
s=\bи все напрасно\b=и всё напрасно=gI
s=\bи все никак\b=и всё никак=gI
s=\bи все о них знаешь\b=и всё о них знаешь=gI
s=\bи все ожидал\b=и всё ожидал=gI
s=\bи все окажется\b=и всё окажется=gI
s=\bи все переворачивается\b=и всё переворачивается=gI
s=\bи все писал\b=и всё писал=gI
s=\bи все повторяла\b=и всё повторяла=gI
s=\bи все показывать\b=и всё показывать=gI
s=\bи все понимаем\b=и всё понимаем=gI
s=\bи все поняли\.\b=и всё поняли\.=gI
s=\bи все потекло\b=и всё потекло=gI
s=\bи все потому\b=и всё потому=gI
s=\bи все прекратится\b=и всё прекратится=gI
s=\bи все прид[её]т\b=и всё придёт=gI
s=\bи все притулялась\b=и всё притулялась=gI
s=\bи все просил\b=и всё просил=gI
s=\bи все разузнаю\b=и всё разузнаю=gI
s=\bи все сво[её]\b=и всё своё=gI
s=\bи все снаряжение\b=и всё снаряжение=gI
s=\bи все сразу ясно\b=и всё сразу ясно=gI
s=\bи все такое\b=и всё такое=gI
s=\bи все тебе в\b=и всё тебе в=gI
s=\bи все труднее\b=и всё труднее=gI
s=\bи все тут!\b=и всё тут!=gI
s=\bи все тут\b=и всё тут=gI
s=\bи все у тебя\.\b=и всё у тебя\.=gI
s=\bи все узнаете\b=и всё узнАете=gI
s=\bи все укрытие\b=и всё укрытие=gI
s=\bи все услышать\.\b=и всё услышать\.=gI
s=\bи все!\b=И всё!=gI
s=\bи все, зараза обеспечена\b=и всё, зараза обеспечена=gI
s=\bи все…\b=и всё…=gI
s=\bи все\.\b=и всё\.=gI
s=\bи все\?\b=и всё\?=gI
s=\bи потерявших все\b=и потерявших всё=gI
s=\bи проверить все перед их\b=и проверить всё перед их=gI
s=\bи сделал все наоборот\b=и сделал всё наоборот=gI
s=\bи сделал все, чтобы\b=и сделал всё, чтобы=gI
s=\bи так все знаем\b=и так всё знаем=gI
s=\bи так все ясно\b=и так всё ясно=gI
s=\bи то не все\.\b=и то не всё\.=gI
s=\bи уничтожил все\.\b=и уничтожил всё\.=gI
s=\bи это все чем вы\b=и это всё чем вы=gI
s=\bи, все тут\b=и, всё тут=gI
s=\bи… все\.\b=и… всё\.=gI
s=\bидел все словно\b=идел всё словно=gI
s=\bиз башки все вон\b=из башки всё вон=gI
s=\bиз вас все клещами\b=из вас всё клещами=gI
s=\bиз за тебя все!\b=из за тебя всё!=gI
s=\bиз него все вытрясли\b=из него всё вытрясли=gI
s=\bиз него все, до\b=из него всё, до=gI
s=\bизверг все съеденное\b=извЕрг всё съеденное=gI
s=\bизвестно все и о вас\b=известно всё и о вас=gI
s=\bизвестно все!\b=известно всё!=gI
s=\bизвестно все\.\b=известно всё\.=gI
s=\bизвлечь оттуда все\b=извлечь оттуда всё=gI
s=\bизгибаясь все больше\b=изгибаясь всё больше=gI
s=\bизготавливать все слишком\b=изготавливать всё слишком=gI
s=\bизлазив все вокруг\b=излазив всё вокруг=gI
s=\bизлазил все вдоль\b=излазил всё вдоль=gI
s=\bизменил все\.\b=изменил всё\.=gI
s=\bизменить здесь все\b=изменить здесь всё=gI
s=\bизнутри все в крови\b=изнутри всё в крови=gI
s=\bизрасходовать все полностью\b=израсходовать всё полностью=gI
s=\bили все же\b=Или всё же=gI
s=\bим бы все за\b=им бы всё за=gI
s=\bим все мимо\.\b=им всё мимо\.=gI
s=\bим все это\b=им всё это=gI
s=\bимеет ли это все\b=имеет ли это всё=gI
s=\bимеется, да не все\.\b=имеется, да не всё\.=gI
s=\bиметь все сразу\b=иметь всё сразу=gI
s=\bиначе бы все, каюк\b=иначе бы всё, каюк=gI
s=\bинтересно ему все, маленькому\b=Интересно ему всё, маленькому=gI
s=\bинформация все же быстро\b=информация всё же быстро=gI
s=\bискина все,\b=искина всё,=gI
s=\bиспоганить все на корню\b=испоганить всё на корнЮ=gI
s=\bиспользуют все что могут\b=используют всё что могут=gI
s=\bисправил все до\b=исправил всё до=gI
s=\bисчез и все\b=исчез и всё=gI
s=\bих боялись все!\b=их боялись всё!=gI
s=\bих боялись все\.\b=их боялись всё\.=gI
s=\bих боялись все\?\b=их боялись всё\?=gI
s=\bих все не спасают\b=их всё не спасают=gI
s=\bих все под землю\b=их всё под землю=gI
s=\bих все теми же\b=их всё теми же=gI
s=\bк черту все!\b=к чёрту всё!=gI
s=\bкадры решают все\b=кадры решают всё=gI
s=\bкаждый день все\b=каждый день всё=gI
s=\bкажется все, а\b=кажется всё, а=gI
s=\bкажутся все слабее\b=кажутся всё слабее=gI
s=\bказалось, все\.\b=казалось, всё\.=gI
s=\bкак будто бы и все\b=как будто бы и всё=gI
s=\bкак все ваше\b=как всё ваше=gI
s=\bкак все видит\b=как всё видит=gI
s=\bкак все глупо\b=как всё глупо=gI
s=\bкак все делаем\?\b=как всё делаем\?=gI
s=\bкак все запущено\b=как всё запущено=gI
s=\bкак все здесь, а\?\b=как всё здесь, а\?=gI
s=\bкак все ид[её]т\b=как всё идёт=gI
s=\bкак все ладно\b=как всё ладно=gI
s=\bкак все несправедливо\b=как всё несправедливо=gI
s=\bкак все оберн[её]тся\b=как всё обернётся=gI
s=\bкак все остопи…\b=Как всё остопиздело=gI
s=\bкак все перемещается\b=как всё перемещается=gI
s=\bкак все сделали,\b=как всё сделали,=gI
s=\bкак все сложно\b=как всё сложно=gI
s=\bкак все соедин[её]нное\b=как всё соединённое=gI
s=\bкак все угробят\b=как всё угробят=gI
s=\bкак и все в н[её]м\b=как и всё в нем=gI
s=\bкак и все в этом месте\b=как и всё в этом месте=gI
s=\bкак и все во вселенной\b=как и всё во вселенной=gI
s=\bкак и все вокруг\b=как и всё вокруг=gI
s=\bкак и все кругом\b=как и всё кругОм=gI
s=\bкак они все лихо\b=как они всё лихо=gI
s=\bкак то все другие\b=как то всё другие=gI
s=\bкак то все просто\b=как то всё просто=gI
s=\bкак то все… никак\b=как то всё… никак=gI
s=\bкак тоъ все другие\b=как тоъ всё другие=gI
s=\bкак тоъ все просто\b=как тоъ всё просто=gI
s=\bкак тоъ все… никак\b=как тоъ всё… никак=gI
s=\bкак это все\b=как это всё=gI
s=\bкакое все это\b=какое всё это=gI
s=\bкапли все падали\b=капли всё падали=gI
s=\bкатера все подходили\b=катерА всё подходили=gI
s=\bкидайте все в\b=кидайте всё в=gI
s=\bкислота все снаружи\b=кислота всё снаружи=gI
s=\bкляня все на\b=кляня всё на=gI
s=\bкляня все последними\b=кляня всё последними=gI
s=\bкнигах все печатают\b=книгах всё печатают=gI
s=\bко все ещ[её]\b=ко всё ещё=gI
s=\bкогда все на мой сч[её]т\b=когда всё на мой счёт=gI
s=\bкогда все оформлял\b=когда всё оформлял=gI
s=\bкогда все решали какие то\b=когда всё решали какие то=gI
s=\bкогда все решали какие тоъ\b=когда всё решали какие тоъ=gI
s=\bкогда все это случилось\b=когда всё это случилось=gI
s=\bкогда ж все это выкопали\b=когда ж всё это выкопали=gI
s=\bкогда же все это\b=когда же всё это=gI
s=\bкогда же все\b=когда же всё=gI
s=\bколонны все стоят\b=колонны всё стоЯт=gI
s=\bкончилось это все\b=кончилось это всё=gI
s=\bкоторая все ещ[её]\b=которая всё ещё=gI
s=\bкоторая все на\b=которая всё на=gI
s=\bкоторые все время\b=которые всё время=gI
s=\bкоторые все ещ[её]\b=которые всё ещё=gI
s=\bкоторые все лечат\b=которые всё лечат=gI
s=\bкоторые все сильнее\b=которые всё сильнее=gI
s=\bкоторые всегда все\b=которые всегда всё=gI
s=\bкоторый все ещ[её]\b=который всё ещё=gI
s=\bкоторый все теперь\b=который всё теперь=gI
s=\bкриво все как то,\b=Криво всё как то,=gI
s=\bкриво все как то\b=Криво всё как то=gI
s=\bкриво все как тоъ,\b=Криво всё как тоъ,=gI
s=\bкриво все как тоъ\b=Криво всё как тоъ=gI
s=\bкриминалитетом все серь[её]зно\b=криминалитетом всё серьёзно=gI
s=\bкруша все на сво[её]м\b=круша всё на своём=gI
s=\bкрушить все вокруг\b=крушить всё вокруг=gI
s=\bкрысы все съедят\b=крысы всё съедят=gI
s=\bкто все это\b=кто всё это=gI
s=\bкупит все\.\b=купит всё\.=gI
s=\bкупить все для\b=купить всё для=gI
s=\bкупить все это\b=купить всё это=gI
s=\bкусты все укроют\b=кусты всё укроют=gI
s=\bлады все больше\b=лАды всё больше=gI
s=\bли все это\b=ли всё это=gI
s=\bлицо все было\b=лицо всё было=gI
s=\bлично все руками\b=лично всё руками=gI
s=\bлишнее это все\b=лишнее это всё=gI
s=\bлобовое все в\b=лобовое всё в=gI
s=\bложь жестокость все\b=ложь жестокость всё=gI
s=\bлопал все на\b=лопал всё на=gI
s=\bлучше все же\b=лучше всё же=gI
s=\bлюди все ещ[её]\b=люди всё ещё=gI
s=\bмаршруты все больше одинаковые\b=маршруты всё больше одинаковые=gI
s=\bмахнуть все на\b=махнуть всё на=gI
s=\bменя все это\b=меня всё это=gI
s=\bменя устроит все\b=меня устроит всё=gI
s=\bместе все и решим\b=месте всё и решим=gI
s=\bмире возможно все,\b=мире возможно всё,=gI
s=\bмне абсолютно все\b=мне абсолютно всё=gI
s=\bмне все больше\b=мне всё больше=gI
s=\bмне все было\b=мне всё было=gI
s=\bмне все ещ[её]\b=мне всё ещё=gI
s=\bмне все же\b=мне всё же=gI
s=\bмне все на\b=мне всё на=gI
s=\bмне все откровенно выкладываете,\b=мне всё откровенно выкладываете,=gI
s=\bмне все покоя\b=мне всё покоя=gI
s=\bмне все про\b=мне всё про=gI
s=\bмне все рассказали\b=мне всё рассказали=gI
s=\bмне все рассказывают\?\b=мне всё рассказывают\?=gI
s=\bмне все это\b=мне всё это=gI
s=\bмне не все ясно\b=мне не всё ясно=gI
s=\bмногие из них все косились\b=многие из них всё косились=gI
s=\bмногое, если не все\b=многое, если не всё=gI
s=\bмог бы все тогда\b=мог бы всё тогда=gI
s=\bмог все!\b=мог всё!=gI
s=\bмог все\.\b=мог всё\.=gI
s=\bмогло быть все\b=могло быть всё=gI
s=\bмогло все и закончиться\b=могло всё и закончиться=gI
s=\bмогуг все!\b=могуг всё!=gI
s=\bмогуг все\.\b=могуг всё\.=gI
s=\bмода все говорить\b=мода всё говорить=gI
s=\bможет все брать\b=может всё брать=gI
s=\bможет все же не стоит\?\b=может всё же не стОит\?=gI
s=\bможет все испортить\b=может всё испортить=gI
s=\bможет все!\b=может всё!=gI
s=\bможет все\.\b=может всё\.=gI
s=\bможет и не так все и\b=может и не так всё и=gI
s=\bмозг все ещ[её]\b=мозг всё ещё=gI
s=\bмол, нормально все\.\b=мол, нормально всё\.=gI
s=\bмолитва все более\b=молитва всё более=gI
s=\bмолодца\. все,\b=Молодца\. всё,=gI
s=\bмонтировать все капитально\b=монтировать всё капитально=gI
s=\bмою все разом\b=мОю всё разом=gI
s=\bмужики все втирают\b=мужики всё втирают=gI
s=\bмужики все сожрали\b=мужики всё сожрали=gI
s=\bмы все время\b=мы всё время=gI
s=\bмы все заварили\b=мы всё заварили=gI
s=\bмы все здесь выяснили\b=мы всё здесь выяснили=gI
s=\bмы все меняем\b=мы всё меняем=gI
s=\bмы все настроем\b=мы всё настроем=gI
s=\bмы все обсудили\b=мы всё обсудили=gI
s=\bмы все оплатили,\b=Мы всё оплатили,=gI
s=\bмы все понимаем\.\b=мы всё понимаем\.=gI
s=\bмы все поняли,\b=мы всё поняли,=gI
s=\bмы все собираем,\b=Мы всё собираем,=gI
s=\bмы здесь все на полпути бросили\.\b=мы здесь всё на полпути бросили\.=gI
s=\bмы не все видим\b=мы не всё видим=gI
s=\bмы прекрасно все понимаем\.\b=мы прекрасно всё понимаем\.=gI
s=\bна все без возражений\b=на всё без возражений=gI
s=\bна все божья воля\b=на всё божья воля=gI
s=\bна все была\b=на всё была=gI
s=\bна все вам\b=на всё вам=gI
s=\bна все взирал\b=на всё взирал=gI
s=\bна все вокруг\b=на всё вокруг=gI
s=\bна все воля\b=на всё воля=gI
s=\bна все время\b=на всё время=gI
s=\bна все глаза\b=на всё глазА=gI
s=\bна все горазда\b=на всё горазда=gI
s=\bна все готов\b=на всё готов=gI
s=\bна все готовы\b=на всё готовы=gI
s=\bна все готовые\b=на всё готовые=gI
s=\bна все готовый\b=на всё готовый=gI
s=\bна все готовыми\b=на всё готовыми=gI
s=\bна все готовых\b=на всё готовых=gI
s=\bна все для тебя\b=на всё для тебя=gI
s=\bна все ей\b=на всё ей=gI
s=\bна все есть\b=на всё есть=gI
s=\bна все жалуются\b=на всё жалуются=gI
s=\bна все заречье\b=на всё Заречье=gI
s=\bна все и\b=на всё и=gI
s=\bна все искусство\b=на всё искусство=gI
s=\bна все испуганным\b=на всё испуганным=gI
s=\bна все клал\b=на всё клал=gI
s=\bна все лапу\b=на всё лапу=gI
s=\bна все мог пойти\b=на всё мог пойти=gI
s=\bна все на это\b=на всё на это=gI
s=\bна все наплевать\b=на всё наплевать=gI
s=\bна все население\b=на всё население=gI
s=\bна все не претендую\b=На всё не претендую=gI
s=\bна все не хватало\b=на всё не хватало=gI
s=\bна все негодяев\b=на всё негодяев=gI
s=\bна все общежитие\b=на всё общежитие=gI
s=\bна все одна\b=на всё одна=gI
s=\bна все озеро\b=на всё озеро=gI
s=\bна все оружие\b=на всё оружие=gI
s=\bна все отвечать\b=на всё отвечать=gI
s=\bна все отзывается\b=на всё отзывается=gI
s=\bна все перед\b=на всё перед=gI
s=\bна все плевать\b=на всё плевать=gI
s=\bна все плюнуть\b=на всё плюнуть=gI
s=\bна все подряд\b=на всё подряд=gI
s=\bна все пойд[её]шь\b=на всё пойдёшь=gI
s=\bна все пойду\b=на всё пойду=gI
s=\bна все пойдут\b=на всё пойдут=gI
s=\bна все поселение\b=на всё поселение=gI
s=\bна все посмотрите\b=на всё посмотрИте=gI
s=\bна все прихоти хватает\b=на всё прихоти хватает=gI
s=\bна все про все\b=на всё про всё=gI
s=\bна вс[её] про все\b=на всё про всё=gI
s=\bна все ради\b=на всё ради=gI
s=\bна все рукой\b=на всё рукой=gI
s=\bна все с\b=на всё с=gI
s=\bна все свой тариф\b=на всё свой тариф=gI
s=\bна все сердцем\b=на всё сердцем=gI
s=\bна все смотреть\b=на всё смотреть=gI
s=\bна все смотри\b=на всё смотри=gI
s=\bна все собственными\b=на всё собственными=gI
s=\bна все совещание\b=на всё совещание=gI
s=\bна все согласен\b=на всё согласен=gI
s=\bна все согласны\b=на всё согласны=gI
s=\bна все согласные\b=на всё согласные=gI
s=\bна все соглашусь\b=на всё соглашусь=gI
s=\bна все соедин[её]нное\b=на всё соединённое=gI
s=\bна все способен\b=на всё способен=gI
s=\bна все способны\b=на всё способны=gI
s=\bна все существенно\b=на всё существенно=gI
s=\bна все тебе\b=на всё тебе=gI
s=\bна все у\b=на всё у=gI
s=\bна все убили\b=на всё убили=gI
s=\bна все уже\b=на всё уже=gI
s=\bна все ущелье\b=на всё ущелье=gI
s=\bна все философски\b=на всё философски=gI
s=\bна все через\b=на всё через=gI
s=\bна все что\b=на всё что=gI
s=\bна все это\b=на всё это=gI
s=\bна всем\b=на всём=gI
s=\bна кассетах все\b=на кассетах всё=gI
s=\bна себя все одеяло\b=на себя всё одеяло=gI
s=\bна сегодня все,\b=на сегодня всё,=gI
s=\bна сегодня это все\b=на сегодня это всё=gI
s=\bна словах все быстро\.\b=На словах всё быстро\.=gI
s=\bна улице все собирать\.\b=на улице всё собирать\.=gI
s=\bна этом все,\b=на этом всё,=gI
s=\bна этом все\.\b=на этом всё\.=gI
s=\bна этом пока все\b=на этом пока всё=gI
s=\bна этом, наверное, все\.\b=на этом, наверное, всё\.=gI
s=\bнабирает все большие\b=набирает всё большие=gI
s=\bнаблюдал все как бы\b=наблюдал всё как бы=gI
s=\bнаблюдать все это\b=наблюдать всё это=gI
s=\bнавалилось все так\b=навалилось всё так=gI
s=\bнадо бы все изучить\b=надо бы всё изучить=gI
s=\bнадо все и сразу\b=надо всё и сразу=gI
s=\bнадо все на месте\b=надо всё на месте=gI
s=\bнадо все собрать\b=надо всё собрать=gI
s=\bнадо все хорошенько\b=надо всё хорошенько=gI
s=\bнадоело мне тут все\b=надоело мне тут всё=gI
s=\bнаедине изъяснял все\b=наедине изъяснял всё=gI
s=\bназываете все это\b=называете всё это=gI
s=\bназывалось это все\b=называлось это всё=gI
s=\bнайд[её]те\. все\.\b=найдёте\. всё\.=gI
s=\bнакрыв это все\b=накрыв это всё=gI
s=\bнакрывшем все вокруг\b=накрывшем всё вокруг=gI
s=\bнам все покажут\b=нам всё покажут=gI
s=\bнам все хотя\b=нам всё хотя=gI
s=\bнам привезут все\.\b=нам привезут всё\.=gI
s=\bнам это все\b=нам это всё=gI
s=\bнаоборот все\.\b=наоборот всё\.=gI
s=\bнаписал все на\b=Написал всё на=gI
s=\bнаплевать на все и\b=наплевать на всё и=gI
s=\bнаплюй на все\b=наплюй на всё=gI
s=\bнапутают все, что\b=напутают всё, что=gI
s=\bнарод все больше\b=народ всё больше=gI
s=\bнас все впереди\b=нас всё впереди=gI
s=\bнас на все\b=нас на всё=gI
s=\bнасквозь все - от\b=насквозь всё - от=gI
s=\bнасколько все буквально\b=насколько всё буквально=gI
s=\bнаследство все от того же\b=наследство всё от того же=gI
s=\bначал все с\b=начал всё с=gI
s=\bначали все к той же\b=начали всё к той же=gI
s=\bначалось все с того\b=началось всё с того=gI
s=\bначалось все с\b=началось всё с=gI
s=\bначать все с нуля\b=начать всё с нуля=gI
s=\bначать все с\b=начать всё с=gI
s=\bначинается все с\b=начинается всё с=gI
s=\bначинай все снова\b=начинай всё снова=gI
s=\bначинать все заново\b=начинать всё заново=gI
s=\bначинать все с начала\b=начинать всё с начАла=gI
s=\bначн[её]м все сначала\b=начнём всё сначала=gI
s=\bнаше все поведение\b=наше всё поведение=gI
s=\bнаше все при нас\b=Наше всё при нас=gI
s=\bнаши все сделают\b=Наши всё сделают=gI
s=\bнаших все оставили\.\b=наших всё оставили\.=gI
s=\bнашла все в прежнем\b=нашла всё в прежнем=gI
s=\bнашли здесь все\b=нашли здесь всё=gI
s=\bне абсурд ли это все\b=Не абсурд ли это всё=gI
s=\bне буду\. все\.\b=не буду\. всё\.=gI
s=\bне во все въехали\b=не во всё въехали=gI
s=\bне все бь[её]тся\b=не всё бьётся=gI
s=\bне все в жизни\b=не всё в жизни=gI
s=\bне все возможное\b=не всё возможное=gI
s=\bне все вывезли\?\b=Не всё вывезли\?=gI
s=\bне все гладко\b=не всё гладко=gI
s=\bне все ей\b=не всё ей=gI
s=\bне все ещ[её] окончено\b=не всё ещё окончено=gI
s=\bне все ж смотреть\b=не всё ж смотреть=gI
s=\bне все зависит\b=не всё зависит=gI
s=\bне все ладно\b=не всё ладно=gI
s=\bне все ли равно\b=не всё ли равно=gI
s=\bне все масленица\b=не всё масленица=gI
s=\bне все можем сделать\b=не всё можем сделать=gI
s=\bне все назидает\b=не всё назидает=gI
s=\bне все нам транспортники топить\b=Не всё нам транспортники топить=gI
s=\bне все обстоит\b=не всё обстоит=gI
s=\bне все обсудили\b=не всё обсудили=gI
s=\bне все по сердцу\b=не всё по сердцу=gI
s=\bне все поведали\b=не всё поведали=gI
s=\bне все полезно\b=не всё полезно=gI
s=\bне все решают\b=не всё решают=gI
s=\bне все сказал\b=не всё сказал=gI
s=\bне все сказала\b=не всё сказала=gI
s=\bне все сказали\b=не всё сказали=gI
s=\bне все сразу\b=не всё сразу=gI
s=\bне все стало\b=не всё стало=gI
s=\bне все так просто\b=не всё так просто=gI
s=\bне все там чисто\b=не всё там чисто=gI
s=\bне все ужас\b=не всё ужас=gI
s=\bне все ясно\b=не всё ясно=gI
s=\bне все\. далеко не вс[её]\b=не всё\. далеко не всё=gI
s=\bне выложит все\b=не выложит всё=gI
s=\bне может и все!\b=не может и всё!=gI
s=\bне нравится и все\b=не нравится и всё=gI
s=\bне сделали все\b=не сделали всё=gI
s=\bне так все откровенно\b=не так всё откровенно=gI
s=\bневесело это все\b=невесело это всё=gI
s=\bневозможно все увидеть\b=невозможно всё увидеть=gI
s=\bнельзя все в\b=нельзя всё в=gI
s=\bнельзя все считать\b=нельзя всё считать=gI
s=\bнепонятно все как то\b=непонятно всё как то=gI
s=\bнепонятно все как тоъ\b=непонятно всё как тоъ=gI
s=\bнеправильно все делаем\b=неправильно всё делаем=gI
s=\bнервы, все нервы\b=нервы, всё нервы=gI
s=\bнесложно все найти\b=несложно всё найти=gI
s=\bнеужели все на\b=неужели всё на=gI
s=\bнеужели все разрешится\b=неужели всё разрешится=gI
s=\bних тут все\.\b=них тут всё\.=gI
s=\bно вернись все назад\b=но вернись всё назад=gI
s=\bно все в плюс\b=но всё в плюс=gI
s=\bно все вино\b=но всё вино=gI
s=\bно все вместе километров\b=но всё вместе километров=gI
s=\bно все гвоздят и гвоздят\b=но всё гвоздят и гвоздят=gI
s=\bно все ещ[её] продолжала\b=но всё ещё продолжала=gI
s=\bно все ещ[её] раздраж[её]нно\b=но всё ещё раздражённо=gI
s=\bно все же знаком\b=но всё же знакОм=gI
s=\bно все же могут\b=но всё же могут=gI
s=\bно все же пов[её]л\b=но всё же повёл=gI
s=\bно все же полез\b=но всё же полез=gI
s=\bно все же страны\b=но всё же стрАны=gI
s=\bно все же\b=но всё же=gI
s=\bно все закрыть не могли\b=но всё закрыть не могли=gI
s=\bно все кругом было\b=но всё кругом было=gI
s=\bно все молча\.\b=но всё молча\.=gI
s=\bно все на замок\b=но всё на замОк=gI
s=\bно все наоборот\b=но всё наоборот=gI
s=\bно все опять же оказалось\b=но всё опять же оказалось=gI
s=\bно все постепенно\.\b=но всё постепенно\.=gI
s=\bно все руки не доходили\b=но всё рУки не доходили=gI
s=\bно все стояла\b=но всё стояла=gI
s=\bно все это\b=Но всё это=gI
s=\bно вы все оформите\b=но вы всё оформите=gI
s=\bно делал все:\b=но делал всё:=gI
s=\bно и это не все\.\b=Но и это не всё\.=gI
s=\bно не все так просто\b=но не всё так просто=gI
s=\bно пей все\.\b=но пей всё\.=gI
s=\bно понимали все\. или почти все\b=но понимали всё\. Или почти всё=gI
s=\bно сделал все\b=но сделал всё=gI
s=\bно скучно все\b=но скучно всё=gI
s=\bно этим все и ограничивалось\b=но этим всё и ограничивалось=gI
s=\bно это все\b=но это всё=gI
s=\bно это ещ[её] не все\b=но это ещё не всё=gI
s=\bно это и все!\b=Но это и всё!=gI
s=\bно это на все:\b=но это на всё:=gI
s=\bно этот все\.\b=Но этот всё\.=gI
s=\bно, все же,\b=Но, всё же,=gI
s=\bноги и все остальное\b=нОги и всё остальное=gI
s=\bноги, все ещ[её]\b=ноги, всё ещё=gI
s=\bнормально все вроде\b=нормально всё вроде=gI
s=\bнормально все с ним\b=нормально всё с ним=gI
s=\bнормально все!\b=нормально всё!=gI
s=\bнормально все,\b=нормально всё,=gI
s=\bнормально со мной все\b=нормально со мной всё=gI
s=\bнормально там все и\b=нормально там всё и=gI
s=\bнормально у нас тут все\b=нормально у нас тут всё=gI
s=\bну - все, все\b=Ну - всё, всё=gI
s=\bну все хватит\b=ну всё хватит=gI
s=\bну вс[её], все\.\b=Ну всё, всё\.=gI
s=\bну все, изош[её]л\b=ну всё, изошёл=gI
s=\bну все,\b=ну всё,=gI
s=\bну все…\b=ну всё…=gI
s=\bну, в принципе все,\b=Ну, в принципе всё,=gI
s=\bну, вот и все\.\b=Ну, вот и всё\.=gI
s=\bну, все\. все\.\b=Ну, всё\. всё\.=gI
s=\bну, все…\b=Ну, всё…=gI
s=\bну, все:\b=Ну, всё:=gI
s=\bнужно все,\b=нужно всё,=gI
s=\bнюхает все на\b=нюхает всё на=gI
s=\bо всем\b=о всём=gI
s=\bо н[её]м все!\b=о нём всё!=gI
s=\bо нем все,\b=о нем всё,=gI
s=\bо н[её]м все,\b=о нём всё,=gI
s=\bо н[её]м все\.\b=о нём всё\.=gI
s=\bо тебе все вызнаю\b=о тебе всё вызнаю=gI
s=\bобведя все вокруг\b=обведя всё вокруг=gI
s=\bобговаривайте все со\b=обговаривайте всё со=gI
s=\bобговорили все\.\b=обговорили всё\.=gI
s=\bобговорить все успеем\b=обговорить всё успеем=gI
s=\bобделал тут все\b=обделал тут всё=gI
s=\bобдумал все это\b=обдумал всё это=gI
s=\bобдумал все\.\b=обдумал всё\.=gI
s=\bобдумать все что\b=обдумать всё что=gI
s=\bобдумывая все снова\b=обдумывая всё снова=gI
s=\bоблазили все судно\b=Облазили всё судно=gI
s=\bоблить все горючей\b=облить всё горючей=gI
s=\bобменивали все:\b=обменивали всё:=gI
s=\bобнюхали все вокруг\b=обнюхали всё вокруг=gI
s=\bобо всем другом\b=обо всём другОм=gI
s=\bобо всем\b=обо всём=gI
s=\bобставит все в\b=обставит всё в=gI
s=\bобставить все мастерски\b=обставить всё мастерски=gI
s=\bобставить все так\b=обставить всё так=gI
s=\bобсудил все с\b=обсудил всё с=gI
s=\bобсуждаем все -\b=обсуждаем всё -=gI
s=\bобустроить все внутри\b=обустроить всё внутри=gI
s=\bобшаривая все вокруг\b=обшаривая всё вокруг=gI
s=\bобшарьте все здание\b=обшарьте всё здание=gI
s=\bобъявили не все\b=объявили не всё=gI
s=\bобъяснил все штурману\b=объяснил всё штурману=gI
s=\bобъяснило сразу все\b=объяснило сразу всё=gI
s=\bобъяснит все как\b=объяснит всё как=gI
s=\bобъяснить все письмом\b=объяснить всё письмом=gI
s=\bобыскать все до\b=обыскать всё до=gI
s=\bоглядел все помещение\b=оглядел всё помещение=gI
s=\bоглядела все вокруг\b=оглядела всё вокруг=gI
s=\bоглядывал все вокруг\b=оглядывал всё вокруг=gI
s=\bогородили все лентами\b=огородили всё лентами=gI
s=\bодетые все больше\b=Одетые всё больше=gI
s=\bоднако все россказни\b=однако всё россказни=gI
s=\bозаряя все вокруг\b=озаряя всё вокруг=gI
s=\bоказалось все отлично\b=оказалось всё отлично=gI
s=\bокончательно все запутает\b=окончательно всё запутает=gI
s=\bокропляли все вокруг\b=окропляли всё вокруг=gI
s=\bон все входит\b=он всё входит=gI
s=\bон все ещ[её]\b=он всё ещё=gI
s=\bон все же\b=он всё же=gI
s=\bон все и отключил,\b=Он всё и отключил,=gI
s=\bон все и так\b=он всё и так=gI
s=\bон все как\b=Он всё как=gI
s=\bон все мог!\b=Он всё мог!=gI
s=\bон все понял\b=он всё понял=gI
s=\bон все прекрасно\b=он всё прекрасно=gI
s=\bон все это\b=он всё это=gI
s=\bон делал все\b=он делал всё=gI
s=\bон мне все\b=он мне всё=gI
s=\bон это все\b=он это всё=gI
s=\bона все держит\b=она всё держит=gI
s=\bона все ещ[её]\b=она всё ещё=gI
s=\bона все меньше\b=она всё меньше=gI
s=\bона все стоит\b=она всё стоИт=gI
s=\bони все едят\b=они всё едят=gI
s=\bони все жрут,\b=они всё жрут,=gI
s=\bони все жрут\b=они всё жрут=gI
s=\bони все знали\.\b=они всё знали\.=gI
s=\bони все знают!\b=они всё знают!=gI
s=\bони все знают\.\b=они всё знают\.=gI
s=\bони все лезут и лезут\b=они всё лезут и лезут=gI
s=\bони все подтвердят\b=они всё подтвердят=gI
s=\bони все поняли!\b=они всё поняли!=gI
s=\bони все поняли\b=они всё поняли=gI
s=\bони все починят\b=они всё починят=gI
s=\bони все прибывали\b=они всё прибывали=gI
s=\bони все растворят\b=они всё растворят=gI
s=\bони все сделают для\b=они всё сделают для=gI
s=\bони все так же\b=они всё так же=gI
s=\bони все таки\b=они всё таки=gI
s=\bони все узнали бы\b=они всё узнали бы=gI
s=\bони делают все, чтобы\b=они делают всё, чтобы=gI
s=\bони делают все,\b=они делают всё, =gI
s=\bони мне ещ[её] не все упаковали\b=они мне ещё не всё упаковали=gI
s=\bоно все ещ[её]\b=оно всё ещё=gI
s=\bоно все к\b=оно всё к=gI
s=\bоно все стояло\b=оно всё стояло=gI
s=\bопасно все кругом\b=опасно всё кругОм=gI
s=\bопять все возвращают\b=опять всё возвращают=gI
s=\bопять все не просто\b=опять всё не просто=gI
s=\bопять все сначала\b=опять всё сначала=gI
s=\bопять же все как то\b=опять же всё как то=gI
s=\bопять же все как тоъ\b=опять же всё как тоъ=gI
s=\bорать на все\b=орать на всё=gI
s=\bорганизовали все немцы\b=организовали всё немцы=gI
s=\bорганизовать все сами\b=организовать всё сами=gI
s=\bоружие забрали все\b=оружие забрали всё=gI
s=\bосвещая все вокруг\b=освещая всё вокруг=gI
s=\bосмотрев все при\b=осмотрев всё при=gI
s=\bосмотрел все вокруг\b=осмотрел всё вокруг=gI
s=\bосмотреть в доме все\.\b=осмотреть в доме всё\.=gI
s=\bосмотреть все вокруг\b=осмотреть всё вокруг=gI
s=\bосмотреть все новым\b=осмотреть всё новым=gI
s=\bосмотрим все здесь хорошенько\b=осмотрим всё здесь хорошенько=gI
s=\bосмотрим все получше\b=осмотрим всё получше=gI
s=\bосмотрю все здесь\b=осмотрю всё здесь=gI
s=\bоставил все ей\b=оставил всё ей=gI
s=\bоставил все как есть\b=оставил всё как есть=gI
s=\bоставить все на\b=оставить всё на=gI
s=\bоставлять все на\b=оставлять всё на=gI
s=\bостальное все там\b=остальное всё там=gI
s=\bостальное уже все наши\b=остальное уже всё наши=gI
s=\bосушил все одним\b=осушил всё одним=gI
s=\bосыпая все вокруг\b=осыпая всё вокруг=gI
s=\bосыпая все листвой\b=осыпая всё листвой=gI
s=\bот воров все позакрывали\b=от воров всё позакрывали=gI
s=\bот начала сражения все закончится\b=от начала сражения всё закончится=gI
s=\bотбер[её]т все не\b=отберёт всё не=gI
s=\bответить за все\.\b=ответить за всё\.=gI
s=\bответственный за все\.\b=ответственный за всё\.=gI
s=\bотдавать все чужим\b=отдавать всё чужим=gI
s=\bотдать все за\b=отдать всё за=gI
s=\bотдать все,\b=отдать всё,=gI
s=\bотец все отдал\b=отец всё отдАл=gI
s=\bоткладывать все до\b=откладывать всё до=gI
s=\bоткрыто все\.\b=открыто всё\.=gI
s=\bоткуда все и взялось\b=откуда всё и взялось=gI
s=\bоткуда это все\b=откуда это всё=gI
s=\bотложим все до\b=отложим всё до=gI
s=\bотложить все на\b=отложить всё на=gI
s=\bотломилось почти все\b=отломилось почти всё=gI
s=\bотменяем все вообще\b=отменяем всё вообще=gI
s=\bотн[её]с все в\b=отнёс всё в=gI
s=\bотобрали все…\b=отобрали всё…=gI
s=\bотпечатать все сегодня\b=отпечатать всё сегодня=gI
s=\bотработай все назад\.\b=отработай всё назад\.=gI
s=\bотравляли все кругом\b=отравляли всё кругом=gI
s=\bотсек все лишнее\b=отсёк всё лишнее=gI
s=\bотсюда вынес все\?\b=отсюда вынес всё\?=gI
s=\bотыграть все назад\b=отыграть всё назад=gI
s=\bохватывающую все, куда\b=охватывающую всё, куда=gI
s=\bохотно все повторила\b=охотно всё повторила=gI
s=\bохраняется все крыло,\b=охраняется всё крыло,=gI
s=\bоценив все с\b=оценив всё с=gI
s=\bоценивший все коварство\b=оценивший всё коварство=gI
s=\bоцените все окружающие\b=оцените всё окружающие=gI
s=\bоцепили все вокруг\b=оцепили всё вокруг=gI
s=\bочень все походит\b=очень всё походит=gI
s=\bпакуй все в\b=пакуй всё в=gI
s=\bпали во все\b=палИ во всё=gI
s=\bпальцы все соскальзывали\b=пальцы всё соскальзывали=gI
s=\bперебрав все вокруг\b=перебрав всё вокруг=gI
s=\bперевалил все в не[её]\b=Перевалил всё в неё=gI
s=\bперевезти все на\b=перевезти всё на=gI
s=\bперев[её]л все на сч[её]т\b=перевёл всё на счёт=gI
s=\bпереводила все банкиру\b=переводила всё банкиру=gI
s=\bпереводит все в область\b=переводит всё в область=gI
s=\bпереводишь все на\b=переводишь всё на=gI
s=\bперевози все\.\b=перевози всё\.=gI
s=\bперегружается все шустро\b=перегружается всё шустро=gI
s=\bперед глазами все\b=перед глазами всё=gI
s=\bпередайте все генералу\b=передайте всё генералу=gI
s=\bпередать все тому же\b=передать всё томУ же=gI
s=\bпереживает все наново\b=переживает всё наново=gI
s=\bпережить все снова\b=пережить всё снова=gI
s=\bпережить все это\b=пережить всё это=gI
s=\bперекачаем все топливо\b=перекачаем всё топливо=gI
s=\bперекладывая все из\b=перекладывая всё из=gI
s=\bперелить все масло\b=перелить всё масло=gI
s=\bпереложив все на\b=переложив всё на=gI
s=\bперенеси все наверх\b=перенеси всё наверх=gI
s=\bпереоделись во все летнее\b=переоделись во всё летнее=gI
s=\bперепашут тут все к\b=перепашут тут всё к=gI
s=\bпереписал все в не[её]\b=переписал всё в неё=gI
s=\bпереписывал все уже\b=переписывал всё уже=gI
s=\bпересказал ему все\b=пересказал ему всё=gI
s=\bпересказала все это\b=пересказала всё это=gI
s=\bпересказать все лично\b=пересказать всё лично=gI
s=\bпересыпало все автоматной\b=пересыпало всё автоматной=gI
s=\bперетаскаем все топливо\b=перетаскаем всё топливо=gI
s=\bперетаскивали все на\b=перетаскивали всё на=gI
s=\bперетереть все с\b=перетереть всё с=gI
s=\bпишите обо всем\b=пишите обо всём=gI
s=\bплохо все сделал\b=плохо всё сделал=gI
s=\bплюнут на все и\b=плюнут на всё и=gI
s=\bплюнуть на все и уйти\b=плюнуть на всё и уйти=gI
s=\bплюнуть на все и\b=плюнуть на всё и=gI
s=\bплюнуть на все\b=плюнуть на всё=gI
s=\bплющит все на\b=плющит всё на=gI
s=\bпо все тому\b=по всё тому=gI
s=\bпо мелочи все\.\b=по мелочи всё\.=gI
s=\bпо очереди и все тут\b=по очереди и всё тут=gI
s=\bпо хитрому все сделают\b=по хитрому всё сделают=gI
s=\bповедать все об\b=поведать всё об=gI
s=\bповезут все на себе\b=повезут всё на себе=gI
s=\bповесить все на\b=повесить всё на=gI
s=\bповторил все в точности\b=повторил всё в точности=gI
s=\bповторили все это\b=повторили всё это=gI
s=\bповторите теперь все нам\b=повторите теперь всё нам=gI
s=\bповторить все в\b=повторить всё в=gI
s=\bповторить все снова\b=повторить всё снова=gI
s=\bповторишь все миллион раз\b=повторишь всё миллион раз=gI
s=\bповторять все по\b=повторять всё по=gI
s=\bпоглоти все бездна\b=поглоти всё бездна=gI
s=\bпогружая все во\b=погружая всё во=gI
s=\bпогубить все в\b=погубить всё в=gI
s=\bподавай все,\b=подавай всё,=gI
s=\bподберите нам все скромненько\b=подберите нам всё скромненько=gI
s=\bподвластно все и\b=подвластно всё и=gI
s=\bподготовят все к\b=подготовят всё к=gI
s=\bподелила все на\b=поделила всё на=gI
s=\bподелим все богатство\b=поделим всё богатство=gI
s=\bподелим все!\b=поделим всё!=gI
s=\bподелим все,\b=поделим всё,=gI
s=\bподелим все\.\b=поделим всё\.=gI
s=\bподнять все на борт\b=поднять всё на борт=gI
s=\bподпалю здесь все\b=подпалю здесь всё=gI
s=\bподразумевая все сообщество\b=подразумевая всё сообщество=gI
s=\bподтащили все к\b=подтащили всё к=gI
s=\bпозабыл про все\?\b=позабыл про всё\?=gI
s=\bпознать все -\b=познать всё -=gI
s=\bпознаю все на земле\b=познаю всё на Земле=gI
s=\bпойд[её]т все только\b=пойдёт всё только=gI
s=\bпока все горячее\b=пока всё горЯчее=gI
s=\bпока все не было кончено\b=пока всё не было кончено=gI
s=\bпока все не выпьем\b=пока всё не выпьем=gI
s=\bпока все обойд[её]м\b=пока всё обойдём=gI
s=\bпока все обходится\b=пока всё обходится=gI
s=\bпока все по мелочи\b=пока всё по мелочи=gI
s=\bпока все тепло\b=пока всё тепло=gI
s=\bПока все тихо!\b=Пока всё тихо!=gI
s=\bПока все тихо,\b=Пока всё тихо,=gI
s=\bПока все тихо\.\b=Пока всё тихо\.=gI
s=\bПока все тихо\?\b=Пока всё тихо\?=gI
s=\bпока все\.\b=Пока всё\.=gI
s=\bпокидаем все в воду\b=Покидаем всё в воду=gI
s=\bпокидает все в\b=покидает всё в=gI
s=\bпокорил ему все\b=покорил ему всё=gI
s=\bпокрою все лаком\b=покрою всё лаком=gI
s=\bпокрыл все собой\b=покрыл всё собой=gI
s=\bпокупать все сразу\b=покупать всё сразу=gI
s=\bполивал все вокруг\b=поливал всё вокруг=gI
s=\bполивал все сквозь\b=поливал всё сквозь=gI
s=\bполку все же\b=пОлку всё же=gI
s=\bположил все это\b=положил всё это=gI
s=\bполучил все сполна\b=получил всё сполна=gI
s=\bполучите все обратно\b=получите всё обратно=gI
s=\bполучите все!\b=получите всё!=gI
s=\bполучите все, что захотите\b=полУчите всё, что захотите=gI
s=\bпоменять все это\b=поменять всё это=gI
s=\bпоместится хоть все\b=поместится хоть всё=gI
s=\bпомнил все, до\b=помнил всё, до=gI
s=\bпомнить все после\b=помнить всё после=gI
s=\bпомню про свою работу все\b=помню про свою работу всё=gI
s=\bпоначалу все это\b=поначалу всё это=gI
s=\bпонимаешь все в обратном\b=понимаешь всё в обратном=gI
s=\bпонимал все то же\b=понимал всё то же=gI
s=\bпонимаю я все\b=понимаю я всё=gI
s=\bпонимаю\. не все\.\b=понимаю\. Не всё\.=gI
s=\bпонимают все не\b=понимают всё не=gI
s=\bпоняв все без\b=поняв всё без=gI
s=\bпонял все из того\b=понял всё из того=gI
s=\bпонял все сам\b=понял всё сам=gI
s=\bпонял все сразу\b=понял всё сразу=gI
s=\bпонял я все,\b=понял я всё,=gI
s=\bпоняла все в\b=поняла всё в=gI
s=\bпоняла не все\.\b=поняла не всё\.=gI
s=\bпонятно все с тобой\b=понятно всё с тобой=gI
s=\bпонятно все:\b=понятно всё:=gI
s=\bпонять все из этой\b=понять всё из этой=gI
s=\bпоотбивали все на\b=поотбивали всё на=gI
s=\bпопадаются все новые\b=попадаются всё новые=gI
s=\bпополнялось все новыми\b=пополнялось всё новыми=gI
s=\bпопросил все оставить\b=попросил всё оставить=gI
s=\bпопытаться все равно стоит\b=попытаться всё равно стОит=gI
s=\bпослал все в\b=послал всё в=gI
s=\bпослал все к ч[её]рту\b=послал всё к чёрту=gI
s=\bпослала все к ч[её]рту\b=послала всё к чёрту=gI
s=\bпослать все к\b=послать всё к=gI
s=\bпоставив все на\b=поставив всё на=gI
s=\bпоставивший все на\b=поставивший всё на=gI
s=\bпоставил все на середину\b=поставил всё на середину=gI
s=\bпоставила все на\b=поставила всё на=gI
s=\bпоставили на кон все\.\b=поставили на кон всё\.=gI
s=\bпоставить все на\b=поставить всё на=gI
s=\bпостарались собрать все\b=постарались собрать всё=gI
s=\bпостарался все спланировать\b=постарался всё спланировать=gI
s=\bпостигать все снова\b=постигать всё снова=gI
s=\bпосылает все к\b=посылает всё к=gI
s=\bпотащу это все\b=потащу это всё=gI
s=\bпотереть все нахрен\b=потереть всё нахрен=gI
s=\bпотерявшие все люди\b=потерявшие всё люди=gI
s=\bпотеряно не все\.\b=потеряно не всё\.=gI
s=\bпотом все домой,\b=потом всё домой,=gI
s=\bпотом все расскажете\.\b=потом всё расскажете\.=gI
s=\bпотом, все потом\b=потом, всё потом=gI
s=\bпотому что все топливо\b=потому что всё топливо=gI
s=\bпохватав все, успели\b=похватав всё, успели=gI
s=\bпохоже - все\.\b=Похоже - всё\.=gI
s=\bпохоже - точно все\.\b=похоже - точно всё\.=gI
s=\bпохоже, действительно все\.\b=похоже, действительно всё\.=gI
s=\bпочему так все через\b=почему так всё через=gI
s=\bпочти все в воде\b=почти всё в воде=gI
s=\bпочти все делаем\b=почти всё делаем=gI
s=\bпочти все дно\b=почти всё дно=gI
s=\bпочти все озеро\b=почти всё озеро=gI
s=\bпочти все, как у\b=почти всё, как у=gI
s=\bпошли вы вс[её] в\b=пошли вы все в=gI
s=\bпошли вы вс[её] на\b=пошли вы все на=gI
s=\bпоявлялись все новые\b=появлялись всё новые=gI
s=\bправда все это или\b=правда всё это или=gI
s=\bправильно все излагаете\.\b=правильно всё излагаете\.=gI
s=\bправильно все,\b=правильно всё,=gI
s=\bправильно ли они все делают\b=правильно ли они всё делают=gI
s=\bпрактики все позабудешь\b=практики всё позабудешь=gI
s=\bпрактически все оплатили\b=практически всё оплатили=gI
s=\bпрактически все, о ч[её]м может мечтать\b=практически всё, о чём может мечтать=gI
s=\bпрактически все, о ч[её]м можно мечтать\b=практически всё, о чём можно мечтать=gI
s=\bпрактически все, о ч[её]м только может мечтать\b=практически всё, о чём только может мечтать=gI
s=\bпрактически все, о ч[её]м только можно мечтать\b=практически всё, о чём только можно мечтать=gI
s=\bпревосходство определяет все,\b=превосходство определяет всё,=gI
s=\bпревратила все в то\b=превратила всё в то=gI
s=\bпревращая все в\b=превращая всё в=gI
s=\bпредательски все изменяющем\b=предательски всё изменяющем=gI
s=\bпредоставьте все мне\b=предоставьте всё мне=gI
s=\bпредотвратить все вовремя\b=предотвратить всё вовремя=gI
s=\bпредставив все вживую\b=представив всё вживую=gI
s=\bпредставив все воочию:\b=представив всё воочию:=gI
s=\bпредставив все воочию\b=представив всё воочию=gI
s=\bпресечь все на корню\b=пресечь всё на корнЮ=gI
s=\bпри всем этом\b=при всём этом=gI
s=\bпри всем\b=при всём=gI
s=\bприберите все с коек\b=приберите всё с коек=gI
s=\bпривести все в норму\b=привести всё в норму=gI
s=\bпривычке все повторять\b=привычке всё повторять=gI
s=\bприготовил все к\b=приготовил всё к=gI
s=\bприготовил все незаконное\b=приготовил всё незаконное=gI
s=\bприготовлено все отлично\b=приготовлено всё отлично=gI
s=\bпридерживаться все время\b=придерживаться всё время=gI
s=\bприд[её]тся все же\b=придётся всё же=gI
s=\bпридумать все это\b=придумать всё это=gI
s=\bпридут и все скажут\b=придут и всё скажут=gI
s=\bприказать ему все\b=приказать ему всё=gI
s=\bприлетает все время\b=прилетает всё время=gI
s=\bприн[её]с все на стол\b=принёс всё на стол=gI
s=\bприн[её]с все на\b=принёс всё на=gI
s=\bприн[её]с все это\b=принёс всё это=gI
s=\bприносил все новые\b=приносил всё новые=gI
s=\bприносите все на\b=приносите всё на=gI
s=\bпринявший ради нас все\b=принявший ради нас всё=gI
s=\bприняла все как\b=приняла всё как=gI
s=\bпритащили все,\b=Притащили всё,=gI
s=\bприч[её]м именно все\b=причём именно всё=gI
s=\bпро все это\b=про всё это=gI
s=\bпроверить все вокруг\b=проверить всё вокруг=gI
s=\bпроверить все лично\b=проверить всё лично=gI
s=\bпроверял все,\b=проверял всё,=gI
s=\bпроверять все то\b=проверять всё то=gI
s=\bпроговорим все вслух\b=проговорим всё вслух=gI
s=\bпродавать все за\b=продавать всё за=gI
s=\bпродано не все\b=продано не всё=gI
s=\bпродать все сразу\b=продать всё сразу=gI
s=\bпроделав все это\b=проделав всё это=gI
s=\bпроделал все снова\b=проделал всё снова=gI
s=\bпродумав все это\b=продумав всё это=gI
s=\bпродумать все и\b=продумать всё и=gI
s=\bпрожить это все\b=прожить это всё=gI
s=\bпроизводство все в\b=производство всё в=gI
s=\bпроизводящий все во всех\b=производящий всё во всех=gI
s=\bпроизнести все это\b=произнести всё это=gI
s=\bпройти все до\b=пройти всё до=gI
s=\bпроклиная все на свете\b=проклиная всё на свете=gI
s=\bпроклиная все на\b=проклиная всё на=gI
s=\bпроклял все на\b=проклял всё на=gI
s=\bпроклянут все на\b=проклянут всё на=gI
s=\bпромерить все и посчитать\b=промерить всё и посчитать=gI
s=\bпромочил все вокруг\b=промочил всё вокруг=gI
s=\bпросматривается все на\b=просматривается всё на=gI
s=\bпростенько все внутри\b=простенько всё внутри=gI
s=\bпросто все!\b=просто всё!=gI
s=\bпросто все\.\b=просто всё\.=gI
s=\bпросчитал все на\b=просчитал всё на=gI
s=\bпротараторила все в\b=протараторила всё в=gI
s=\bпрот[её]р все быстро\b=протёр всё быстро=gI
s=\bпротив его воли все сделали\b=против его воли всё сделали=gI
s=\bпрочувствует все и уйд[её]т\b=прочувствует всё и уйдёт=gI
s=\bпрочь все это\b=прочь всё это=gI
s=\bпрощалось почти все\b=прощалось почти всё=gI
s=\bпугало все подряд\b=пугАло всё подряд=gI
s=\bпуля все прошь[её]т\b=пуля всё прошьёт=gI
s=\bпусть все бросают\b=пусть всё бросают=gI
s=\bпусть все здесь украсят\b=пусть всё здесь украсят=gI
s=\bпусть все ид[её]т\b=пусть всё идёт=gI
s=\bпусть все несут\b=пусть всё несут=gI
s=\bпусть все перероют\b=пусть всё перероют=gI
s=\bпусть это все\b=пусть это всё=gI
s=\bравно все не всерь[её]з\b=равно всё не всерьёз=gI
s=\bради чего все затеяли\b=ради чего всё затеяли=gI
s=\bраз все так просто\b=раз всё так просто=gI
s=\bраз, и все!\b=раз, и всё!=gI
s=\bразваливается почти все\b=разваливается почти всё=gI
s=\bразглядеть все в подробностях\b=разглядеть всё в подробностях=gI
s=\bразглядеть все сразу\b=разглядеть всё сразу=gI
s=\bразграбили бы все в\b=разграбили бы всё в=gI
s=\bразгрести все и\b=разгрести всё и=gI
s=\bраздобыть буквально все\b=раздобыть буквально всё=gI
s=\bразложим все по\b=разложим всё по=gI
s=\bразместили все аккуратно\b=разместили всё аккуратно=gI
s=\bразнес[её]м здесь все\b=разнесём здесь всё=gI
s=\bразнес[её]т все в\b=разнесёт всё в=gI
s=\bразнести все топором\b=разнести всё топором=gI
s=\bразнести здесь все\b=разнести здесь всё=gI
s=\bразнести там все\.\b=разнести там всё\.=gI
s=\bразобь[её]т все к\b=разобьёт всё к=gI
s=\bразом все меньше\b=разом всё меньше=gI
s=\bразом все сделаем\b=разом всё сделаем=gI
s=\bразоряют все без разбора\b=разоряют всё без разбора=gI
s=\bразрезали по швам все\b=разрезали по швам всё=gI
s=\bразрешит тебе все\b=разрешит тебе всё=gI
s=\bразрушил все несколько\b=разрушил всё несколько=gI
s=\bразузнает все в\b=разузнает всё в=gI
s=\bракеты все не включались\b=ракеты всё не включались=gI
s=\bраньше нас все заметите\b=раньше нас всё заметите=gI
s=\bраспускала все и\b=распускала всё и=gI
s=\bрасскажете все, даже\b=расскажете всё, даже=gI
s=\bрасскажешь все -\b=расскажешь всё -=gI
s=\bрасскажите все мне\b=расскажите всё мне=gI
s=\bрасскажите все про эти\b=расскажите всё про эти=gI
s=\bрасскажу тебе все вечером\b=расскажу тебе всё вечером=gI
s=\bрассказал ей все про\b=рассказал ей всё про=gI
s=\bрассказал жене все\.\b=рассказал жене всё\.=gI
s=\bрассказал опять же не все,\b=Рассказал опять же не всё,=gI
s=\bрассказал я все,\b=Рассказал я всё,=gI
s=\bрассказала все,\b=рассказала всё,=gI
s=\bрассказала мне все\b=рассказала мне всё=gI
s=\bрассказать все о\b=рассказать всё о=gI
s=\bрассказать все об\b=рассказать всё об=gI
s=\bрассказать все подполью\b=рассказать всё подполью=gI
s=\bрассказать все\.\b=рассказать всё\.=gI
s=\bрассказать мне все\.\b=рассказать мне всё\.=gI
s=\bрассказывай все в\b=рассказывай всё в=gI
s=\bрассказывал все об\b=рассказывал всё об=gI
s=\bрассказывал не все,\b=рассказывал не всё,=gI
s=\bрассказывать все в\b=рассказывать всё в=gI
s=\bрасследуйте все хорошенько\b=расследуйте всё хорошенько=gI
s=\bрассматриваете все вокруг\b=рассматриваете всё вокруг=gI
s=\bрассматривать все сразу\b=рассматривать всё сразу=gI
s=\bрассмотреть все в\b=рассмотреть всё в=gI
s=\bрассмотреть все перед\b=рассмотреть всё пЕред=gI
s=\bрасставив все на\b=расставив всё на=gI
s=\bрасставил все по\b=расставил всё по=gI
s=\bрасставила все на столе\b=расставила всё на столе=gI
s=\bрасстегнуть все и\b=расстегнуть всё и=gI
s=\bрассудка и все несли\b=рассудка и всё несли=gI
s=\bрассчитал все до\b=рассчитал всё до=gI
s=\bрасхл[её]бывать все снова\b=расхлёбывать всё снова=gI
s=\bребята все поняли,\b=ребята всё поняли,=gI
s=\bрепетировала все то\b=репетировала всё то=gI
s=\bрепутация - это все\b=репутация - это всё=gI
s=\bречников все попроще\b=речников всё попроще=gI
s=\bрешает все сила\b=решает всё сила=gI
s=\bрешать все заново\b=решать всё заново=gI
s=\bрешают не все\?\b=решают не всё\?=gI
s=\bрешил все за всех\b=решил всё за всех=gI
s=\bрешил все обязательно\b=Решил всё обязательно=gI
s=\bрешили все же никуда\b=решили всё же никуда=gI
s=\bрешило все за меня\b=решило всё за меня=gI
s=\bрешить все в\b=решить всё в=gI
s=\bрискнуть и все потерять\b=рискнуть и всё потерять=gI
s=\bрубануло все\.\b=рубануло всё\.=gI
s=\bругала сразу все -\b=ругала сразу всё -=gI
s=\bрука все быстрее\b=рука всё быстрее=gI
s=\bрука все ещ[её]\b=рука всё ещё=gI
s=\bруками все переломаю\b=руками всё переломаю=gI
s=\bруки все сделали\b=рУки всё сделали=gI
s=\bс вешалки - и все в\b=с вешалки - и всё в=gI
s=\bс все большим\b=с всё бОльшим=gI
s=\bс все возрастающей\b=с всё возрастающей=gI
s=\bс заводских складов все\.\b=с заводских складов всё\.=gI
s=\bс каждою минутой все скучнее\b=с каждою минутой всё скучнее=gI
s=\bс каждым годом все тяжелее\b=с каждым годом всё тяжелее=gI
s=\bс которой все\b=с которой всё=gI
s=\bс тобой все по другому\b=с тобой всё по другому=gI
s=\bс экипировкой - все там,\b=с экипировкой - всё там,=gI
s=\bс этим все ч[её]тко\b=С этим всё чётко=gI
s=\bс этим все\.\b=С этим всё\.=gI
s=\bс этими все ясно\b=с этими всё ясно=gI
s=\bсам все выпил\b=сам всё выпил=gI
s=\bсам все давай\b=сам всё давай=gI
s=\bсам все помнишь\b=сам всё помнишь=gI
s=\bсам все потянешь\b=сам всё потянешь=gI
s=\bсам знает не все\.\b=сам знает не всё\.=gI
s=\bсам увидишь все\b=Сам увидишь всё=gI
s=\bсам хорошо все понимает\b=сам хорошо всё понимает=gI
s=\bсама видела все\b=сама видела всё=gI
s=\bсама все прекрасно\b=сама всё прекрасно=gI
s=\bсама знает не все\.\b=сама знает не всё\.=gI
s=\bсами все видели\b=сами всё видели=gI
s=\bсами все видят\b=сами всё видят=gI
s=\bсами все выложат\b=сами всё выложат=gI
s=\bсами все д[её]ргали\b=сами всё дёргали=gI
s=\bсами все знаете\b=сами всё знаете=gI
s=\bсами все поймут\b=сами всё поймут=gI
s=\bсами все поняли\b=сами всё поняли=gI
s=\bсами все придумают\b=сами всё придумают=gI
s=\bсами все расскажете\b=сами всё расскажете=gI
s=\bсами знают не все\.\b=сами знают не всё\.=gI
s=\bсвалив все на\b=свалив всё на=gI
s=\bсваливать все на меня\b=сваливать всё на меня=gI
s=\bсвалил все в\b=свалил всё в=gI
s=\bсвалить все на\b=свалить всё на=gI
s=\bсверху все и увидим\b=сверху всё и увидим=gI
s=\bсвести все к\b=свести всё к=gI
s=\bсвечи все оплывали\b=свЕчи всё оплывали=gI
s=\bсвидетели и все такое\b=свидетели и всё такОе=gI
s=\bсвобода для нас все\b=свобода для нас всё=gI
s=\bсгр[её]б все и,\b=сгрёб всё и,=gI
s=\bсгребла все в\b=сгребла всё в=gI
s=\bсгрузил все на\b=сгрузил всё на=gI
s=\bсгрузили все в\b=сгрузили всё в=gI
s=\bсдать все плацу\b=сдать всё плацу=gI
s=\bсделаем все…\b=сделаем всё…=gI
s=\bсделает все без\b=сделает всё без=gI
s=\bсделаешь все как\b=сделаешь всё как=gI
s=\bсделай все красиво\b=Сделай всё красиво=gI
s=\bсделал все быстро\b=сделал всё быстро=gI
s=\bсделал все как вы приказали\b=сделал всё как вы приказали=gI
s=\bсделал все одной\b=сделал всё одной=gI
s=\bсделал все правильно\b=сделал всё правильно=gI
s=\bсделал все сам\b=сделал всё сам=gI
s=\bсделал все, как\b=сделал всё, как=gI
s=\bсделал все, чтобы\b=сделал всё, чтобы=gI
s=\bсделал практически все\b=сделал практически всё=gI
s=\bсделали все наоборот\b=сделали всё наоборот=gI
s=\bсделать все вообще все\b=сделать всё вообще всё=gI
s=\bсделать все как\b=сделать всё как=gI
s=\bсделать с ним все\b=сделать с ним всё=gI
s=\bсделают все для вашего удобства\b=сделают всё для вашего удобства=gI
s=\bсделают все для\b=сделают всё для=gI
s=\bсделают все как\b=сделают всё как=gI
s=\bсебе все доброе\b=себе всё доброе=gI
s=\bсебя все на\b=себя всё на=gI
s=\bсегодня все\.\b=сегодня всё\.=gI
s=\bсегодня же все и сделаю\b=сегодня же всё и сделаю=gI
s=\bсейчас все верну\b=сейчас всё верну=gI
s=\bсейчас все исчезнет\b=сейчас всё исчезнет=gI
s=\bсейчас все узнаете\b=сейчас всё узнАете=gI
s=\bсерь[её]зно все\.\b=серьёзно всё\.=gI
s=\bсж[её]г все в\b=сжёг всё в=gI
s=\bсж[её]г все к\b=сжёг всё к=gI
s=\bсж[её]г все это\b=сжёг всё это=gI
s=\bсжечь все белье\b=сжечь всё белье=gI
s=\bсжирающими все хоть\b=сжирающими всё хоть=gI
s=\bсигары все толще\b=сигары всё толще=gI
s=\bсидел все в той же\b=сидел всё в той же=gI
s=\bсилой берет вс[её]\b=силой берёт всё=gI
s=\bсказал не все\.\b=сказал не всё\.=gI
s=\bСказки это все!\b=Сказки это всё!=gI
s=\bСказки это все,\b=Сказки это всё,=gI
s=\bСказки это все\.\b=Сказки это всё\.=gI
s=\bскакала все дальше\b=скакала всё дальше=gI
s=\bсквозь все безумство\b=сквозь всё безумство=gI
s=\bскинул все в\b=скинул всё в=gI
s=\bскинули туда все,\b=скинули туда всё,=gI
s=\bскиснет все к\b=скиснет всё к=gI
s=\bсколько все это стоит\b=сколько всё это стОит=gI
s=\bсколько все это\b=сколько всё это=gI
s=\bсколько это все стоит\b=сколько это всё стОит=gI
s=\bскормил это все градоначальнику\b=скормил это всё градоначальнику=gI
s=\bскормил это все\b=скормил это всё=gI
s=\bскоро все восстановят\.\b=скоро всё восстановят\.=gI
s=\bскосить все напрочь\b=скосить всё напрочь=gI
s=\bскрывать все от\b=скрывать всё от=gI
s=\bследы ведь все скажут\b=следы ведь всё скажут=gI
s=\bслили все на\b=слили всё на=gI
s=\bслишком все к тому располагает\b=слишком всё к тому располагает=gI
s=\bслишком все по книжному\b=слишком всё по книжному=gI
s=\bслишком все серь[её]зно\b=слишком всё серьёзно=gI
s=\bслова все начинают\b=слова всё начинают=gI
s=\bсловах все гладко\b=словах всё гладко=gI
s=\bсловно я все ещ[её]\b=словно я всё ещё=gI
s=\bслово сотворило все\b=слово сотворило всё=gI
s=\bсловом, все, с чем\b=словом, всё, с чем=gI
s=\bсловом, все, чем\b=словом, всё, чем=gI
s=\bсложи все вместе\b=сложи всё вместе=gI
s=\bсложив все обратно\b=сложив всё обратно=gI
s=\bсложил все в\b=Сложил всё в=gI
s=\bсложила все обратно\b=сложила всё обратно=gI
s=\bсложить все с появлением\b=сложить всё с появлением=gI
s=\bсложно все запомнить\b=сложно всё запомнить=gI
s=\bслучались все реже\b=случались всё реже=gI
s=\bслушавший все л[её]ха,\b=слушавший всё лёха,=gI
s=\bслышал все на\b=слышал всё на=gI
s=\bслышно ведь все\b=слышно ведь всё=gI
s=\bсмел все с палубы\b=смел всё с палубы=gI
s=\bсмела все снизу\b=смелА всё снизу=gI
s=\bсметаем все на пути\b=сметаем всё на пути=gI
s=\bсметающая все на\b=сметающая всё на=gI
s=\bсметая все на\b=сметая всё на=gI
s=\bсметут все бомбами\b=сметут всё бомбами=gI
s=\bсмешать все в\b=смешать всё в=gI
s=\bсмешать тут все с\b=смешать тут всё с=gI
s=\bсмогу все представить\b=смогу всё представить=gI
s=\bсмотрела на все с\b=смотрела на всё с=gI
s=\bсмотрю - все тихо\b=смотрю - всё тихо=gI
s=\bсмотрю на все\b=смотрю на всё=gI
s=\bсмывающая все волна\b=смывающая всё волна=gI
s=\bснег все ещ[её]\b=снег всё ещё=gI
s=\bснимает все напрочь\b=снимает всё напрочь=gI
s=\bснимать все с\b=снимать всё с=gI
s=\bснова все почистят\.\b=снова всё почистят\.=gI
s=\bсносивший все подряд\b=сносивший всё подряд=gI
s=\bсносили все с\b=сносили всё с=gI
s=\bснять все и сбежать\b=снять всё и сбежать=gI
s=\bснять там все на\b=снять там всё на=gI
s=\bсо все большим\b=со всё бОльшим=gI
s=\bсо все большими и большими\b=со всё большими и большими=gI
s=\bсобер[её]т все в кулак\b=соберёт всё в кулак=gI
s=\bсобер[её]тся все кубло\b=соберётся всё кубло=gI
s=\bсоберите все целое\b=соберите всё целое=gI
s=\bсобираем все и выходим\b=Собираем всё и выхОдим=gI
s=\bсобрал все в\b=собрал всё в=gI
s=\bсобрали все оружие\b=собрали всё оружие=gI
s=\bсовпадало буквально все\b=совпадало буквально всё=gI
s=\bсовсем все\.\b=совсем всё\.=gI
s=\bсогласна на все\b=согласна на всё=gI
s=\bсогласуй с ним все\.\b=согласуй с ним всё\.=gI
s=\bсодержать все это\b=содержать всё это=gI
s=\bсожгите все дотла\b=Сожгите всё дотла=gI
s=\bсожгут все\.\b=Сожгут всё\.=gI
s=\bсозда[её]т все силой\b=создаёт всё силой=gI
s=\bсознании все от начала\b=сознании всё от начала=gI
s=\bсообщили все заранее\b=сообщили всё заранее=gI
s=\bсообщит нам все\b=сообщит нам всё=gI
s=\bсорок все вместе\.\b=сОрок всё вместе\.=gI
s=\bсоставила все с\b=составила всё с=gI
s=\bсотворить все заново\b=сотворить всё заново=gI
s=\bсотри все с\b=сотри всё с=gI
s=\bсотрясая все дерево\b=сотрясая всё дерево=gI
s=\bспасибо за все\b=спасибо за всё=gI
s=\bспециалистам все предоставили\b=специалистам всё предоставили=gI
s=\bсписав все на\b=списав всё на=gI
s=\bсписать все на\b=списать всё на=gI
s=\bспишем все на\b=спишем всё на=gI
s=\bспишете все на\b=спИшете всё на=gI
s=\bспишут все на\b=спишут всё на=gI
s=\bспланировать все в\b=спланировать всё в=gI
s=\bспособны на все\b=способны на всё=gI
s=\bспрятала все в\b=спрятала всё в=gI
s=\bспускалась все ниже\b=спускалась всё ниже=gI
s=\bспустит все на\b=спустит всё на=gI
s=\bспустят все на\b=спустят всё на=gI
s=\bсразу все делаем,\b=сразу всё делаем,=gI
s=\bсразу все перегружаем\b=сразу всё перегружаем=gI
s=\bсразу все понимают\b=сразу всё понимают=gI
s=\bсразу все поняли\?\b=сразу всё поняли\?=gI
s=\bссыпали все вне пределов\b=ссыпали всё вне пределов=gI
s=\bставить все на\b=ставить всё на=gI
s=\bставя на карту все\?\b=ставя на карту всё\?=gI
s=\bставят все вверх\b=ставят всё вверх=gI
s=\bстало все прекрасно\b=стало всё прекрасно=gI
s=\bстанет все мощнее\b=станет всё мощнее=gI
s=\bстановилась все более\b=становилась всё более=gI
s=\bстановилась все круче\b=становилась всё круче=gI
s=\bстановились все подробнее\b=становились всё подробнее=gI
s=\bстановились все слабее\b=становились всё слабее=gI
s=\bстановились все уже\b=становились всё Уже=gI
s=\bстановилось все хуже\b=становилось всё хуже=gI
s=\bстановился все уже\b=становился всё уже=gI
s=\bстановится все более подходящей\b=становится всё более подходящей=gI
s=\bстановиться все бодрее\b=становиться всё бодрее=gI
s=\bстановятся все больше\b=становятся всё больше=gI
s=\bстановятся все быстрее\b=становятся всё быстрее=gI
s=\bстановятся все крупнее\b=становятся всё крупнее=gI
s=\bстановятся все обыденнее\b=становятся всё обыденнее=gI
s=\bстановятся все подлее\b=становятся всё подлее=gI
s=\bстарье все выкинули\b=старье всё выкинули=gI
s=\bстереть все с\b=стереть всё с=gI
s=\bстирал все,\b=стирал всё,=gI
s=\bстоила все дороже\b=стоила всё дороже=gI
s=\bстоит все в той\b=стоИт всё в той=gI
s=\bстоит все ещ[её]\b=стоит всё ещё=gI
s=\bстоит все таки\b=стОит всё таки=gI
s=\bстоит все там же\b=стоИт всё там же=gI
s=\bстоически перен[её]с все\b=стоически перенёс всё=gI
s=\bстранно все здесь\b=странно всё здесь=gI
s=\bстранно как то все\b=странно как то всё=gI
s=\bстранно как тоъ все\b=странно как тоъ всё=gI
s=\bстрелка все продолжала\b=стрЕлка всё продолжала=gI
s=\bстр[её]мные они все же\b=стрёмные они всё же=gI
s=\bстригут все короче\b=стригут всё короче=gI
s=\bстроилось ведь все\b=Строилось ведь всё=gI
s=\bстроим все из\b=строим всё из=gI
s=\bстроит все новые\b=строит всё новые=gI
s=\bсумку это все\b=сумку это всё=gI
s=\bсунул все в\b=сунул всё в=gI
s=\bсуществует и все\b=существует и всё=gI
s=\bсхватываешь все на\b=схватываешь всё на=gI
s=\bсчитали все в\b=считали всё в=gI
s=\bсшивал все капроновой\b=сшивал всё капроновой=gI
s=\bсъедал все без\b=съедал всё без=gI
s=\bсъел все и\b=съел всё и=gI
s=\bсъела все без\b=съела всё без=gI
s=\bсъела все до\b=съела всё до=gI
s=\bсюда все возят\b=сюда всё возят=gI
s=\bтак быстро все не приготовили\b=так быстро всё не приготовили=gI
s=\bтак быстро все успели\b=так быстро всё успели=gI
s=\bтак все в н[её]м\.\b=так всё в нём\.=gI
s=\bтак все и было\b=так всё и было=gI
s=\bтак все и делалось\b=так всё и делалось=gI
s=\bтак все и есть\b=так всё и есть=gI
s=\bтак все кончено\b=так всё кончено=gI
s=\bтак все на месте\b=так всё на месте=gI
s=\bтак все очень\b=так всё очень=gI
s=\bтак все плохо\b=так всё плохо=gI
s=\bтак все просто\b=так всё просто=gI
s=\bтак все сделают\b=так всё сделают=gI
s=\bтак все страшно\b=так всё страшно=gI
s=\bтак к чему все\.\b=так к чему всё\.=gI
s=\bтак ужасно все,\b=так ужасно всё,=gI
s=\bтак что все со\b=так что всё со=gI
s=\bтак, все!\b=так, всё!=gI
s=\bтак, все,\b=так, всё,=gI
s=\bтак, все\.\b=так, всё\.=gI
s=\bтак… все…\b=так… всё…=gI
s=\bтакое все вокруг\b=такое всё вокруг=gI
s=\bтам все возьм[её]м,\b=там всё возьмём,=gI
s=\bтам все дешевле\b=там всё дешевле=gI
s=\bтам все ж[её]стче\b=там всё жёстче=gI
s=\bтам все заминировано\b=там всё заминировано=gI
s=\bтам все знаете\b=там всё знаете=gI
s=\bтам все иначе\b=там всё иначе=gI
s=\bтам все интересно\b=там всё интересно=gI
s=\bтам все мышление\b=там всё мышление=gI
s=\bтам все прошьют\.\b=там всё прошьют\.=gI
s=\bтам все сложней\b=Там всё сложней=gI
s=\bтам как наверху все\.\b=там как наверху всё\.=gI
s=\bтам тоже все\.\b=Там тоже всё\.=gI
s=\bтараня все подряд\b=тараня всё подряд=gI
s=\bтащи все на сво[её]м\b=тащи всё на своём=gI
s=\bтащить все подряд\b=тащить всё подряд=gI
s=\bтебе все за\b=тебе всё за=gI
s=\bтебе все завтра\b=тебе всё завтра=gI
s=\bтебе все игрушки\b=тебе всё игрушки=gI
s=\bтебе все мало\b=тебе всё мало=gI
s=\bтебе все показывали\.\b=тебе всё показывали\.=gI
s=\bтебе можно все\b=тебе можно всё=gI
s=\bтемно, все\b=темнО, всё=gI
s=\bтеперь все нормально\b=теперь всё нормально=gI
s=\bтеперь все определ[её]нно\b=теперь всё определённо=gI
s=\bтеперь все ясно\b=теперь всё ясно=gI
s=\bтеперь все!\b=Теперь всё!=gI
s=\bТерпение и труд все перетрут\b=Терпение и труд всё перетрут=gI
s=\bтеряла все и\b=теряла всё и=gI
s=\bтеряют все и\b=теряют всё и=gI
s=\bтихо все делаем\b=тихо всё делаем=gI
s=\bто все без разницы\.\b=то всё без разницы\.=gI
s=\bто все мы разглядели\b=то всё мы разглядели=gI
s=\bто все очень даже\b=то всё очень даже=gI
s=\bто все поляк,\b=то всё Поляк,=gI
s=\bто все чуть проще\b=то всё чуть проще=gI
s=\bто все! Мы пропали!\b=то всё! Мы пропАли!=gI
s=\bто все, сам понимаешь\b=то всё, сам понимаешь=gI
s=\bто есть все это\b=то есть всё это=gI
s=\bто ли все вместе\b=то ли всё вместе=gI
s=\bто они сметут все!\b=то они сметут всё!=gI
s=\bтобой все хорошо\b=тобой всё хорошо=gI
s=\bтобой все это\b=тобой всё это=gI
s=\bтогда все быстро\.\b=Тогда всё быстро\.=gI
s=\bтогда все вместе посчитаем\.\b=тогда всё вместе посчитаем\.=gI
s=\bтогда все и узнаете\b=тогда всё и узнАете=gI
s=\bтогда все лучшее\b=тогда всё лучшее=gI
s=\bтогда все получалось\b=тогда всё получалось=gI
s=\bтогда зачем все\?\b=Тогда зачем всё\?=gI
s=\bтого все затеяли\b=того всё затеяли=gI
s=\bтоже все промерил\b=Тоже всё промерил=gI
s=\bтоже объясняло все\b=тоже объясняло всё=gI
s=\bтолько все закончится\b=только всё закончится=gI
s=\bтолько все это\b=только всё это=gI
s=\bторопливо все сняли\b=торопливо всё сняли=gI
s=\bтоскливо все это\b=тоскливо всё это=gI
s=\bтот все ещ[её]\b=тот всё ещё=gI
s=\bтот все не\b=тот всё не=gI
s=\bтот все своими\b=тот всё своими=gI
s=\bточно все время были\b=точно всё время были=gI
s=\bточно все это\b=точно всё это=gI
s=\bтратите все не\b=тратите всё не=gI
s=\bтребовалось все меньше\b=требовалось всё меньше=gI
s=\bтреск и все!\b=треск и всё!=gI
s=\bтретье - все волоки\b=третье - всё волоки=gI
s=\bтрусы все же натянул\b=трусЫ всё же натянул=gI
s=\bтуда все\.\b=туда всё\.=gI
s=\bтут все бомбами\b=тут всё бомбами=gI
s=\bтут все в ваших\b=тут всё в ваших=gI
s=\bтут все в рамках\b=тут всё в рамках=gI
s=\bтут все и все\b=тут всё и все=gI
s=\bтут все и закончат\b=тут всё и закончат=gI
s=\bтут все к чертям\b=тут всё к чертям=gI
s=\bтут все как и везде\b=тут всё как и везде=gI
s=\bтут все куда скромнее\b=Тут всё куда скромнее=gI
s=\bтут все на электричестве\b=тут всё на электричестве=gI
s=\bтут все на электроприводах\b=тут всё на электроприводах=gI
s=\bтут все начинал\b=тут всё начинал=gI
s=\bтут все переделали\b=тут всё переделали=gI
s=\bтут все просто:\b=тут всё просто:=gI
s=\bтут все разнесут\b=тут всё разнесут=gI
s=\bтут все совершенно понятно\b=тут всё совершенно понятно=gI
s=\bтут все хорошо\b=тут всё хорошо=gI
s=\bтут все ч[её]тко,\b=тут всё чётко,=gI
s=\bтут все чьим\b=тут всё чьим=gI
s=\bтут все шьют,\b=тут всё шьют,=gI
s=\bтут все ясно\b=тут всё ясно=gI
s=\bтут все, вроде\b=Тут всё, вроде=gI
s=\bтут все, не как наверху\b=тут всё, не как наверху=gI
s=\bтут просто все,\b=Тут просто всё,=gI
s=\bтут сложно все,\b=тут сложно всё,=gI
s=\bтут чистил все\.\b=тут чистил всё\.=gI
s=\bтут\. все\.\b=тут\. всё\.=gI
s=\bты все в\b=ты всё в=gI
s=\bты все вооруж[её]н\b=ты всё вооружён=gI
s=\bты все всегда\b=ты всё всегда=gI
s=\bты все ещ[её]\b=ты всё ещё=gI
s=\bты все знаешь\b=ты всё знаешь=gI
s=\bты все кусками\b=Ты всё кусками=gI
s=\bты все мечешься\b=ты всё мечешься=gI
s=\bты все отдавать\b=ты всё отдавать=gI
s=\bты все отлично\b=ты всё отлично=gI
s=\bты все отменишь\b=ты всё отменишь=gI
s=\bты все с себя\b=ты всё с себя=gI
s=\bты все сделал\b=ты всё сделал=gI
s=\bты все скушал,\b=ты всё скушал,=gI
s=\bты все схватываешь\b=ты всё схватываешь=gI
s=\bты все такой же\b=ты всё такой же=gI
s=\bты все там\b=ты всё там=gI
s=\bты все услышал\b=Ты всё услышал=gI
s=\bты все это\b=ты всё это=gI
s=\bты один за все\b=ты один за всё=gI
s=\bты сделал все\b=ты сделал всё=gI
s=\bты серь[её]зно все\b=ты серьёзно всё=gI
s=\bты там все\b=ты там всё=gI
s=\bты узнаешь все\b=ты узнАешь всё=gI
s=\bты хорошо все\b=ты хорошо всё=gI
s=\bу которого все отняли\.\b=у которого всё отняли\.=gI
s=\bу которой все отняли\.\b=у которой всё отняли\.=gI
s=\bу меня все в порядке\b=у меня всё в порядке=gI
s=\bу меня все внутри\b=у меня всё внутри=gI
s=\bу меня все есть\b=у меня всё есть=gI
s=\bу меня все\.\b=у меня всё\.=gI
s=\bу меня нормально все\b=у меня нормально всё=gI
s=\bу нас все быстро\b=у нас всё быстро=gI
s=\bу нас тут все\.\b=у нас тут всё\.=gI
s=\bу не[её] все там\b=у неё всё там=gI
s=\bу них все бер[её]тся\b=у них всё берётся=gI
s=\bу них все фурами,\b=у них всё фурами,=gI
s=\bу тебя все гладко\b=у тебя всё гладко=gI
s=\bу тебя все сейчас в лучшем виде\b=у тебя всё сейчас в лучшем виде=gI
s=\bУ тебя ко мне все\?\b=У тебя ко мне всё\?=gI
s=\bубер[её]м все тут\b=уберём всё тут=gI
s=\bубери все с\b=убери всё с=gI
s=\bубрал все в подсумок\b=убрал всё в подсумок=gI
s=\bубрал все обратно\b=убрал всё обратно=gI
s=\bубрали они не все,\b=Убрали они не всё,=gI
s=\bубрано уже все\b=убрано уже всё=gI
s=\bувидев все богатство\b=увидев всё богатство=gI
s=\bувидев же все воочию\b=увидев же всё воочию=gI
s=\bувидел все то\b=увидел всё то=gI
s=\bувидел все тоже\b=увидел всё тоже=gI
s=\bувидеть все в\b=увидеть всё в=gI
s=\bувидеть все своими\b=увидеть всё своими=gI
s=\bувидеть все собственными\b=увидеть всё собственными=gI
s=\bувидишь все, обещаю\b=увидишь всё, обещаю=gI
s=\bугол стены\b=угол стенЫ=gI
s=\bудалось все на\b=удалось всё на=gI
s=\bудачно все получилось\b=удачно всё получилось=gI
s=\bудивление все ещ[её]\b=удивление всё ещё=gI
s=\bуже все вроде бы\b=уже всё вроде бы=gI
s=\bуже все знал\b=уже всё знал=gI
s=\bуже все изв[её]л\b=уже всё извёл=gI
s=\bуже все отшутили\b=уже всё отшутили=gI
s=\bуже все проморгал\b=уже всё проморгал=gI
s=\bуже все разведали\b=уже всё разведали=gI
s=\bуже все решил\b=уже всё решил=gI
s=\bуже все совершилось\b=уже всё совершилось=gI
s=\bуже все украли\b=уже всё украли=gI
s=\bуже про все знали\b=уже про всё знали=gI
s=\bузнали от меня все\b=узнали от меня всё=gI
s=\bузнать все на месте\b=узнать всё на месте=gI
s=\bузнать все о\b=узнать всё о=gI
s=\bузнаю все последним\b=узнаЮ всё последним=gI
s=\bузнаю все самая последняя\b=узнаЮ всё самая последняя=gI
s=\bузнаю все,\b=узнАю всё,=gI
s=\bукрасим все частями\b=украсим всё частями=gI
s=\bукрыв это все\b=укрыв это всё=gI
s=\bуложила все обратно\b=уложила всё обратно=gI
s=\bуме все с начала\b=уме всё с начала=gI
s=\bумел все\.\b=умел всё\.=gI
s=\bуничтожают все вокруг\b=уничтожают всё вокруг=gI
s=\bуничтожено практически все\b=уничтожено практически всё=gI
s=\bуничтожил все\.\b=уничтожил всё\.=gI
s=\bуничтожить все вокруг\b=уничтожить всё вокруг=gI
s=\bуничтожить тут все\b=уничтожить тут всё=gI
s=\bусвоил все,\b=усвоил всё,=gI
s=\bусеивающую все вокруг\b=усеивающую всё вокруг=gI
s=\bуслышать все о\b=услышать всё о=gI
s=\bустилавшего все вокруг\b=устилавшего всё вокруг=gI
s=\bустроил все весьма\b=устроил всё весьма=gI
s=\bустроили все так\b=устроили всё так=gI
s=\bустроить все так\b=устроить всё так=gI
s=\bустрою все так\b=устрою всё так=gI
s=\bутешение все потерявшим\b=утешение всё потерявшим=gI
s=\bутилизировать все или\b=утилизировать всё или=gI
s=\bухватить все сразу\b=ухватить всё сразу=gI
s=\bучитывать все:\b=учитывать всё:=gI
s=\bфиксируя все ч[её]тко\b=фиксируя всё чётко=gI
s=\bфунта все вместе\b=фунта всё вместе=gI
s=\bхищник все ещ[её]\b=хищник всё ещё=gI
s=\bхлынет все сразу\b=хлынет всё сразу=gI
s=\bхозяева все не торопились\b=хозяева всё не торопились=gI
s=\bхорошенько все протри\b=хорошенько всё протри=gI
s=\bхорошо все планируют\b=хорошо всё планируют=gI
s=\bхотят все изменить\b=хотят всё изменить=gI
s=\bхочешь это все\b=хочешь это всё=gI
s=\bхрень все!\b=хрень всё!=gI
s=\bценного все вроде\b=ценного всё вроде=gI
s=\bцентре все по другому\b=центре всё по другому=gI
s=\bчего все оглядываешься\b=чего всё оглядываешься=gI
s=\bчеловеку это все\b=человеку это всё=gI
s=\bчем все кончится\b=чем всё кончится=gI
s=\bчем все может\b=чем всё может=gI
s=\bчем все это\b=чем всё это=gI
s=\bчерез все дно\b=через всё дно=gI
s=\bчерез все и все\b=через всё и всё=gI
s=\bчерез все человека\b=через всё человека=gI
s=\bчерез все\.\b=через всё\.=gI
s=\bч[её]тко все обосновали\b=чётко всё обосновали=gI
s=\bч[её]тко у них тут все\b=чётко у них тут всё=gI
s=\bчисто все\.\b=чисто всё\.=gI
s=\bчо я все на хозяйстве\b=Чо я всё на хозяйстве=gI
s=\bчто - все\.\b=что - всё\.=gI
s=\bчто все в порядке\b=что всё в порядке=gI
s=\bчто все вокруг нормально\b=что всё вокруг нормально=gI
s=\bчто все время\b=что всё время=gI
s=\bчто все всерь[её]з\b=что всё всерьёз=gI
s=\bчто все д[её]шево\b=что всё дёшево=gI
s=\bчто все закончилось\b=что всё закончилось=gI
s=\bчто все и так\b=что всё и так=gI
s=\bчто все инкогнито\b=что всё инкогнито=gI
s=\bчто все на месте\b=что всё на месте=gI
s=\bчто все нормально\b=что всё нормально=gI
s=\bчто все остальное\b=что всё остальное=gI
s=\bчто все отнесено\b=что всё отнесено=gI
s=\bчто все подвижно\b=что всё подвижно=gI
s=\bчто все подполье\b=что всё подполье=gI
s=\bчто все развитие\b=что всё развитие=gI
s=\bчто все рассчитал\b=что всё рассчитал=gI
s=\bчто все сво[её]\b=что всё своё=gI
s=\bчто все сработает\b=что всё сработает=gI
s=\bчто все так оберн[её]тся\b=что всё так обернётся=gI
s=\bчто все так\b=что всё так=gI
s=\bчто все тихо,\b=что всё тихо,=gI
s=\bчто все тихо\.\b=что всё тихо\.=gI
s=\bчто все тяж[её]лое\b=что всё тяжёлое=gI
s=\bчто все уже решила\b=что всё уже решила=gI
s=\bчто все хорошо\b=что всё хорошо=gI
s=\bчто все, совершенное\b=что всё, совершённое=gI
s=\bчто вы все равно держите\b=что вы всё равно дЕржите=gI
s=\bчто же все видели\b=что же всё видели=gI
s=\bчто же все\b=Что же всё=gI
s=\bчто касается штурма и твоих дилетантских действий, то все\b=что касается штурма и твоих дилетантских действий, то всё=gI
s=\bчто ты все ворчишь\b=что ты всё ворчишь=gI
s=\bчто ты все как\b=что ты всё как=gI
s=\bчто это все вообще\b=Что это всё вообще=gI
s=\bчто это все наказание\b=что это всё наказание=gI
s=\bчто это уже все\b=что это уже всё=gI
s=\bчто, все\?\b=Что, всё\?=gI
s=\bчтобы все вспыхнуло\b=чтобы всё вспыхнуло=gI
s=\bчтобы все на прямоту\b=чтобы всё на прямоту=gI
s=\bчтобы все приготовили\b=чтобы всё приготовили=gI
s=\bчтобы все разнести\b=чтобы всё разнести=gI
s=\bчтобы все, как\b=чтобы всё, как=gI
s=\bчтобы вы все увидели своими глазами\b=чтобы вы всё увидели своими глазами=gI
s=\bчтобы обдумать все\b=чтобы обдумать всё=gI
s=\bчтобы ты все как\b=чтобы ты всё как=gI
s=\bчтобы это все держать\b=чтобы это всё держать=gI
s=\bчувственный или все вместе\b=чувственный или всё вместе=gI
s=\bшаг и все!\b=шаг и всё!=gI
s=\bшипами все вокруг\b=шипами всё вокруг=gI
s=\bшито это все\b=шито это всё=gI
s=\bшло абсолютно все\b=шло абсолютно всё=gI
s=\bэти все могут\b=эти всё могут=gI
s=\bэти все понимали, все знали\.\b=эти всё понимали, всё знали\.=gI
s=\bэти все поняли\b=эти всё поняли=gI
s=\bэтим вопросом все,\b=этим вопросом всё,=gI
s=\bэтим вопросом все\.\b=этим вопросом всё\.=gI
s=\bэто было ещ[её] не все\b=это было ещё не всё=gI
s=\bэто было не все\b=это было не всё=gI
s=\bэто все - иллюзия\b=это всё - иллюзия=gI
s=\bэто все -\b=это всё -=gI
s=\bэто все бабьи\b=это всё бабьи=gI
s=\bэто все барон\b=это всё барон=gI
s=\bэто все безнад[её]жно\b=это всё безнадёжно=gI
s=\bэто все белилами\b=это всё белилами=gI
s=\bэто все большая\b=это всё большая=gI
s=\bэто все большие\b=это всё бОльшие=gI
s=\bэто все бред\b=это всё бред=gI
s=\bэто все брехня\b=это всё брехня=gI
s=\bэто все в доход\b=это всё в доход=gI
s=\bэто все в теории\b=это всё в теории=gI
s=\bэто все вопросы без ответа\b=это всё вопросы без ответа=gI
s=\bэто все выгодно\b=это всё выгодно=gI
s=\bэто все где\?\b=это всё где\?=gI
s=\bэто все глупости\b=это всё глупости=gI
s=\bэто все даже к\b=это всё даже к=gI
s=\bэто все детские страшилки\b=это всё детские страшилки=gI
s=\bэто все для\b=это всё для=gI
s=\bэто все до первого\b=это всё до первого=gI
s=\bэто все дождь\b=это всё дождь=gI
s=\bэто все домыслы,\b=это всё домыслы,=gI
s=\bэто все доставим\b=это всё доставим=gI
s=\bэто все досужие разговоры,\b=это всё досужие разговоры,=gI
s=\bэто все его\b=это всё его=gI
s=\bэто все жара\b=это всё жарА=gI
s=\bэто все заварили\b=это всё заварили=gI
s=\bэто все задел\b=это всё задел=gI
s=\bэто все замечательно\b=это всё замечательно=gI
s=\bэто все заучивал\b=это всё заучивал=gI
s=\bэто все и заложил\b=это всё и заложил=gI
s=\bэто все и изложи\b=это всё и изложи=gI
s=\bэто все игра\b=это всё игра=gI
s=\bэто все игры\b=это всё Игры=gI
s=\bэто все из за\b=это всё из за=gI
s=\bэто все из открытых\b=Это всё из открытых=gI
s=\bэто все к\b=это всё к=gI
s=\bэто все конечно хорошо\b=Это всё конечно хорошо=gI
s=\bэто все контролируем\b=это всё контролируем=gI
s=\bэто все легенды\b=это всё легенды=gI
s=\bэто все лирика\b=это всё лирика=gI
s=\bэто все лишь\b=это всё лишь=gI
s=\bэто все между нами\b=это всё между нами=gI
s=\bэто все мелочи\b=это всё мелочи=gI
s=\bэто все мелочь\b=это всё мелочь=gI
s=\bэто все меня\b=это всё меня=gI
s=\bэто все меняет\b=это всё меняет=gI
s=\bэто все мишени\b=это всё мишени=gI
s=\bэто все мне не\b=Это всё мне не=gI
s=\bэто все можно\b=это всё можно=gI
s=\bэто все на\b=это всё на=gI
s=\bэто все набрали\b=это всё набрали=gI
s=\bэто все наговоры\b=это всё наговоры=gI
s=\bэто все нарочно\b=это всё нарочно=gI
s=\bэто все не\b=это всё не=gI
s=\bэто все ненадолго\b=Это всё ненадолго=gI
s=\bэто все неприятно\b=это всё неприятно=gI
s=\bэто все нервы\b=это всё нервы=gI
s=\bэто все несчастные\b=это всё несчастные=gI
s=\bэто все ну\b=это всё ну=gI
s=\bэто все нужно\b=это всё нужно=gI
s=\bэто все объяснимо\b=это всё объяснимо=gI
s=\bэто все она\b=это всё она=gI
s=\bэто все от власти\b=это всё от власти=gI
s=\bэто все от молодости\b=это всё от молодости=gI
s=\bэто все от\b=это всё от=gI
s=\bэто все очень серь[её]зно\b=это всё очень серьёзно=gI
s=\bэто все очередные маневры\b=это всё очередные маневры=gI
s=\bэто все память\b=это всё память=gI
s=\bэто все помножь\b=это всё помножь=gI
s=\bэто все попр[её]м\b=это всё попрём=gI
s=\bэто все привед[её]т\b=это всё приведёт=gI
s=\bэто все проклятые знаки\b=это всё проклятые знаки=gI
s=\bэто все просто\b=это всё просто=gI
s=\bэто все проходили\b=это всё проходили=gI
s=\bэто все пускаем\b=это всё пускаем=gI
s=\bэто все развернут\b=это всё развернУт=gI
s=\bэто все рассказывать\b=это всё рассказывать=gI
s=\bэто все рассказываю\b=это всё рассказываю=gI
s=\bэто все розыгрыш\b=это всё розыгрыш=gI
s=\bэто все с переменным\b=это всё с переменным=gI
s=\bэто все сговор\b=это всё сговор=gI
s=\bэто все сейчас\b=это всё сейчас=gI
s=\bэто все складируют\b=это всё складируют=gI
s=\bэто все скуплю\b=это всё скуплю=gI
s=\bэто все слова\b=это всё словА=gI
s=\bэто все слушать\b=это всё слушать=gI
s=\bэто все смешно\b=это всё смешно=gI
s=\bэто все смотрит\b=это всё смотрит=gI
s=\bэто все снова\b=это всё снова=gI
s=\bэто все совершенно\b=это всё совершенно=gI
s=\bэто все сон\b=это всё сон=gI
s=\bэто все спекуляции\b=это всё спекуляции=gI
s=\bэто все специально\b=это всё специально=gI
s=\bэто все сразу на\b=это всё сразу на=gI
s=\bэто все суеверия\b=это всё суеверия=gI
s=\bэто все так странно\b=это всё так странно=gI
s=\bэто все тень\b=это всё тень=gI
s=\bэто все только из за\b=это всё только из за=gI
s=\bэто все только\b=это всё только=gI
s=\bэто все трава\b=это всё трава=gI
s=\bэто все тут было\b=это всё тут было=gI
s=\bэто все туфта\b=это всё туфта=gI
s=\bэто все ты\b=это всё ты=gI
s=\bэто все у\b=это всё у=gI
s=\bэто все умозрительные заключения\b=это всё умозрительные заключения=gI
s=\bэто все условно\b=это всё условно=gI
s=\bэто все утопии\b=это всё утопии=gI
s=\bэто все фигня\b=это всё фигня=gI
s=\bэто все частности\b=это всё частности=gI
s=\bэто все что\b=это всё что=gI
s=\bэто все эмоции\b=это всё эмоции=gI
s=\bэто все, что\b=это всё, что=gI
s=\bэто гонево все\b=это гонево всё=gI
s=\bэто ещ[её] не все\.\b=это ещё не всё\.=gI
s=\bэто ж все легенда\b=это ж всё легенда=gI
s=\bэто зачем все\?\b=это зачем всё\?=gI
s=\bэто мы все обо мне\b=это мы всё обо мне=gI
s=\bэто они все знают\b=это они всё знают=gI
s=\bэто ты все забыл\b=Это ты всё забыл=gI
s=\bэтому подчинено все\b=этому подчинено всё=gI
s=\bя все беру\b=я всё беру=gI
s=\bя все больше\b=я всё больше=gI
s=\bя все ещ[её] не\b=я всё ещё не=gI
s=\bя все ещ[её]\b=я всё ещё=gI
s=\bя все за\b=я всё за=gI
s=\bя все запишу\b=я всё запишу=gI
s=\bя все как то\b=я всё как то=gI
s=\bя все как тоъ\b=я всё как тоъ=gI
s=\bя все над\b=я всё над=gI
s=\bя все насч[её]т\b=я всё насчёт=gI
s=\bя все о\b=я всё о=gI
s=\bя все планирую\b=я всё планирую=gI
s=\bя все по\b=я всё по=gI
s=\bя все помню\b=я всё помню=gI
s=\bя все практически\b=я всё практически=gI
s=\bя все сделаю\b=я всё сделаю=gI
s=\bя все таки\b=я всё таки=gI
s=\bя все тебе\b=я всё тебе=gI
s=\bя все это\b=я всё это=gI
s=\bя ем все\b=я ем всё=gI
s=\bя ж по понятиям все\b=я ж по понятиям всё=gI
s=\bя знаю все о\b=я знаю всё о=gI
s=\bя не все могу\b=я не всё могу=gI
s=\bя не все тебе\b=я не всё тебе=gI
s=\bя оставил все -\b=я оставил всё -=gI
s=\bя оставил все!\b=я оставил всё!=gI
s=\bя помню все\.\b=я помню всё\.=gI
s=\bя сделаю все для\b=я сделаю всё для=gI
s=\bя узнал все\.\b=я узнал всё\.=gI
s=\bя это все заранее\b=я это всё заранее=gI
s=\bявно все \(или\b=явно всё \(или=gI
s=\bясно мне все\b=ясно мне всё=gI
s=\bясно с вами все\b=Ясно с вами всё=gI
s=\bясно с вами обоими все\b=Ясно с вами обоими всё=gI
